[{"title": "Google Play Store 7.8.15 Prepares for Instant Apps Support", "comments": ["Funny enough, I looked into my applications list in settings and I found \"Google Play Services for Instant Apps\"", "I am seeing instant apps already. Visit any Zillow link and it will load the instant app to show the contents with a link to install the full app.\n\nIt's quite nice.", "[Relevant xkcd](https://xkcd.com/1367/)", "I'm an app developer and I don't see the point of instant apps. They provide little to no advantage over PWA", "[deleted]", "Is it only me but latest Google Play Store with changes in my apps is so fucking slow", "Still have scrolling lag on Google play since Android 1.0 ;]", "Ugh. Still an incredibly stupid and unsafe idea. Besides the fact that it opens much more abuse and malware possibilites. Also [relavant XKCD](https://xkcd.com/1367/)\n\nALSO, why did Google basically do this for years on Chrome, then do it on Android and remove it from chrome at the same time?", "Now this is what I call innovatin'.", "Am I wrong in thinking we already had instant apps? I've been using realestate.com.au here in Australia and it's been giving me the instant version rather than the website or the full app. ", "I thought I got an instant app update at the weekend. I just tested it working with SkyScanner through Chrome, it was pretty quick and smooth.", "Mine worked on my pixel today for wish.com, instant app.", "I just visited Twitter, and it asked me if I wanted to add Twitter Lite to my home screen (which is an instant app). ", "Oh look, they figured out how to get people to be excited about unblockable ads. Unless you have root of course.", "Allo uses an instant app. So you can message anyone on Android  7.0 and up I think.\n\nEdit: apparently it's all preview messaging, sorry guys. Still seems to have the same effect though", "Apps that have more access to my personal information and really only show a mobile version of a website... No thanks. ", "I think it's been available as preview for ages, but was only available with some obscure apps.  \nI know I checked it out months ago, but since the only app I really knew was alibaba(which I don't use, but at least know it exists)... I forgot about it again.  \nIf it will now start working with other apps, then neat. If it stays only for irrelevant apps.. yay.", "Today I saw that Google Play Services for Instant Apps was updating on my phone. I checked the google settings and found a switch to turn Instant Apps on.", "Can you maybe provide a link?", "Does it work only in Chrome?", "Instant apps needs to be enabled in Settings>Google. I guess they have it disabled by default until the rollout.", "[deleted]", "Is it? It seems more like \"extra annoying ads\" to me. I mean, I guess we'll see.", "Mmm, cookies", "Considering they are native it's really not relevant at all.", "I see a few use cases... like integration of native APIs that aren't readily available via HTML5. \n\nLike walk into a store and get an instant app that has the coupons readily available? Or even a barcode scanner that let's you scan and purchase your own groceries without having to go to a cashier (this sort of system exists in some locations as far as I know) ", "It lets a user get a \"preview\" of an app without downloading it. Imagine going to Amazon.com, but instead of seeing a mobile website you get to use their app, without having to download it. When you're done it doesn't stay in your app drawer, since you never downloaded the real app.", "See the [relevant xkcd](https://xkcd.com/1367/).", "It's... literally the first sentence of the article.", "If you read the article for 5 seconds... You'd know. ", "It's a webpage that has more access to your phone's system, opening up more security risks and using up more data to \"download\" the rich web page for no reason.", "Yeah I thought Pixel will end this but Alas scrolling lag is still there on my Pixel.", "How bad is it for you?\n\nI have maybe a 1 or 2ms lag once if I scroll all the way down, its certainly not slow by my standards", "Not an instant app, just their mobile site built with react.", "Wrong. Allo uses [App Preview Messaging](https://developers.google.com/android/guides/app-preview-messaging), not Instant Apps.", "Wait, can you explain further?", "You should learn to read, these aren't webapps. ", "I checked it out with the Wish app. Pretty sure I'll never stop seeing ads for low quality edgy looking jackets made in Korea now.", "Yeah the only app I know of that uses it is that silly messaging app Allo that no one uses. ", "Oh, I see no such thing right now", "I'm on 7.1.1 and don't see it on Pure ROM. Might be a 7.1.2 or Pixel thing?", "That works only if you install the application. It's not related to instant apps.", "Make sure instant apps is enabled in Settings>Google. That is the normal mobile web popup, not instant apps.", "You tap a link and it opens in a light weight instant app instead of web browser. The web page typically has way more ads in it. So I am not sure of your point.", "This is possible with PWA", "[deleted]", "It's not a preview app, it's the **same** app.  Instant Apps is a second sandboxed layer on top of Play Services.  \n\nUsing Amazon as an example, Amazon would modularize their app into distinct components (preferably smaller, functional bits) and enable the instant app framework.  When you open it as an instant app _only_ the bits that you're actually using are downloaded and run.  Additional bits are downloaded on-demand.  \n\nBut it's the exact same app, same codebase, same Play Store link, and so on.  ", "Why would an app be better than mobile optimised page (PWA)", "Except the Amazon website is almost exactly like their shitty mobile website ", "> Imagine going to Amazon.com, but instead of seeing a mobile website you get to use their app, without having to download it.\n\nRedundant example, since their app does nothing that the website can't do.", "You drank the /r/Android Kool-aid. Never, drink the Kool-aid.", "Ah darn. Thanks for the info.", "I see. I'll have to look into what that is", "When I messaged my friend using Allo, he didn't have it.\n\nInstead of a text message from Google servers (usually displayed from a 5 digit number \"didacti_tomato has sent you message using Allo, you can respond by sending a text to this number\") it now brings up a pop-up of \"Allo lite\" we'll call it. Where they can send an Allo message back without downloading the app.\n\nIt's pretty cool and actually makes Allo much more easy to use with anyone as more phones update to 7.0", "He got it confused. Allo uses [App Preview Messaging](https://developers.google.com/android/guides/app-preview-messaging), not Instant Apps. It works how he described it to you, but it's not Instant Apps though.", "I understand that's what they say. But in practice, it's basically what they are. It's not useful and all it does is try to weasel one more app on to my phone. ", "You're thinking of App Previews. Instant Apps is different.", "Check Settings > Google > Instant Apps", "I don't have the setting either, but I have seen notifications from the app before. \n\nI don't know about this google. Your history with application security in the play store is rather poor and I'm not sure that I trust you to be installing apps on my phone on the fly. ", "Not a 7.1.2 thing. I don't have it either. ", "What's PWA?", "I think it's mainly that native code will perform better than a mobile optimized page, but idk I'm just regurgitating what some dude said further down the thread", "Accessing the camera api with PWA? ", "I'm skeptical until I can see it in action and it run well. I have no end of frustrations with webpages that try to be fancy. They never seem to work well or correctly. But I have yet to see a PWA, so we'll see", "There's actually a feature in Android called 'Nearby' which will give you a single notification if there's something relevant close to you. You can also turn this notification off and just have the 'Nearby' icon as a shortcut if you want to check manually. ", "That's exactly what happens for most Android users. ", "How does it handle permissions? I'm looking at you, Facebook. ", "Native code, which above all means better development tools available. In particular for performance. \n\nYou can for example load up just the assets of a game demo that somebody's using when playing, directly from your promo site. No install needed. No wasted bandwidth.", "#*Material Design*", "For Google? \n\nBecause it locks non-Android users into sub-par/incomplete versions of the website. This will be catastrophic for the open web if it ever catches on.", "The website has abysmal performance though. It takes ages to finish loading on every device I've ever used it on. It often \"jumps\" multiple times while loading as well. \n\nUsing the mobile site is a bad experience. The app is a lot better. ", "This isn't instant apps, [it's App Preview Messaging.](https://developers.google.com/android/guides/app-preview-messaging) and other apps can take advantage of those features as well.", "Neat! That's a pretty slick implementation in my opinion", "Holy shit that is amazing", "Except they're not web apps, *at all*. They are literally native apps. \n\nAlso, they are bound by the same set of permissions as native apps, so they can't access your contacts unless you give it permission to. ", "Just checked my settings, it's there! Turned it on :) I'm enrolled in the beta program as well. ", "[deleted]", "https://en.wikipedia.org/wiki/Progressive_web_app", "Progressive Web Apps, I believe.", "Yup. https://qrcodescan.in/", "Works!", "First time I've ever heard of this. How does it work?", "Permissions are asked for when needed since Android 7 (maybe even 6)..", "Better dev tools? I doubt it. The web development toolkit is quite mature, devtools in chrome works great and you can debug anything you want. \n\nNo install, sure - but you still have to download the app, it will be just streamed instead of downloaded, but not sure if they'll manage to have smaller bundle size.\n\nI mean, I get the ida that you can preview the app without downloading. I was asking in the mere example of Amazon, if in this case has any business benefit of presenting the app instead of linking to mobile optimized page.", "Nothing stopping a web app from using Material design.", "It doesn't do that though, there's no reason you wouldn't maintain a mobile page as well, the instant app is just a nice feature on top. Maintaining the instant app is the same as maintaining your full app.", "GCM is how Google (and all android apps) do push notifications. You're thinking of [app preview messaging.](https://developers.google.com/android/guides/app-preview-messaging)", "Oops, my bad", "Not everyone has modular permissions though. If someone is still on 5.x does that mean that the app has the same permissions level as their browser or (worse still) as Play?  Probably​ not, but I'm curious how it does work.    ", "Even native apps aren't always a completely separate thing. A lot of them are simply an interface to a webpage. My point is they provide me with really no reason to use a special app and by installing the app it's going to gather data on you. ", "I know, it's not there. ", "Damn. I'm a web dev and an Android app dev but I've never heard anyone talk about this before.\n\nThe most I hear of are responsive sites that use css to render in \"mobile mode\"", "Welp, time to pack up ", "There are [a few](https://developers.google.com/nearby/notifications/overview) different ways to [do it](https://nakedsecurity.sophos.com/2016/06/10/google-nearby-location-aware-popup-ads-for-location-aware-apps/) but I think any android user with location services on will recieve an alert when entering Costco (for example) about deals and specials. It may be tied to Google Now, or whatever they call their suggestions page in the OS. ", "You are correct. It's been a thing since 6.", "Ah, yes that is what I meant. Still, it's not Android Instant Apps.", "That's a good point, I'm not sure what the default permission level would be in this case. Most likely the same as any other user installed app.", "Same", "They're fairly new things. I hadn't heard of them before reading a Google blog about them around the end of last year, I think.", "That explains it, seems to depend on having Bluetooth and location enabled, and I seldom enable Bluetooth. I guess if you use wireless headphones you're screwed."]}, {"title": "Google Rolls Out Instant Apps Feature For Android: Download And Run Apps Without Installing Them", "comments": ["You might even call them something cute like app-lets.", "[Relevant XKCD](https://xkcd.com/1367/)", "[deleted]", "\"You know what, Android isn't insecure enough - we need a better way to spread malware and viral apps - Any ideas, folks?\"", "Any examples? ", "I'm sure all the permission-limiting features will be left out of these 'downloaded apps', and they'll run as \"all-on-all-the-time\". It's for simplification!", "what's the benefit?  saving like 10 seconds?", "Do you mean WebApps?", "Lol. So they will fail?", "that's basically what I came to say...\n\nWe should be working toward expanding the permission APIs in the DOM to allow web pages able to do more of what is currently limited to apps so that web sites that function more like apps, rather than creating a new platform specific API that lets apps behave more like web sites.\n\nThere's very little gap now. There's only a handful of things web sites *can't* do now as it is.", "[removed]", "It's really galling that Firefox OS failed, because they were basically right. ", "It is regular apps except in a custom environment, and you only download the parts of the app that you use (like just one level of a game). It is like the app is installed on an external drive - which is located on the server. ", "You get an md5 sum of \"trusted apps\", then you allow auto install of trusted apps.", "I was thinking the same thing. Instant malware!", "Why do you think Android is insecure? It's nearly impossible to get a virus unless you're doing something stupid. This isn't the Apple app store, which has been compromised on many occasions by Chinese hackers.\n\nEdit: in case anyone has been living under a rock: http://www.businessinsider.com/iphone-app-store-hacked-by-xcodeghost-2015-9", "[deleted]", "lol i popped into say this.. no need you are on it! What a joke :/", "Imagine going into a mall, wanting to use their maps to find the place you want to go to. Combine with Google's Nearby Bluetooth beacon protocol and your phone can be told to load up just the map portion of their app, making the experience faster and smoother than browsing to their web page and doing it that way.\n\nOr playing a game demo without installing anything. ", "No, regular Java based Android apps. But they're kind of \"streamed\". ", "Yeah like enabling the access to the vibration controller to a web api so we can make super awesome web games! \n\nUntil ads creators use the same api to beat the shit out of you every 2 seconds.\n\nThe less access untrusted people have to my device the better.", "Sounds like a security nightmare to me. Users can be far more easily tricked into giving permissions to the wrong website than they can be tricked into downloading the wrong app from a (theoretically) curated app store.", "Man I got so confused.", "Better to use signed apps but yea", "You do not use MD5 for anything involving security. It is super easy to crack, you can do it on a phone in minutes, too many collisions.", "Android allows end users to simply uncheck a box and then install from anywhere. There are a few more hoops on iOS, but I dislike both equally.", "> Jelly crapple \n\nThat's the worst baked good I've ever heard of.", "Sorry, Woz did nothing wrong, Jobs was an ass.", "Thanks for explaining instead of just downvoting me", "Chrome asks you every time you want a website to allow access to your microphone, camera, location, etc. I'm sure all the other APIs would be no different.", "I've created a few apps which merely present a web view and load a webpage and fetch dynamic data to populate said webpage. Wouldn't be much more of a difference tbh as long as Google still has the power to curate what apps are available or not so if your app becomes malicious it goes bye bye. ", "You're suggesting to scrap a technology based on the lack of education people have about that technology.\n\nIf this were the case with computers you'd be working in a coal factory right now.\n\nAll app stores are filled with security flawed and privacy infringing apps.\n\nThe only exception is Linux and this is because of open source.\n\nIf you want to fix this problem, educate the people. :)", "What is the security nightmare of \"when playing video, tell the phone to go into landscape mode\". That is the ONLY reason I need to build an app for my latest project. That one nicety for the end user.", "He's right, no point in downvoting him. \n\nFrom 2006: http://www.mscs.dal.ca/~selinger/md5collision/\n\nhttps://www.win.tue.nl/hashclash/\n\nMD5 is weak", "Which is *why* MD5 was an appropriate answer to the (jokey) question of \"how do we make Android more insecure?\"", "What the fuck?", "Why do you dislike unchecking a box? You're definitely warned when you uncheck it...", "If you really want to limited it down, XposedFramework has mods to hide your battery stats from the browser, and I have a few apps like Paranoia which detects, intercepts and blocks use of camera, mic or gps, unless the app is whitelisted, and I also replicated the function in an a Automate script I created that will automute the mic for all apps except whitelisted ones, so not only can they not listen in without my permission, but I can choose by activity so the dialer can do something specific like Hangouts can never ever access my mic, unless the foreground current function is like com.google.hangouts.callactive which is a bit more focused where as Paranoia is sort of you give an app a blank check once you say they can use those features.", "Why do you need the whole phone to go into landscape? Can't you just put the video in landscape and full-screen it(which I'm pretty sure you can already do in mobile browsers)? And that may be an innocuous case, but if we start adding all sorts of permissions for websites, then the potential vulnerabilities increases.", "Download Automate by LlamaLabs, replace every app you'll ever need, with your own fully customizable visual flowchart scripts\n\n3 blocks of code\n\n[If Media is Playing], then [force-landscape], if not then [force portrait], loops to block one.  It will only trigger when media starts or stops, it wont run constantly.  IT uses damn near nothing battery wise, you can even specify apps like \nWhen media playing in \"VLC\"  then .... else .... followed by expanding it to when VLC is foreground set auto-set volume and brightness to xx %.\n\nIt works fantastic I do things like when screen on CPU governor set to ondemand and clockspeed x.xGhz when screen off set to conservative and 400Mhz or When in call turn on bluetooth or when in call turn on speaker, and it will automatically turn them on an off only during calls.  100 or sode prebuilt code blocks, use simple flow charts and child capable logic to replace any apps on the market.  I use VoIP on a tablet SIM, so I had to create all my own custom texting features like auto reply, reply by voice commands, read texts aloud.  Automate essentially replaces majority of all the convenience apps I wanted or didn't realize I needed till I built them, plus there is a community with thousands of prebuilt 'flows' created by other users it.  It's a must have app, if you don't have root and want to use root features, you can use the interact code block to press buttons on screen (eg. turning data on and off)  You can do some neat things like data off when screen off, data on when screen on, GPS is always off until GoogleMaps or Waze are the forground app, then GPS is on, check every 5 minutes until maps or waze is not the foreground app then turn off gps.  Anything you can do, automate can do better.  I have it remember cell towers and automatically do things when I reach or pass physical destinations without even using GPS or high accuracy wifi location awareness, it's fantastic it can auto turn on wifi when I'm on cell towers at my house or other preferred locations, if wifi stays disconnected or I connect to a different cell tower eg. I walk down the street it automatically turns on data and turns off wifi, no human interaction involved, and it's damn near seamless.", "And here I thought I was in r/technology...\n\nThanks internet bro!", "You're both wrong. It's impossible to generate a new file that has an MD5 sum which matches the MD5 sum of a file that someone else created. You have to be the creator of both files to be able to pull this off.", "*sensible chuckle*", "It is broken for this purpose: http://www.mscs.dal.ca/~selinger/md5collision/\n\nhttps://www.win.tue.nl/hashclash/", "These people have no idea what they are talking about. Using MD5 to compare apps is perfectly legitimate no matter if md5 was \"hacked\" (lol) or not. The idea of somebody trying to create a program that is diffferent from another, but has the same md5 checksum is amusing, but completely unlikely. Hashing algorithms only have to be as secure as neccessary. \n\nAnother fun fact: Absolutely nothing wrong with using a salted md5 hashed pw database. ", "I'm assuming that person was thinking about using MD5 to hash passwords, which is correct - it's one of the worst things you could do aside from leaving them in plaintext and provides effectively 0 security. That said, as far as I know there is no easy or realistic way to get your malware to have the same MD5 hash as a legitimate version of a program, so it's perfectly fine to use MD5 as a method of verifying that you have the right version of a file.", "I am saying the barrier to entry into the ranks of the infected is much lower.", "I assume Paranoia is used for apps on android. I don't have one so I am not wholly familiar with how it handles permissions. But I thought it was like the IPhone. Unless you give it permission then it can't use the feature? Or am I misreading what this app does?", "The user can, the point is improving the experience for the user and locking the video player to landscape. Very common in video apps, and it only affects the \"page\" being displayed.\n\nHowever, my example is one of \"app get to do this no problem, no special permissions etc. Web pages aren't allowed to do this.\" To show why app-ifying everything is kind of stupid at this point.\n", "Doesn't solve the problem of generating an app, submitting it, etc agreeing to give apple or Google a 30% of subscription fees etc. Just because I want people to not have to manually rotate their phone and potentially lock rotation for my player page.\n\nThey get the effect I want by pressing the full screen button but you missed the true problem that should be rectified.", "That's exactly the point. You don't need to match the file somebody else created in this situation. ", "I never miss an issue. That would be madness!", "That isn't quite the same as creating a fake android app and then making it collide with the MD5 of a legitimate app, though...", "Wrong. It was broken back in 2005-2006.\n\nhttps://www.win.tue.nl/hashclash/SoftIntCodeSign/\n\nMD5 is OK for stuff *you* created *for yourself*. MD5 is still good in HMAC. It works for stuff you use with salts / nonces. (Sidenote: regular hashes should never be used for passwords, only key derivation functions like scrypt.)\n\nBut it absolutely DOES NOT work for validating 3rd party files of any kind, if they could come from any arbitary source (if not all authors are perfectly trusted), especially not file hosts for software.", "No, MD5 collisions are easy to generate. This specific usecase is exactly the worst possible for MD5;\n\nhttp://www.mscs.dal.ca/~selinger/md5collision/\n\nEdit: https://www.win.tue.nl/hashclash/\n\nYou create a malicious and a safe program together and design them to have colliding hashes, and then get the safe program signed. \n\nThen you serve up the malicious program using the signature and hash of the safe one.", "It's not lower at all, Google just empowers it's users with a choice where Apple does not. If someone checks the box, infects their phone (ostensibly/most commonly from downloading pirated apps), and complains, then they're just being stupid.", "The thing is that you create both. You create a safe and a malicious version. ", "You uh... You spoof the MD5...", "Wrong for the same reasons as before HASHING ALGS ONLY HAVE TO BE AS SECURE AS NECCESSARY. Creating an executable that does the malicious thing you want it to AND has the exact same hash as an App in an App store is an incredible mountain of work and not worth the effort for anybody. ", "That exploit only works if you are the one serving up the evil *and* good program, as both programs need to be constructed in a specific way - that is almost never the case. That doesn't show that you can create a malicious program which matches the MD5 hash of an arbitrary program.", "If users in general are empowered on Android, but walled off in iOS that is kind of the definition of a lower barrier to access.", "MD5 literally ISN'T as secure as necessary! \n\nYou've been disproven already, because you can create two apps where a safe one is submitted to the app store, and the malicious one uses the same signature and is distributed outside it.\n\nThe link above proves it.", "Sure you can. Add garbage data to the end of the code until the checksum matches, don't even need the good program. MD5 is seriously shit. SHA256 is even fairly weak nowadays, but still usable in this case IMO.", "But that's the point - you don't need to. If you can get any safe programs of yours certified, you have the opportunity to create a fake one that can reuse the same signature. ", "Prove it. Make a false calc.exe program that will still execute and do something with the same MD5 hash as the Win7 version.\n\nEdit: Here's why that won't work (or at least won't work with the method linked above) - in that method the programs have to be *identical* except for 128 bytes in the middle. That's just enough room to squeeze in a if statement that lets you change from the good to the bad program. Both your good and bad program contain the good code and malicious code, and just has a switch that chooses which chunk to execute.", "No man, this is not a real thing. It is impossible to do this. No one has ever been able to do this in the history of the world. You have to be the creator of both files, otherwise it's impossible to do. You cannot create a new file and just match it to an arbitrary MD5 value of another file. ", "Ah, so your argument is not that an external person is trying to impersonate a known good program, but someone is malicious from the start and trying to abuse the store system by first deploying a good program to get through the review process and then changing it to an evil one?\n\nWell that would be an issue....except I don't believe you can submit the same version of a program into the store twice (most package managers won't allow you to push the same version of an existing package). And if you have to deploy an incremental version, then the store is already expecting a different MD5 hash, so they are either verifying security in a different manner or were already exploitable and the MD5 attack adds nothing.\n\nEdit: And you wouldn't make it through the initial check using the method you linked, as for that to work the \"good\" program has to contain the malicious code as well, it just never executes it.", "https://www.win.tue.nl/hashclash/\n\nhttps://www.win.tue.nl/hashclash/SoftIntCodeSign/\n\nAlready done.", "You are correct, but I think /u/Natanael_L and /u/Tethalamin have gone so far down the rabbit hole that they can't possible admit that they made a mistake and have been wrong this whole time, without feeling stupid. So their own insecurities prevent them from realizing their mistaken interpretation.", "Everything about the programs can be different except the signature, if it only directly signs the file itself. There's plenty of other MD5 collision tools, even capable of making collisions for different filetypes.\n\nEdit: https://www.win.tue.nl/hashclash/ - chosen prefix attack", "Many people side-load apps from sites like apk-mirror.  If you're relying on MD5 for the signature, then you've got a situation where the phone can verify the signature of the app and install even though the app is not the same as what's available on *insert app store here*.  There are a few attacks that use of MD5 would make easier.  I honestly have no idea why you're arguing for it, considering currently-believed-secure alternative hashes exist.  Even sha1 is partially broken."]}, {"title": "Verizon Google Pixel Android Oreo Update Page Mentions Always On Ambient Display and Instant Apps in Pixel Launcher.", "comments": ["Just got the update on my Pixel XL (Verizon)", "Is it wrong that I'm not excited about this? Between the loss of the blobs and all the complaints about the white, I'm worried that this won't be that worthwhile of an upgrade. ", "And yet I'm still waiting for it on my unlocked Pixel? Is it an opt-in kind of setting I don't know about, or?", "Sorry for segue'ing this, but I wanted to ask. Is there a way to see if our devices are currently supported by Project Treble?", "I'm still waiting for my Oreo Google and Verizon....", "Just got this for my pixel. The screen unlock and lock sound is terrible now. Anyway to change it back?", "The OTA update is rolling out in India too! :D Just updated my Pixel.", "I thought Ambient on Display was one of those features that Samsung implements but nobody really need.", "Is this supposed to be new? I've had the update for weeks since I was in the beta program, could have sworn I had both these things.", "[deleted]", "Same! ::it's_happening.gif::", "Does it have Always-on?", "Seriously? lol wth fi! ", "Still a worthwhile upgrade. You get used to the white eventually. O is super smooth and stable. Plus battery life is better. Good foundation going forward.", "At least Substratum works without root now, so you can install a black theme.", "There's a lot of important updates under the hood.\n\nYou can root and replace the new emoji with whatever you want, and you don't have to even root to theme.\n\ntldr: yes", "The improved standby battery life alone will be worth it!", "The new emojis grow on you, in a shit-posty kind of way.", "[deleted]", "If you enroll in the Android Beta program, you'll get the update immediately. You can then unenroll from the program and you won't be rolled back nor will you lose any data. \n\nI did this the day it was released and it worked like a charm. Didn't lose any data or anything, got the same build number everyone's getting here.", "Only Pixel devices updated to Oreo are compatible.\n\nGoogle is working with some OEMs to add more devices when they update to Oreo too, nothing official yet.\n\nApart from that, **all** devices with Android 8.0 out of the box will have Trebel.", "[deleted]", "TIL people keep those sounds on", "That's a Pixel launcher feature, not a Verizon one. And it suggests apps you have installed based on which you launch most frequently and at which times.", "Yea, as /u/Ashanmaril said, I don't think that feature is what you think it is", "What's cringy about it to me is that \"Instant Apps\" is a thing and that sure ain't it.", "Yes. Turned on by default!", "Lol. I had Google app crash twice within 2 minutes of updating, plus Amazon music crashed and Outlook had to be re-installed because even wiping the data would crash on boot. \n\nMost of those crashes were \"background\" crashes when I was as doing something else and all of a sudden got a \"app is not responding\" thing. \n\nIt seems ok now after a few hours, but it's definitely not perfectly stable.", "> O is super smooth and stable. Plus battery life is better. Good foundation going forward.\n\nI've heard this line for almost every Android version for the past 5 years.", "Doesn't appear to be out yet. Is it? ", "> You can root\n\nNot with the Verizon model you can't (unless you got in before they patched the unlock exploit).", "You take that back! 😤", "Ditto. My wife's Pixel had the notice, I hit refresh on my XL, and got the download option.", "Just happened to me. Naaaaaace", "[deleted]", "This post is suggesting this section will begin to suggest apps that you have *not* installed, as well.", "Tell me about it, can't stand them. Really don't see the appeal. Sure go ahead and install apps without asking me, i don't mind. Remember when that was called malware?", "Can you post a picture of what it looks like? Are there any options to change it?", "That's not 'always on' just ambient display.", "Sounds like a problem unique to your device and not the general consensus", "Shouldn't that be a good thing that battery life has improved with every update over the last 5 years?", "Ever since 5.0, I've been hearing that from this sub. First project volta was going to revolutionize smartphone batteries. Then doze was going to \"massively extend the standby times of phones\" so they could sit on a shelf for months and only lose 10%. Then nougat was going to go even further with \"active\" doze, or mobile doze, or whatever it was called and \"almost completely eliminate battery drain while the phone was in our pocket, not just on the nightstand\" \n\nNow here we are with oreo, and finally there's no \"revolutionary technology\" it's just \"we're going to restrict background drain\" The same way they say Android X is our sweetest release ever, Android X is also always \"the most energy efficient release ever\" Which is probably true, because I doubt they go backwards in energy efficiency, theyve made such a big deal out of \"revolutionary battery technology\" that doesn't really make a noticably big difference, that if they actually do have some mind-blowing battery technology, nobody will believe them.\n\nAnother part of it is, I'm sure the new battery optimizations really need new hardware to really take effect. So while the Nexus 5 might not have seen much from lollipop, the Nexus 6 did because it was designed with it in mind.", "I just tried. Substratum doesn't work yet. ", ">Also, I can unlock it in the dark with my eyes shut to use Google Now with my voice without opening my eyes.\n\nYou can do this while locked with a Pixel or just use the fingerprint sensor.", "That is not what is suggesting at all.\n\n> But what is more interesting is that you can see application icons for things such as BuzzFeed and Airbnb’s instant apps. We discovered this change in a commit that was published to AOSP and it allows system installed launchers to see instant apps on the device\n\nThe article says that now **instant apps** are searchable through Pixel Launcher and they will appear as any other app in the suggestion box ", "Can't you disable instant apps in the Play Store?", "This...\n\nhttp://www.androidauthority.com/android-8-0-oreo-verizon-pixel-pixel-xl-2-796621/", "It's an update touted as 'always on'. Ambient Display tweaked/updated. Don't downvote me fool. :p", "Well its a stock pixel xl, so I'm not sure why it would be different from any other.", "It is. I'm just saying that it's never quite as great as everyone is hoping it will be.", "Even when the utility is released, it's not entirely standalone. You will have to plug into a computer and run a utility to give the Subatratum app permission to apply themes. If you reboot, you'll have to plug in again if you want to apply different themes.", "[deleted]", "Do you install a fucking instant app?", "I didn't downvote you.", "Who is your telco?", "[deleted]", "The arent installed per se, they are cached for several days tho (I think 30 days), the post suggest those \"cached\" apps  will be searchable nothing more.", "Verizon", "[deleted]", "[deleted]", "Verizon have a slightly different version to everyone else, so that maybe your problem. ", "My 6P does a double vibration if it fails and a single longer one if it unlocks. I assume the pixel also does something similar.", "Ironic", "[deleted]", "You were wrong and yet you complain about downvotes?"]}, {"title": "500 million devices now supported for Android Instant Apps", "comments": ["Too bad there's like 5 apps that support it.", "[deleted]", "Too bad no apps support it in my country", "There's many non-Android devices out there. Development on enhanced websites will win out over this.", "I don't think this was well hyped up like it should have. Nobody outside of /r/android will ever really even be aware of Instant apps at this point. And that's a problem.\n\nIf they had build more hype for this, this IO, maybe that would have got more awareness.", "[deleted]", "I hate instant apps. It keeps constantly updating apps and it serve without anything you could ever do about it.", "I wonder how many of those device owners actually want Instant Apps?\n\nI certainly don't. It seems like a security risk, with little real benefit.\n\nThe only reason it is on 500M devices is because Google is forcing it on us. It installs automatically without your knowledge or permission. If you try to remove it, it will silently reinstall itself. There seems to be no way to disable it. It behaves almost like a virus. Very annoying.\n\nEdit:\nInstead of just downvoting me, please explain what you disagree with. I'd really like to know.", "-1 for me. First thing I did when it popped up on my play store was read up about it and realise it's a potential security issue.\n\nFuck anything that installs random garbage on my phone. My data is limited. Every site owner and their dog thinks they're important and I must install their services.", "Everytime an instant app has popped up on my S8+ it's been a great experience. Not sure what all the negativity is about.  Excited as more and more developers put time into making it available.", "I have the Instant Apps option in Google Settings but haven't come across any Instant Apps so far", "How do you use it? I can't find any setting for it.", "Instant Apps would be amazing for my app, but Xamarin doesn't support it yet. Hopefully they figure it out.", "[Relevant XKCD](https://xkcd.com/1367/)", "500 million devices is a hell of an incentive to develop for it though", "And one of those five is absolutely useless. I don't remember which instant app it was but one of them didn't actually open the content that was linked so it was useless.", "6!", "[deleted]", "But they can't use NFC and similar", "There was an announcement.... last year.... it was announced in May during IO. Should never have been announced a year and a quarter before it actually came.", "I think it'll be on individual developers to market it to an extent. Say you're at an unfamiliar shopping center and the parking registration is done through an app which you don't have installed.  You google it, and instead of downloading the entire app, an instant app pops up, you tap your phone to the terminal and it reads your spot through NFC, you pay with Android Pay, and you're on your way. \n\nThe user may not even know that what they did was use an instant app, they'll just know they had a very smooth experience. ", "First time hearing about this and have no idea what it is", "[Try this link.](https://stackoverflow.com/questions/45750899/difference-between-importing-a-interface-class-vs-using-implements-in-java)", "I think angry birds had instant app support at one point. Not sure if they do anymore though", "quite a few apps support instant apps. See [this image](https://developer.android.com/topic/instant-apps/images/50-logos-v3.png) ", "You can turn off Instant Apps you know?", "Yeah from my experiences, it is slower than just the webpage loading, which is about the same function and visual wise.", "You can turn it off in Settings->Google->Instant Apps", "You didn't get the point right. Instant apps make it so you *don't* have to install anything.", "Its because it doesn't make a big difference. The mobile website will look almost the same way as the instant app. The instant apps take a bit longer to load too.", "Depends. If it functions pretty much like your website, where's the incentive for companies to do that rather than just continue focusing on their mobile site?", "The whole point of instant apps is to be as tiny as possible. That's what makes them \"instant\".", "[deleted]", "The only icon I recognize is the one with actual words: The Weather Channel.", "If you really know how to do this please tell me! I looked in several forums already but the only way I found to disable the downloads is to withdraw 'google-Play-Services' the permission to the internal storage. This works but it's kind of a mess, because you can't install apps without switching it the whole time. And afterwards you also have to delete instant-service again.\n\nIf you mean the wonderful setting for Googles Instant app:  Yes I turned all of that off. I even deleted the app... It keeps coming black to the phone even without WiFi enable it just installs.\n\nThanks already.", "I feel the same way. Really have only seen it for Vimeo. At first it was pretty cool but the third time I was thinking, honestly this is useless and is much slower than just loading the website. \n\nThat said it might be great for feature rich websites like airline websites. ", "It also makes it so I install everything", "Instant apps provide a much better experience, in my opinion. ", "Many Android browsers can have easy-to-install and highly effective adblockers, such as Ublock Origin on Firefox. Websites wrapped up as instant apps guarantee that the average user who's not using other adblock methods (like DNS66 or Adaway) will see ads. I'd bet good money on many app developers pitching an instant app to news publishers as a solution to ad revenue problems.", "Ugh, I hate having to install a proprietary app which I am sure I am only going to use once. I love the instant app idea", "Yup, it's much smoother", "Wow that's evil. I guess instant apps is another feature to turn off and never think about ever again.", "So users will disable instant apps.  \nIf the feature it's not useful both for consumers and companies it's going to fail", "How is that evil?\n\nY'all want everything for free", "No. But I don't want to get forced into seeing ads. If you want me to pay you for reading your articles, I'll pay. Or I'll not pay and not read. But using my device's resources to circumvent my wishes is pure evil.", "Generally, ad implementation is much better within an app than within a browser. I don't mind ads if they aren't intrusive. It's literally what allows Google to fund the functions in Android that we get excited about.", "> If you want me to pay you for reading your articles, I'll pay.\n\nOut of interest, how many sites do you subscribe/donate to currently?", "Your *wishes* are something evil", "\\>Bad consumer, how dary you even *wish* for a better deal"]}, {"title": "Android Instant Apps starts initial live testing", "comments": ["We did it reddit?\n\nAlso would like to know in what scenarios you get an instant app?", "This is a dumb question, but how will Instant Apps work with app intents? \n\nFor example, if Reddit implements Instant Apps and their new [Reddit app](https://play.google.com/store/apps/details?id=com.reddit.frontpage&hl=enhttps://play.google.com/store/apps/details?id=com.reddit.frontpage&hl=en), will a Reddit link open in the Reddit app or in my already installed [Sync for Reddit](https://play.google.com/store/apps/details?id=com.laurencedawson.reddit_sync&hl=en)?", "Anyone able to see this in action? I've tried going to BuzzFeed links but it still just opens in the browser.", "I want my karma back for saying that it would still be available before next I/O", "Does anyone remember what happened to instant apps? ", ">BuzzFeed\n\n10 instant apps that WILL BLOW YOUR MIND! 7 is CORAGEOUS!", "paging /u/emd2013", "[deleted]", "I made a post(about 2 ,3 weeks ago) about it on /r/Google and now this.", "Wait, what? I'm certain I've already tested it during the last year when it popped up from time to time in search results. Is this test any different?", "There were a lot of articles recently about how it never came out, guess Google didn't want to keep people waiting ¯\\\\\\_(ツ)\\_/¯ ", "[removed]", "I'm assuming if you have an app installed that can handle it, it'll default to that app first, especially since Instant Apps is meant to display apps you _don't_ have installed.", "I'm guessing the app chooser will pop up and there will be an icon for the instant app and whatever other apps you have that are capable of opening x link.", "I was wondering this too...", "I want it back too", "The answer to your question is the OP.", "I hate BuzzFeed as much as anyone else on Reddit, but their Android app devs are great!", "You are talking about the new [WebApk's](https://www.xda-developers.com/deeply-integrated-progressive-web-apps-are-already-live-for-chrome-on-android/)?", "What site? ", "Or maybe those were Googlers who conveniently started raising awareness about it?  \n\nSeems kinda suspicious, especially since multiple posts asking about Instant Apps were posted in a span of 2 or 3 days. Or just a very very huge coincidence.", "I guess that's why is in testing with close partners to figure out a way that doesn't happen", "They're not going to let instant apps use just any permissions, if they're sane ", "Instant apps are being served by Google. I'm sure they'll not only limit what apps can be Instant Apps, but also rigorously inspect them.", "Well, since your app sets itself to open reddit.com links by default, I am 100% sure that will have higher priority. After all the instant app is better than displaying a website, but not better than using an app that can already handle a specific website. ", "I think you missed the point.", "It was a joke because there were 2 posts about instant apps recently ", "*puts tinfoil hat on*", "Stranger things have happened", "Even if it was the #1 priority for a company such as Google to respond to user feedback, they could not have gone from \"abandoned effort\" to \"limited public rollout\" over the weekend.\n\nRather than going with the conspiracy theory, accept that this is a very large and complex software project and has likely been ongoing for a while.", "> They're not going to let instant apps use just any permissions, if they're sane\n\nSince everything gets the Internet permission automatically you're already screwed.  ", "[deleted]", "[removed]", "I was literally just at Google and didn't read this announcement until I got in otherwise I would of asked the DevRel team. \n\nIn other news their London offices are very nice and have great views of King's Cross:\n\n[http://i.imgur.com/3pZ9pgm.jpg](http://i.imgur.com/3pZ9pgm.jpg)", "It could go either way. He's either dumb or witty. \n\nif toolsheds was being sarcastic than yes it went over my head.", "Have those stranger things *also* been disproved as conspiracies? *Hmm?*", "I said nothing about this being sudden. If anything I was saying how it seemed like those who posted over the weekend about it seemed to have known ahead of time that Google would announce this soon. That was the \"conspiracy\" of my comment.", "Well if you replace \"abandoned effort\" by finished but \"forgotten in a drawer\" then it would make sense.", "That just makes them glorified web pages if they don't get much else ", "Or if they block certain permissions from ever being granted until installed properly. ", "It's already known that instant apps will not be able to get almost any permission. For that you have to install the real app. They will not be able to run anything in the background or uniquely identify your device. ", "Is there a better app store with better vetting?", "Wow, that's cool! I've visited their Berlin offices last year, they were pretty nice too. Very playful. ", "Yeah, if you aren't paying attention to the sub, then I see how you might have missed it. There were a bunch of posts in the last couple of days asking this question.", "Yeah, why?", "Totally possible! A lot of developers were in on it (blog post has short list of launch titles), presumably under NDA.", "Forgotten in a drawer doesn't make sense to me at all. For one thing they've had these launch partners working on their Instant Apps for a while now, and they had other partners working with them as early as presumably a few months leading to last year's I/O so you could get the demos out in time.", "What is this Instant Apps thing which you are talking about?", "I think it's more likely just the timing. Google said they'll release it by the end of 2016 so people noticed the lack of it during the early part of 2017 which just happened to be when Google decides to release it after a short delay. If this happened later in the year though, that would have been more than suspicious. "]}, {"title": "I wish companies thought once before doing instant apps", "comments": ["Relevant [xkcd](https://xkcd.com/1367/) ", "I think customer behavior is surprisingly lazy, and market research might bear that out. For example, I'm not the only one with a friend who gets to Facebook on the desktop by Googling \"facebook\" every time. Customers do perceive value in these thin apps.\n\nThe publishers are often marketers, who love this sort of app because it's cheap but still grows the customer's relationship with the brand. They have the CrapCo app on their homescreen, they interact with the CrapCo app from day to day; they've got CrapCo on the brain.", "> It'll download an instant app that launches an activity with a webview that loads the same url.\n\nBruh", "> Do companies even think before rolling out an instant app? What advantage do their instant apps provide to consumers? What is the reason that consumers will even want to download the partial binary?\n\nDo companies even think before rolling out an app? What advantage do their apps provide to consumers? What is the reason that consumers will even want to download the app?\n\nFTFY", "I like the Vimeo instant app because for some reason I can't cast from the website anymore and I also don't want to install the full app because I rarely use Vimeo.  The instant app lets me cast so it pretty much solves this problem. ", "The app that facilitates them (Google Play services for Instant Apps) can access location and record audio and video.\n\nI don't know if an Instant App gets automatic access, or if there's user controls (like Flash had)... but that would be a benefit.", "Well, I have (downloaded) an app that just loads a webpage in a webview and therefore even misses some features. Some devs are lazy and don't understand the difference between a thin and rich client.", "Honestly there's probably not much else thay can do. \n\nI've been considering making instant app for my service, but with millons of restrictions imposed (https://developer.android.com/topic/instant-apps/prepare.html) I decided to just stay with mobile web version.", "Simply \"having an app\" is no longer a concrete strategy. As IoT grows, we will *hopefully* see mobile apps as the remote control for so many daily habits -- smart homes, health and fitness, shopping, etc. \n\nEnough hybrid, little utility apps, please! ", "I've seen some good ones. I personally like realtor.com's\n\nhttp://www.realtor.com/realestateandhomes-detail/2618-Richland-Dr_Garland_TX_75044_M73276-43976?cid=txt_shares_core_ldp", "I think virus writers work hard already. It should be called \"instant virus\"...", "[deleted]", "[Image](https://imgs.xkcd.com/comics/installing.png)\n\n[Mobile](https://m.xkcd.com/1367/)\n\n**Title:** Installing\n\n**Title-text:** But still, my scheme for creating and saving user config files and data locally to preserve them across reinstalls might be useful for\\-\\-wait, that's cookies\\.\n\n[Comic Explanation](https://www.explainxkcd.com/wiki/index.php/1367#Explanation)\n\n**Stats:** This comic has been referenced 108 times, representing 0.0646% of referenced xkcds.\n\n---\n^[xkcd.com](https://www.xkcd.com) ^| ^[xkcd sub](https://www.reddit.com/r/xkcd/) ^| ^[Problems/Bugs?](https://www.reddit.com/r/xkcd_transcriber/) ^| ^[Statistics](http://xkcdref.info/statistics/) ^| ^[Stop Replying](https://reddit.com/message/compose/?to=xkcd_transcriber&subject=ignore%20me&message=ignore%20me) ^| ^[Delete](https://reddit.com/message/compose/?to=xkcd_transcriber&subject=delete&message=delete%20t1_dmhtod6)", "Uh oh, I'm starting to become that guy. I've even caught myself googling \"Google\" to get off the main chrome tab, even though the address bar is a search bar...\n\nI may have a problem", "LPT: in google chrome, and possibly other browsers, typing fb and hitting ctrl+enter will take you to facebook", "> For example, I'm not the only one with a friend who gets to Facebook on the desktop by Googling \"facebook\" every time. \n\n[\"It is **right there**!\"](https://youtu.be/ANzNCpsXrK4) ", "Yeah a native video player is a hell of a lot better than a crappy mobile embed JS player or whatever a lot of sites use.", "They request permissions like any other app with the popup introduced in 6.0\n\n\nhttps://developer.android.com/topic/instant-apps/faqs.html", "Instant apps can't run on versions of Android without run time permissions", "Also appropriate: https://m.reddit.com", "Good bot.", "Good bot.", "Good bot.", "Bad bot. This is long af and adds nothing", "\n>I may have a problem \n\nThe first part to solving it is recognizing it.", "I used to not do that, but it's easier than making Chrome remember my browsing history. ", "ctrl+enter just adds .com at the end of what you wrote. it works for fb.com because it belongs to facebook and they redirect it", "I wonder if they use ExoPlayer. ", "Will that also work for 5.1? That's what I have.", "Yet. See one of the replies above you", "Bad bot", "Thank you shallnotbeinfringd for voting on xkcd\\_transcriber.  \n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://goodbot-badbot.herokuapp.com/).  \n\n ***  \n\n^^Even ^^if ^^I ^^don't ^^reply ^^to ^^your ^^comment, ^^I'm ^^still ^^listening ^^for ^^votes. ^^Check ^^the ^^webpage ^^to ^^see ^^if ^^your ^^vote ^^registered!", "Ya. It also adds www. to the front", "Also in that FAQ \n\n>Android Instant Apps are available on devices running Android 6.0 (API level 23) and higher, with additional support coming for Android 5.0 (API level 21). For example, you can develop instant apps on Google Pixel, Google Nexus, Samsung Galaxy S7, and other popular devices. ", "Good bot", "Thanks. The strange thing is that \"Google Play services for Instant Apps\" silently downloaded and installed itself on my 5.1 phone... a notification for \"Instant Apps\" only appeared for a moment, then vanished without trace... super spooky stealth install.\n\nI eventually found the new app im the \"download\" apps section - but with the longer name zbove.", "They may be getting ready to role it out then, Google can install whatever it wants remotely on any device with Google Play Services, it's creepy."]}, {"title": "YSK you may need to manually turn on instant apps for your account.", "comments": ["[deleted]", "Despite being announced a few years ago, there's a very few instant apps. Too few actually", "What's an example of an instant app?", "Thanks , it seems like updates turn it off. It was working for me before. ", "I'm not ultra familiar with instant apps, but the only way to even find them is googling an app on chrome, right?", "Thanks!", "Doesn't seem to work for me. I have the GPS for Instant Apps and I have it enabled in the Settings app", "thanks! never worked for me, and i stopped caring about it.", "You need to install instant apps first (I mean the \"service\" or whatever you want to call it). Here is the link: [Instant App APKMirror](https://www.apkmirror.com/apk/google-inc/google-play-services-for-instant-apps/google-play-services-for-instant-apps-2-5-release-177846646-release/)\n\nInstall this and then enable it in the settings", "Google announced it way too soon, then it took like three millenia for it to actually come out and never really advertised it. Most people don't even know Instant Apps are a thing", "Maybe because they're also pushing for progressive web apps. ", "Vimeo (I think it was Vimeo at least) has one. It works really well", "https://play.google.com/store/apps/collection/promotion_3002d0f_instantapps_featuredapps", "Hotpads has one too", "Instagram, Twitter, aliexpress, google+", "Same here, and then the option got hidden. Had to use an activity launcher to turn on again", "Not necessarily. You can click on a link in any app and it should open the instant app. For example, I clicked on a Vimeo link in Sync and it opened the instant app. ", "One of google's problems, million features hidden deep in setting, that nobody knows about, that then get abandoned, because nobodz used them.", "Yeah, I hated Vimeo on mobile before instant apps. I felt like their full mobile app sucked and I don't use Vimeo enough to justify having the app in my phone anyway, the web app was a little better but that has its own problems. But the instant app is the perfect combination of one-time use scenario and optimization. ", "Holy shit!  These are so well designed apps! ", "not able to see instant app.\nusing android 5.1.1. is it available for Lollipop?", "Twitter has an instant app? Or it just the progressive web app?", "Oh cool. I don't use chrome anymore and thought instant apps were pretty much irrelevant to me because of that. Now I need to find a vimeo link to try it out on...\n\nEdit: it worked! Only for links that weren't player.vimeo.com though. ", "I think Google got the idea of instant apps all wrong. There shouldn't be a setting to turn on, an option to use the instant app over the website, or an option to install the app.  Most users don't know what they are.\n\nUsers should just get the better app experience if it exists, no prompts, no need to know anything about them\n\n", "It should be for you, they specifically showed it running on KitKat when they first showed it off to prove that it runs on older phones", "Yeah its an instant app. I have it installed on my phone under the name Twitter Lite (~300kb).", "A lot of people don’t even know about clearing notifications let alone using the settings app", "thnx for.reply. my phone has play store version 8.4.19.v and i cant see any option of instant app under settings.", "That's a bit different, Twitter Lite is the progressive web app, not the instant app. Instant apps are only temporary downloads, apps like Twitter Lite are basically hardcore web apps that function as native apps. ", "Thanks for the explanation, i didnt knew it was a PWA."]}, {"title": "I just ran into my first instant app, and it's an awesome feature. What are some instant apps you guys have run into?", "comments": ["Just used that link. Holy crap, that's awesome! Can't wait for it to show up more!", "If you haven't heard about this yet, [here's an article explaining what it is and how it works](https://www.google.com/amp/s/techcrunch.com/2017/01/23/google-starts-testing-instant-apps-in-the-wild/amp/) ", "Do they only work in 7.1? \n\nUsing Firefox on LG G5 with 7.0 just directed me to play store.", "Didn't work on my 7.1.1 Pixel XL or my friend's 7.1.1 Nexus 5X :(", "Just tried for the first time with your link and it's amazing!!!", "You have to see if you have the process installed, plus you have to run KK and up", "It worked on my 5x running 7.1.1", "It's not working for me :(\n\nGalaxy S7 running 7.1.1. ", "Doesn't work with AdAway", "if i click that link, it opens the instant app on my phone. but if i search for the wish app in google search, the results only give me links to the install it from the play store. no instant app", "[deleted]", "Odd, I'm using a S6 with the latest updates and it doesn't work.", "Uh, it took me to a wish.com link for buying an outdoor grappling hook. Seriously. What's going on?", "[deleted]", "I got the update and it's enabled in the settings.\n\nWhen i click ops link, it just opens a mobile store website.\n\nIs that what's supposed to happen?", "I believe it's intended for use with the Chrome browser.", "Chrome browser, and they're still only pushing the capability to a limited number of devices. The end-goal is to make it a feature for everyone. I'm not sure which devices/OS builds are on that list. I'm using 7.1.1 on a Pixel XL. ", "They showed them off running on KitKat last I/O so no.", "If you go to your device settings and click Google. You might have the instant apps option there just not enabled. It was like that on my Pixel XL ", "That's bs to be honest, I got a long explanation about instant apps and a I'm in or dont allow button. It won't randomly open apps if you have never used it before. And asking every single time before opening via instant apps defeats the purpose", "If it follows the Android 6 model, what permissions would you even restrict before running the app? The whole point is that it has no important permissions before asking you.", "Your comment contradicts itself. The Android 6 permission model is when dangerous-level permissions are _not_ auto-granted on install. ", "It's kinda all or nothing as far as this goes. I can go into settings>google>instant apps and disable the feature completely, but as of now you can't disable apps or certain permissions individually. I've only run into one so far, so I'm not sure if an app required a camera permission for example, whether or not it would ask for said permission to be allowed. ", "It hasn't rolled out for everyone yet.", "I had to enable it in the settings", "Same, though I'm on my surface using Readit.", "Use your phone to do a Google search for wish - instant. It's wish.com's instant app. Idk what version of Android you have to be on though for it to work.", "That's the page it's supposed to take you to, just in an instant app. ", "That is Google's app steaming, where the app runs on their server and is streamed to your device to allow you to demo an app. It's been there for a while, long before instant apps.\n\nedit: wow really, tim? \"app steaming\"?", "I just got my XL about a week ago, and read a few things about instant apps about the same time. Very exiting for me, just curious to see what else is out there at the moment. I didn't know developers have been working on this for so long. Very cool.", "That's all I get too", "Try Googling for Wish and then click the result that says Instant.", "Nope. It's part of Play Services. It's not part of Chrome. You're thinking of web apps or something like that.", "At IO last year they showed it on a Kit Kat device. It's also through Google Play Services and not Chrome.", "Still not working ", "[deleted]", ">but as of now you can't disable apps or certain permissions individually\n\nThat's a dealbreaker for me. I'd rather do without instant apps entirely than forego the ability to control them. This all sounds like a privacy disaster waiting to happen.", "Where in settings can it be found?", "It still needs support from the browser. If you visit the site in a browser other than Chrome it either needs to hand you over to Play Services willingly, or Services needs to hijack it (which is not nice).", "Guys, the instant app is handled by Services, true. But until it gets to Services it will need to be handled by the browser. If the browser doesn't want to support this it won't work. So it's only Chrome for sure.", "You might want to study the Android 6 model of permissions more deeply, as your misunderstanding of that is what led to your contradicting comment in the first place.  \n\n>they will follow the Android 6 model, but doesn't say whether users will be given a chance to restrict permissions before the instant app runs for the first time\n\nIf you knew the first thing about the Android 6+ way of doing permissions, and if you re-read my comment, **dangerous-level permissions are not auto-granted on install.** Users don't need to be given a chance to restrict permissions before the app runs the first time, any dangerous-level permissions will not be auto-granted. \n\nNow, I'm not exactly sure how this will work on devices pre-6.0 and if the Instant Apps framework will replicate the 6.0+ permission model or not, and if that's what your comment is about then you need to clarify. Otherwise, [read up on how the Android 6 permissions model works](https://developer.android.com/training/permissions/requesting.html), and if you have any more questions, feel free to ask.", "[LMGTFY](http://lmgtfy.com/?q=instant+apps+how+to+enable)", "I just tried from a N6P with this feature enabled. FireFox just routed me to the Play Store.", "It doesn't work for me on chrome. Any idea why?", "[deleted]", "That's cute. I did just that and my Google pixel lacks that submenu. ", "[Dangerous level according to the OS/Android APIs](https://developer.android.com/guide/topics/permissions/requesting.html#normal-dangerous). Come on, that's a link from my earlier link under \"You should also read...\", it's like you're not even trying to inform yourself of how permissions work on Android 6.0+.\n\nAlso since it's clear you're not a dev (or at least one who's never attempted to use the 6.0+ permissions system), and since you're not reading the links I'm sending you, I guess you'll only learn from my comments themselves. \n\nPre-Android 6.0, permissions were granted automatically at install time, no matter what. The app wants your location? Granted. Contacts? Granted. There was basically no way around it, if an app wanted your lifestory and pictures of it, they had access to it once you installed the app.\n\nAndroid 6.0 changed all that. If devs built their app against 6.0, all of a sudden dangerous permissions (I'll get to what's \"dangerous\" in a minute) were no longer auto-granted at install time, they had to be approved as you use the app and the app had to explicitly ask the user for this approval. No longer could an app just have instant access to your contacts/location/phone records/etc. unless it asked you for them. This is how the 6.0 permissions model works.  \n\nThere are two types of permissions: normal and dangerous. Dangerous permissions are the following (and can be changed at any time in future versions of Android):  \n\n* Viewing/editing your personal calendar\n* Access to your camera\n* Viewing/editing your contact list and getting a list of your linked email accounts\n* Access to your location\n* Access to your microphone\n* Just about anything regarding voice calls (call logs, making phone calls, processing outgoing calls, voicemail, etc.)\n* Access to body sensors (i.e. heart rate sensor)\n* Anything to do with SMS (sending/receiving texts, reading texts, etc.)\n* Reading/writing to external storage  \n\nIf an app wanted any of the above, it had to ask you (using an unalterable system prompt, to avoid deception or fake \"popups\") and you can either grant or deny the permission. Anything _not_ listed above are what are considered \"normal\" permissions, things like access to the internet, Bluetooth, NFC, setting an alarm, usage of the fingerprint sensor, vibration, etc. These permissions are still auto-granted at install time and cannot be revoked later by you the user.\n\nIt seems that your thoughts on this permissions model are based on I guess news stories and \"Android marketing\" rather than actually knowing how it works on a technical level, and I hope this comment gives you a better understanding of how the 6.0+ permissions model works.  ", "[deleted]", "It seems like /u/ocelost is critiquing the Android permissions system and staying that the creators of the system, Google, are the same people you are trying to protect yourself from with the system, which creates compromises, leading to Google potentially missing or abusing the system, or tailoring it around their agenda instead of the user's (which is claimed to be is main purpose). Furthermore, the permission system can easily be bypassed by even a mildly skilled developer.\n\nWhile it seems like /u/QuestionsEverything is coming from a purely technical stance, staying exactly what the permissions system does. The term \"dangerous\" is being used completely technical, not subjective. He's staying that Google deems permissions that require user interaction to be granted are named \"dangerous\". He is explaining exactly how the permission system works technically, not giving his opinion on it.\n\nBoth of you are arguing on different things. One is arguing about ethics and the realistic security the permissions system brings (which is largely opinionative) whereas the other is coming from a purely technical and factual, exposing exactly how the permissions system works and how a developer utilizes it.\n\nCan't we just be friends? :)"]}, {"title": "Google secretly released Instant apps for testing > Info inside", "comments": ["Wish worked for me. Make sure you have \"instant apps\" turned on in Settings -> Google -> Instant apps. It's off by default I think.\n\nEvery time I try this it just seems super weird as a search result. It's really cool technology, but it belongs as a \"Test Drive this app\" button in the Play Store. ", "Not seeing instant apps anywhere http://i.imgur.com/glnd7l0.jpg", "For me no search retruns \"Instant\". ", "Is the feature Pixel or 7.1.1+ only, don't see it in the settings on my OP3, stock nougat", "This is pretty cool. Same as you, only wish and Viki work. Once this gets popular we can finally stop dealing with the sites that have a huge download app banner", "I don't have the instant apps option to turn on in my 5x. Any advice?", "Wish worked well and Viki did as well after some digging. Periscope and BuzzFeed are still a no. (Pixel XL)", "Thanks! Working for me running 7.1.2 beta on my Nexus 5x", "Hold on.... I posted about this last week (my 6p installed the instant app) and was asking if anyone else had it and what apps/sites actually worked.\n\n\nIt was removed by the mods for not being relevant.... What a difference a week makes.\n\n", "[deleted]", "I knew I had seen it install, didn't know I had to turn it on. Thanks!", "Not available in my Android One 7.1.1 with February patch", "Not on Axon 7 API 24. ", "Anyone find any other sites / apps?", "Are instant apps not allowed on G Suite (Google Apps for Work) accounts? I see it enabled for my two personal accounts in the dropdown, but my work email isn't even there...", "I don't see the option in mine. Is this not available for everyone yet?", "Would be great. Amazon used to have this where you can test the app on an emulator in their site. It would be great to bring it back. I guess 24 hour refunds is enough. ", "[deleted]", "How did you take a scrolling screenshot?", "I have it on my XL running Pure Nexus. Randomly saw \"installing instant apps\" in a notification the other day for like 2 seconds. ", "I dont have it on my pixel XL...", "Unsure, you download it through the \"Google\" app, maybe check for updates.", "Not on my OP3 OOS Nougat either. Hope a 7.1.1 beta drops soon. ", "^^^imgur", "Hmm... I have it on my 5x, but I manually downloaded the Google alpha update that enabled assistant for some users, so maybe that's one of the reasons... I have only got it to work with Viki and wish, and only through the Google app, not chrome/chrome canary", "Hey, I can’t seem to find the option that you have to toggle in chrome to make it work. Do you by any chance remember? ", "Instant Apps is done through the Google Search app and Play Services, not Chrome", "These are the only ones available according to google", "Google Play will refund you if you uninstall a paid app within the first 30 minutes.", "Default on samsung. Screens hot and hit capture more until you get to the bottom of the page.", "For non Samsung devices, there's [Stitch & Share](https://play.google.com/store/apps/details?id=com.glitch.stitchandshare&hl=en)\n\nworks great on my Pixel", "[deleted]", "Ah ok. Good to know! I'm looking forward to seeing how well this does. The load up times were impressive.", "Wow, that's a really awesome, simple, and under-hyped feature. ", "It should work for you in the Google search app because that just uses the chrome browser..."]}, {"title": "Try out instant apps ^^", "comments": ["Weird. Pixel XL, instant apps enabled, I've used instant apps in the past... No try button. Must be a server-side thing. ", "I've been pleasantly surprised by instant app's. My gf and I occasionally send each other houses to look at on realtor.com and she sent me a link a week or two ago and it opened up the realtor instant app. Much easier to navigate and see pictures than the mobile website. ", "doesnt work on my nexus 5x with instant apps enabled :(", "It's installing the app for me? Should it do that? ", "VZW Note 8 here - Instant Apps were disabled in in my Google settings for some reason, maybe I turned them off, idk.  \n\nTurned it back on, still do not have the option to 'TRY NOW' so I'm assuming it can take some time on the server side of things for it to recongnize you want/can use Instant Apps, just fyi. ", "Pixel XL here, no try now button. Probably because I'm in Canada", "Instant apps have been out for like a year now, and I feel like we're still waiting for them to be a thing.", "Open in play store and press try, currently works for a limited number of apps :(", "[Nice](https://i.imgur.com/OWD8dke.jpg)", "Odd, I can from Google search but not from there.", "This isn't live yet for me...", "Hollar is the BEST example of instant apps. ", "There are a shocking 7 apps available, none of which interst me. Instant apps is a fail.", "I don't have it on my pixel either, and cant get known instant apps, like Jet.com (which worked in the past) by going through chrome, to work again.", "but is that because the app is good or because the site is bad? a lot of sites neglect one to promote the other", "Same here. Nexus 6p.", "[removed]", "Did you enable Instant Apps in Settings?\n\nSettings -> Google -> Instant Apps", "That's the point of instant apps.\n\nThose are apps with limited access to everything in your phone, which basically get triggered when surfing the web.\n\nSmall parts of the app get downloaded on demand.\n\nThey are not visible on the app drawer.", "The instant apps toggle is off by default", "What's your Play Store version? ", "Have it on the g6 lol", "The site isnt bad, no worse than any other to be honest. The app itself just organizes the info much cleaner. ", "[deleted]", "Yes, should it still install the app? ", "Can't seem to find it. Could you share a screenshot?", "No, I mean it was installing it. Like a normal app. ", "Good to know, thanks!", "8.3.41.U-all", "What does it do that a website can't?", "Look at the “Try Now” button :p", "It shouldn't. I don't have the option yet either, must be server side.", "Hmm. Same here. Must be a server side change. ", "What does the Amazon app do that the website can't ? Apps in general are easier and faster to navigate then the mobile site equivalent", "Amazon app is just a Web view wrapper around html", "I get that plenty of apps are better than their equivalent websites, but what can the apps actually do that websites can't now? \n\nI mean, you can make a pretty decent PWA nowadays."]}, {"title": "Is Instant Apps working for anyone else?", "comments": ["Have a link?  Also, don't buy a house together until you're married.", "Does pinning a website to homescreen and it opening like an app part of \"Instant apps\"?", "Same thing when my girlfriend sends me Zillow links. I wonder why real estate is trying it first (you know, based on our two data points at least).", "The Weather Channel", "My device downloaded something for that. And I enabled it in settings. But so far, I haven't figured out how to use it... ", "Vimeo works for me. Opened a link from inside the Sync app and I had to accept terms.", "It seems if you are on Nougat and doesn't have Allo installed and some one sends you a message in Allo, you will receive with a Pop up just like an app where you can reply. ", "Nope", "Try flipkart.com the site opens up as a instant app", "Github is working for me. it has a instant app.", "CBC just started working for me!\nHttp://i.imgur.com/8mLC4vE.png", "This works for me for Twitter  and google+ but not realtor.com\n\nOdd", "I saw it installing something called Instant Apps really quick last night. And when I just tested the Weather Channel website it offered to put it on the home screen. What's the point? I could always save a bookmark to the homepage?", "Instant apps are / were a flop. Nothing to see here. ", "Nonsense. I've done just that, with a Declaration of Trust that either of us can force a sale to get half.", "Un related but why not?  What if you buy it for yourself", "That's a bit closed-minded, don't you think?", "That's Progressive Web App.", "that's sort of the opposite direction, it's a \"progressive web app\" which is about making webpages behave more like a native app.  Instant apps is about making native apps work more like webpages.", "This worked! I saved the link as a chrome page to my homescreen and it opened the Realtor.com app the same way it did when clicking the link. ", ">I wonder why real estate is trying it first\n\nThey recognize that most people are only going to involve themselves with real estate a handful of times over the course of their lives and likely don't want to install an app for it.", "That's old. It's the part of Google play services, you can disable it in google settings->app preview messages. ", "Not the same thing as instant apps. I believe that's called app preview message.", "This has been my experience too. However, this is different 😄 I've been getting Instant Apps updating through my play store for the last week or so, but never saw it in action until recently. It leaves a little lightning bolt notification at the top of the screen when in use. And it's FAST. ", "They were just kept in beta. Never released. ", "> either of us can force a sale to get half.\n\nYa I'd prefer to have a house I know I can afford and will continue to have even through a break up. If she wants to make payments and live together cool", "As a lawyer, I like you. You're going to put some attorney's kids through private school with your optimistic financial choices. ", "lol for sure. I'm going to buy a house that I can afford on my own income. If my girlfriend wants to be my roommate and pay my mortgage with me, awesome, if she doesn't I'm still going to own my own house.", "Then buy it for yourself with absolutely no money from your significant other and their name should not be on any paperwork or bills.  ", "[deleted]", "Yeah, I mean the thread is a simple question about Instant Apps. OP definitely didn't ask for dating, marriage or homeownership advice from /r/Android.", "That's a good point. I guess I didn't really wonder much beyond literally typing the words \"I wonder why real estate is trying it first\".\n\nAlong those lines then, I might expect airline and other travel companies to try it soon too. Scrolling through my apps, I have Southwest's app on my phone but I don't think I use it often enough to really need it all the time. This could be big for the \"I want to minimize the amount of apps on my phone\" crowd.\n\nEDIT: Also I know some cities have their own apps, whether for transport or tourism in general. This would be great for that.", "That's kind of my point. Never released == over-promised & under-delivered. ", "Few people can afford a family home themselves. I wouldn't want my 4 bed house by myself.\n\nAlso not sure how marriage changes the sums.", "Didn't cost much as part of the normal purchase paperwork", "Don't put them on the title either.", "Another commenter mentioned involving them in mortgage payments...how come you're suggesting it is a bad idea?", "No it's not, just be sure that you are legally protected at a contractual level ironed out with a notary.\n\nI've bought two house with different people and never had trouble when it was time to go our separate ways. I'm under 30 btw.\n\nJust do your homework and you'll be fine.", "Nope but this has all been pretty cool!", "That makes no fucking sense", "Legally and monetarily being bound together. Also the commitment in a marriage tends to be higher.\n\nBut everyone can do it how they want. It's up to the individual", "[deleted]", "We don't do homework here. Too busy talking about bezels. ", "My Declaration of Trust has me just as legally and monetarily bound over the house just as much as marriage.\n\nIn fact, it's better. A joint mortgage says you're both jointly and severally liable for the payments. In other words if one stops paying, the other is responsible for all of it and there's nothing you can do. My declaration builds on that by saying we are jointly responsible. So neither of us can stop paying, without getting sued for it.", "She wouldn't be on the mortgage, she'd be paying me rent to live with me"]}, {"title": "I got Instant Apps today! Where can I try it out?", "comments": ["Idk about any sites using it, but make sure you have instant apps turned on in the settings.  It defaults to off for whatever reason. ", "Relevant http://www.apkmirror.com/apk/google-inc/google-play-services-for-instant-apps/. ", "I also had this happen to me earlier today as I happened to be using my phone. Thx for the heads up on enabling it. Not really sure where to test it. B & H gave me a little Google Play banner on the bottom with a green button called View that took me to download it on the play store", "I don't have the toggle of instant apps option in nougat (7.1.2 on regular pixel).  Is it just enabled because it is baked into the OS?", "Post a pic ", "Not 100% sure if this is an instant app, but when you do a search for an app on the play store from the Google app and tap one of the app results it shows a modal. ", "You can find a whole bunch of ~~Persistent~~ Progressive Web Applications at https://pwa.rocks - Are these what you mean?", "Where is this setting?", "If it defaults to off, I would not be surprised if Google dropped support for it due to \"low usage\".", "Can you just download the apk to get instant apps on any phone with Nougat?", "You have to have this installed - http://www.apkmirror.com/apk/google-inc/google-play-services-for-instant-apps/\n\nHead down to Settings > Google and make sure the instant apps settings is toggled on. ", "I cannot find the toggle either on 7.1.2", "http://imgur.com/a/cRAUq", "[Android Instant Apps](https://developer.android.com/topic/instant-apps/index.html).", "*Progressive Web Applications", "Settings, Google, instant apps", "I think its in chrome beta's flags. \n\nfind a2h or something", "Installed on my Marshmallow phone. Though I think it'll need a newer version of Play Services too since the option didn't appear in Google Settings.", "Strange, installed both the newest play services and the apk for instant apps, but no setting is popping up \nEdit: lol after a day waiting it's there", "Thanks for that, wasn't aware of the difference! :)", "[deleted]", "Oops, yup, you're right!", "Thanks. Enabled it, says it on, but still [doesn't work](http://imgur.com/a/cRAUq) on the b&h photo website as they demoed at Google IO 2016", "Is this USA only? I don't even have a menu item for instant apps. ", "Don't have that and I'm on the latest build for Nexus 5X.", "No, it's in the Google section of your device settings. ", "That's Progressive Web Apps.", "It's a server side rollout. Likely there is no way to enable it before Google rolls it out to you. ", "[**Hermit • Lite Apps Browser**](https://play.google.com/store/apps/details?id=com.chimbori.hermitcrab) - Free  with IAP - Rating: 90/100 - Search for 'hermit' on the [**Play Store**](https://play.google.com/store/search?q=hermit)\n\n\n\n------\n\n[^Source ^Code](https://github.com/crisbal/PlayStoreLinks_Bot) ^| [^Feedback/Bug ^report](http://www.reddit.com/r/cris9696)", "You need to have the actual app for this afaik", "You had to have gotten the install that OP was talking about first.  It's being slowly rolled out.  ", "You had to have gotten the download for instant apps that OP was talking about.  It is being rolled out slowly. ", "Makes since they might have to pack it in some way and send it to the devices when requested.", "No you dont. It downloads part of the app from the play store on demand", "No, it's just AB testing.", "What would be the point of instant apps if you'd have to have the full app installed anyway, right?"]}, {"title": "Introducing Android Instant Apps SDK 1.1", "comments": ["It's great they're backporting persistent installation data, as I was basically planning to only target oreo+ for instant apps because of it.\n\nI would love to know who is packaging .so libs with their 4mb instant apps. Anything other than 100kb audio streaming library seems crazy.", "I'm not sure that I understand the use case for instant apps", "But how is the user supposed to upgrade from the Instant version of the app to the full one? Does the Instant app good for a free-trial?", "Is it safe at all? I would not like to have something which ends up as \"instant virus\"...", "I assume Realm with ABI Splits.", "It's basically deep-linking into an app the user hasn't installed previously, and loading in a \"mini\", or \"instant\" version of that app. That's if I'm understanding correctly.", "It's so that Vimeo takes even longer to load. \"Instant\" my arse.", "Android apps are heavily sandboxed + the permission system + checks by the play store.\n\nYou're pretty safe.", "It's funny how this gets downvoted every time someone mentions it, but I mean he kinda has a point.", "Yeah, I understand what it is.\n\nJust don't see what it's useful for? I guess it's be a good way to preview an appropriate something but I just don't see the need.", "They also have (and push for) PWAs which seem to offer similar features: lightweight + readily accessible.", "[deleted]", "No need to write that comment three times...", "Basically for providing a more native experience than a web interface, and raising visibility of your app amongst others.", "A really good example they showed when they were first showcasing instant apps is stuff like a parking meter. You tap your phone and it loads the instant app and you can pay there easily.", "Marketing is the primary reason. You browse FB and see some app ad with a button \"Launch instantly\" that takes 5 sec to try the app and another one with \"Install on Play Store\" that takes 50 sec. It's more likely to click on the 1st one, right?", "To give you another example: You don't have to show a full Activity, you could just show a dialog for purchasing something etc.", "some already, but i can tell from experience that quite some existing projects have to be decoupled (made into smaller chunks) which is often not an easy task. We are already working on it for 4 months full time with 2 devs. still not completed. \nAlso Android studio 3 is now becoming a bit stable, but before that it was, and maybe still is a mayor pain to work with.", "It's called reddits app being garbage", "[deleted]", "Ahh, something like that seems very useful", "[deleted]", "I'd personally would probably do neither, but I see your point. \n\nSo now I'll scroll through my Facebook and wind up with odd apps launching instead of ads getting clicked by accident...", "> It's like the difference between the Amazon app and the Amazon mobile website.\n\nVery poor example. The Amazon app is pretty much a web wrapper and is as good as the site. Only difference being I don't have to constantly re-login and I can get notifications.", "NFC that links to a website I'm assuming"]}, {"title": "Instant apps are live for some pixel users.", "comments": ["6p 7.1.1 I've had it for a few days. ", "Yelp really needs this. You can't even look at reviews or pictures on your phone without installing the app. ", "What websites use this? I want to test it out l", "I wish Google would send us notifications for when these behind the scene changes happen. If I didn't check this sub, I would have never realized I have it.", "I don't have that setting but interestingly I *do* have a \"Google Play services for Instant Apps\" app installed", "Awesome, I got it. ", "yeah its pretty nice just saw i got it turned it on. Wish instant app wow that is quick!\n\ngot any others which got instant out yet?", "Had this for a little less than a week on my 7.1.1 6P", "~~I turned the setting on. How do I know if I'm using one? Wish.com just looks like a normal mobile page in Chrome.~~\n\nOnly works if you click the Google result. Doesn't work if you type in wish.com in the address bar.", "Active on my Nexus 5X :) I'm on 7.1.2 beta, maybe that's why?", "That moment when you look if you got that too you see instant- but it's tethering. ", "I got it too.", "Pixel XL 7.1.2 and I'm live with it.", "Pixel XL 7.1.1, working here.", "That's Racist :D", "Anyone has this on a non Google phone? 7.1.1 here, nothing (Moto G³ on LineageOS)", "same on my 5x", "Neat I have it. Disabled by default for anyone else curious.", "Pfft. 7.1.1 plebeian.", "When instant apps was first announced I was able to use it. I did a google search for fruit ninja and was able to play without downloading anything. Wish I took a SS at the time, did not know they would disable the feature for awhile.", "Fuck Yelp", "Agreed", "Wish does", "I know they were showing off B&H Photo in their demo. Maybe that will come soon", "same on my pixel", "That wasn't instant apps, that was app streaming which just ran the app on Google servers and streamed it to your device. It sucks that they removed it though "]}, {"title": "Android Instant Apps, step-by-step: how Vimeo went about it", "comments": ["I think you linked the wrong post in the first section, third paragraph. The hyperlinked \"this great post\" takes me to a video about combatting anti-trans violence.", "Need floating/minimisable video like youtube app on VImeo.", "Vimeo's instant app hasn't once worked for me\n\nSo\n\nThere's that", "Wow that's definitely the wrong link...fixing now. Thanks for the heads up!\n\n[EDIT] Change it to be the right one. And in case anyone was curious about the anti-trans violence post: https://vimeo.com/blog/post/how-one-non-profit-uses-video-to-combat-anti-trans", "That's definitely been in our backlog for a while. We might get somewhere close to that with Picture in Picture on Android O for free 🤞 But it's on our roadmap.", "What device do you have, what country are you in, and have other instant apps worked for you (like BuzzFeed)?\n\nWe recently rolled out to 100% so anyone who is eligible should get it.", "> We might get somewhere close that with Picture in Picture on Android O\n\nYou don't sound too confident that a built-in PiP api will be able to get that achieved.", "Pixel XL, US, haven't tried any other instant apps. That I can recall.  \n\nE: just tried to reproduce for more information. I get a \"Something strange occurred, please try again\" error, tried again and got a non responsive indefinite loading screen.  Android 7.1.2", "I used the PiP API on our Android TV app and if it's anything like that (which it looks like it is), then it may be rather limited. I don't think it'd be as smooth as if we were to roll our own in-app floating/mini player.\n\nBut I haven't look at this specific implementation just quite yet so I'm hopeful.", "Okay very interesting. And this is in the instant all? (Aka you don't have the app installed).\n\nIf this is happening to multiple people we'll definitely want to get this fixed. Also thanks for the details!", "What wasn't so smooth about it?", "Yes this is the instant app.", "You had to declare that your activity could be backgrounded and then activating PiP mode just meant you needed to hide your control UI while it showed in the floating box. When in PiP mode, you couldn't declare where you wanted it located or how the user could interact with it, which was somewhat limiting. Session handling got weird in that apps could take PiP focus from you but then you could reclaim it if your app was opened back up. But I found this had some weird effects on how they were retaining the Activity as it related to our backstack.\n\nI think it was the lack of control paired with unpredictable behavior that made me not like the Android TV PiP API. That being said, it's still a rad feature. But for something like mobile I think control is important since there are many more variables than TV.", "Okay trying to debug now - I can't reproduce the error on any of our devices. How's your network? And can you provide me with the link that isn't working?", ">When in PiP mode, you couldn't declare where you wanted it located \n\nWhy would that matter? PiP windows can be dragged all across the screen wherever the user wants. If anything, I'd prefer not for the app to force where to put it.\n\n> or how the user could interact with it\n\nInteract how? You mean besides play/pause/rewind/FF or closing the PiP window or blowing it back up? What other kind of interactions would you want the user to do on a window of that size while not in the app?  \n\nI'm basing my PiP experiences btw off of how YouTube does it in the O beta, and it works as I would expect a PiP window to work.", "Like I said no link I've tried has ever worked, but just to be sure I grabbed the first reddit link I could find to test. \n\nhttp://vimeo.com/71919803\n\nI can verify that this link does not work for me. \n\nI'm on verizon's 4g lte and don't have any other network issues. I'm also using reddit is fun if that matters.  \n\nE: problem persists on my home network which is optimum internet in Brooklyn ", "When you saw the something strange occurred error, was the text inside the player or did it pop up in a toast? Thanks in advanced for the information :) Since I can't reproduce the bug hopefully I can get a clue from what you were seeing to try and fix it.\n\nAnd did any of the lists below load (like the up next list or the likes list)? Or was the entire page blank?", "[Would it be easier if I just give you a video screencap?](https://youtu.be/7JZhAy245vI)\n\nSo I click the link, the instant app shows up and I get the error in a pop-up. I click \"try again\" and it goes back to the loading page and stays there forever. Nothing else loads.\n\nHope that helps.", "Wow this is extremely helpful - I think I know what the issue is (or at least where it's happening). We'll hopefully have a fix soon.\n\nThanks again :)"]}, {"title": "Just tapped on a Vimeo link, and this came up (Instant Apps)", "comments": ["> [How Android Instant Apps work](https://support.google.com/googleplay/answer/7240211?hl=en)\n\n> When you tap a link, Google Play checks if there’s an app that could open the link. It will open the link in the instant app (if available) if you don’t already have the app installed on your device. \n**An instant app only loads the portions of the app needed to perform the current action. The portions of the app and any data they store are temporarily added to the device.** To remove that data, see “clear the data for a specific instant app,” below. \nNote: You can turn off Android Instant Apps at any time. Follow the instructions under “Turn Instant Apps on or off,” above. \n\nCool. \n\nHopefully something like this can take off for apps that have core functions that can be utilized in this manner. I'm sure could be clunky today, but a few years from now, it could be a great way to access things on the fly.", "[Saw it for Periscope the other day as well. ](http://i.imgur.com/9k2cRb5.png)", "I've seen this on Stack Overflow.", "Yay, time to uninstall Vimeo!", "This what I was hoping. \n\nInstant apps are great for ones that I have accounts with bit rarely if ever use on its own. \n\nExamples would be YouTube, Vimeo, Ticketmaster etc", "Instant Apps is garbage.\n\nAccording to XDA it ignores metered settings and cannot be disabled (you can disable it but the OS ignores that): \nhttps://forum.xda-developers.com/pixel-xl/help/q-how-disable-instant-apps-android-t3591566\n", "thats smart.   It encourages apps to be small and efficient, and enables a better view of the site that the terrible mobile version, without any hassle.  ", "I have Instant Apps but it doesn't work for me.", "[deleted]", "*cough*Facebook*cough*", "You have to turn something on in settings, I forget what it is exactly", "somebody's worried about their job", "President Trump? Are you there?", "Chill", "What.", "Instant Apps I think", "I did this, still no instant apps.", "[deleted]", "the point of instant apps is you don't have to download another bloated app just for a particular feature and amp optimizes websites for mobile because data caps and slow internet. both make the web accessible to the lowest common denominator because that's what the majority of android is, [crappy $200 phones](http://fortune.com/2016/02/15/apple-android-asps/). microsoft doesn't have a mobile and web presence like google and apple targets the high end, so they don't have to bother with these kind of stuff.\n\nAlso regarding apps, [nobody is downloading any](https://qz.com/253618/most-smartphone-users-download-zero-apps-per-month/) and companies are moving to web apps because like you said it's cheaper. the mobile app boom is over. move on."]}, {"title": "An introduction to Android Instant Apps", "comments": ["Does anyone actually use instant app in production? ", "I am trying to use instant apps from Germany on a Nexus 5X with Android O installed, and none of the 4 apps I have tried (that supposedly support the new feature), have launched the instant app.. does somebody know the list of these 40 countries for which this is supported?\nthnx in advance", "Give it time I guess - It is released to public only during this year's I/O. I have seen Stackoverflow, BuzzFeed using it during the incubation.\nIt seems it is supported only in Android 6+ though.", "Jet.com has an Instant App in production. https://medium.com/p/33855ab5d02b/edit", "Working on it.\nHaving a hardtime making my instant app less than 4mb and keep somehow the same codebase for the standard app and the instant app.", "CBC does now", "The ability to the deploy them was​ publicly released a week ago. Patience.", "Quite a few companies got early access to the SDK and deployment infrastructure. Google mentioned that there were 50 instant apps out in the wild as of the keynote announcement. Reference: http://www.androidpolice.com/2017/05/18/instant-apps-announced-google-io/", "We're using AIA for our player at Vimeo in production. It's actually helped clean up our code a lot. ", "Try and find Instant Apps switch in your settings, it might be turned off.", "From what I know Google originally said it would be supported down to KitKat but it's only 6 currently. To chime in, we're a small team and we are implementing an instant app into our app currently.", "When I was building Instant Apps, we faced the same issue. It was a big challenge to slim down the app to 4 Mb. I wrote an article about it https://medium.com/@YuliyaKaleda/make-your-app-instant-33855ab5d02b. Would be happy to help with advise and guidance.", "interesting read. i ll have to deal with the same challenges.\nMost of my apps are fragment only single activity apps. That makes it a little harder to make it modular. But still possible i would say.", "yes, you would need to create at least one activity with a unique URL as your entry point per feature/module. I am curious why you follow the pattern many fragments and one root activity in your apps? ", "I wouldnt say that multiple activities are not good. But the reason why i am using the fragment/view only pattern is because of the lower memory footprint, faster view switching, fewer issues with passing data between views and overal a bit more control over your backstack. But there are also disadvantages. You quickly get a monolith of an application, fragment backstack was till recently not working well for years and other quirks.\nYou don't really need multiple activities with\nInstant app i just figured out. Since you can have multiple url endpoints in your manifest you can also handle them seperately. If i understand correctly its the same as implementing deeplinks for app indexing right? (I have done that already) ", "yes, that is correct. you can have multiple url endpoints, which in your case will route to the same activity (similar to deeplinks). You dont need multiple activities if you plan to build a Single Feature Instant App (most of your code would live in the Base Feature Module and u wont have feature modules). Just be aware that not breaking the app into separate feature modules may put you in a weird position in the future when your Base Feature Module gets to its limit of 4MB and you cannot add extra features to your Instant App. Having feature modules (each should have at least one activity with a unique URL as an entry point into the app feature) makes your app more scalable. "]}, {"title": "Instant apps?", "comments": ["Same here never heard of them after Android N launch. ", "[deleted]", "There's not much out there.\n\nSome reports that 'wish' (google it) has an instant app. I tried and did not get anywhere. It was also not really something I cared enough about to delve further.", "where do you turn it on at?", "Hmm I see that I have this option available also. Are you by chance in the Play Services beta?", "What works for me is the fact I uninstalled Allo and now if someone messages me on Allo I get an instant app notification on my Nexus 6P all started this week.", "My only experience was with Periscope. It was pretty cool!", "Found it. Already had it turned on. Doesn't do anything though", "There is actually a Google Play instant app, but other than that, haven't found much.\nIf you google an app, there are app results among all other search results, hit an app and it pops up a play store kind of screen, but with less options.", "They are in *very* limited rollout. Only certain partners selected have access to develop them right now.", "Where is this setting?", "Wish works for me, it opens up as if it was an actual app installed on my phone ", "It worked for me", "Yeah I don't get it in search results either. I was kinda curious, but I'll guess we get to see it sometime in the future.", "Under Google in the settings menu ", "Nope, no beta ", "That's notinstant apps", "Yes I have noticed that too. But that's not the actual instant app.", "Try using the Google search app. It doesn't work in the Chrome browser IIRC.", "For those who want in on the beta\n\nhttps://play.google.com/store/apps/details?id=com.google.android.gms", "Okay. After you said this I went ahead and did some further research and I am here to hang my head in shame. It's messaging preview feature of android and not instant apps. Please accept my apology. \n\nI was going to delete my comment but then perhaps another lost confused android user's soul may come to this thread. \n\nThey are not the same thing. OP is right.", "I am sure it is. Because it asks me to also install it.", "Oh and I can also reply without even installing the app ", "It actually works with chrome. Just tested that by searching wish on chrome and opening instant app version from search link.", "Sorry for the short comment before. I didn't have many time to reply. But it's indeed a messaging preview as you just said.  Really no need to apologise!", "Yeah I saw it was quite a quickly typed answer. I feel like today I learned something new from my mistake. Those messaging preview things are actually really good as it feels like I have the whole app installed lol fooled me for sure.", "Yeah they are quite handy. But instant apps really is a game changer when they make it available for more apps. Would be great for all of those apps you just use once in a while ", "After all this research and properly understanding how they work I agree with you. I think it would come in handy quite often! "]}, {"title": "How to use Android Instant Apps", "comments": ["Just realized that now with instant apps I will have to deal with XDA's horrendous app eventually that has no navigation. Yeah I know I will eventually just look for the link that doesn't open the instant app, but that will be more work than tapping the first one which is what I'm used to.\n\nI swear websites that allegedly focus on mobile have the worst websites.", "Instant apps crashes after the splash screen for me, but at least the option is there in the search results :-\\", "*rant*\nMayne, don't hype me up for this just to be all like, \"only select phones get this feature\" really don't appreciate how people bait my clicks with: \"IT'S HERE IT'S HERE YOU DONT HAVE TO WAIT\" but my little known Chinese manufactured Android phone won't get it until at least a year later\n*Rant over*\n\n(Honor 8 update was supposed to drop a couple days ago in my region (USA) so that's why I'm ranting)", "It's still opt-in? Cool. Not sure this is a good thing.", "I'm with you. I don't want to use Instant Apps. I want the mobile website. ", "What's wrong ~~boobs it~~ with xdas app? It's got decent gesture navigation and the back button does what it should\n\n\nEdit: damn that correction ", "When you search for a site with instant app support, you'll have a link to the site and a link labelled \"Instant\". I wouldn't worry about it. ", "[deleted]", "Isn't that why there's an option for it? It's not like it's automatically enabled. ", "> What's wrong boobs it xdas app  \n\nholy autocorrect batman!", "For one thing in the app you cannot access your different devices' forums easily like you can on the mobile website by simply pressing \"my devices.\" On the app that is non-existent. Then we have the issue with the app always going to the last page or some random page when I open a link. Or open a thread. \n\nThere are many more gripes just like the Android authority app (oh the nightmares of that app).", "You also have to go out of your way to enable it", "Extra set though and knowing me I will hit the XDA instant app without looking and then having to back out and go select the mobile page. Yes I know that it is a minor complaint but it would be annoying to accidentally press the instant app instead of the mobile site (due to the instant app being on the top most result).", "This is the first I've heard of an end date/deadline for the updates to be finished. 17th, huh, is that just conjecture from past update schedules for the USA region from Chinese manufacturers?", "Source on the \"finished by the 17th\" part? And Huawei may be the largest whatever, but show anyone in the streets my honor 8 and they ask if it's an iPhone. Only Android nerds know how big Huawei is, everyone else don't care", "That is true, but there are instant apps I see myself using like eBay or even Amazon. Not all of them are like XDA's app.", "Just means a forecast for when everyone in the U.S. can expect to see it due to the releasing in waves. Not a real deadline.", "Check Honor's Twitter account (@Honor_USA), they're mentioning it to everyone who asks about it.\n\nAlso, the statement that Huawei is only known by Android nerds couldn't be further from the truth. I know many people who are relatively technologically illiterate who own Huawei phones. They've been dominating the low-end and mid-range market for ages, just recently foraying into flagship competitors. They're also massive in their home country with everyone, including tech enthusiasts to old grandmas.\n\nJust a reminder that it's estimated that Huawei has nearly a 10% share in the entire smartphone market.   \n\nAlso, just because some Americans wouldn't immediately recognize a Huawei phones barely means anything to their popularity. I know many people who think that only two smartphone brands exist in the entire world: Apple and Samsung. Mention Motorola, HTC, LG, Sony, and so on: they either have never heard of the company or had no idea they made phones. These are all companies that we accept as popular (and mostly good) manufacturers.", "I'm sorry for my ignorance, this must be a difference is country thing. I understand Huawei is big in the East and the majority there are familiar with them, but here in the USA, they don't have partnerships with major carriers so they don't have widespread promotions and so they are \"little known\"", "I'm Canadian, and they're still pretty well known here. A good amount of retailers stock them, and their phones work on all carriers. I've seen a lot of carriers themselves sell things like the Huawei Nova to customers. A good amount of people here know who Huawei is...and I imagine that's not much different in the US.", "I've looked up the Nova specs before, and I know it doesn't support the bands we need for our carriers.", "That's because the Nova isn't available in the US. I was just using it as an example: if they can get a phone be sold and advertised through every major carrier in the country, they're obviously a popular company here (not like that's a good metric, most carriers worldwide only sell Apple, Samsung, and maybe LG phones - doesn't mean those are the only popular companies). The US isn't the center of the world.\n\nThat's not even the point I was trying to make, just a supporting detail. Don't really get how your comment is relevant."]}, {"title": "Instant apps are now a thing!", "comments": ["I never realised how tall 18:9 was until I saw this screenshot.", "Been working like this for months on CBC and Vimeo. Just not many sites use it.", "I experienced this a couple weeks ago, I know it doesn't \"need\" installation but I kept coming back to the webpage and the app version was still popping up when I wanted the regular internet page. I was upset there was no way to clear this or delete it in a way. To me it seems like something was installed.. ", "I'm getting it on Stackexchange too it's great", "Yea I got an instant app for domain.com.au when looking at property weeks ago", "*Globul*", "I've had it work for Vimeo for months now", "I still don't have an instant apps section in the Google settings.\n\nSilly slow serverside rollout :(", "If you want to try and easily accessible instant app, go to vimeo.\n\n", "Wish does this too.", "Sorry DoPeopleEvenLookHere, your submission has been removed: \n\n> Rule 5a\\. \"No reposting.\"\n> [See the wiki page for more\n> information.](http://www.reddit.com/r/Android/wiki/rulesandregs#wiki_5._no_reposts.2C_spam_or_blog-spam.)\n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=/r/android&subject=about my removed submission&message=I'm writing to you about the following submission: {url}. )", "I'm not even surprised anymore. Two months does that to people :P", "Go to settings and my apps to see, I think it may be there..I have Twitter like this and added it to my home screen and its just like an app.", "You are not very good at removing, Mr. Bot.", "This isn't a bot, though.", "I see it tonne on subreddits. Sorry, your submission has been removed. 3 hours later it's the top post in the sub."]}, {"title": "Play Store v7.8 prepares to add pre-registration rewards, settings for Instant Apps, Play Protect, and more [APK Teardown + Download]", "comments": ["Pre-registering????\n\nActivision: ***HEAVY BREATHING***", "Now that's awesome. But hell, it would take another 2 months to launch in my country, which is pretty sad after all.", "Oh goody. Steam greenlight for android.", "USA Only?", "Are we sure this is not another hoax?"]}, {"title": "Instant Apps and Kotlin", "comments": ["If you use Proguard, Kotlin adds very little to your APK size. Your results may vary, but I've only seen a [very small increase to my APK size](http://i.imgur.com/Lt0T1zS.png).", "The Kotlin stdlib proguards really well. As long as you're using proguard on your modules you shouldn't notice much of a difference at all.", "Instant Apps SDK does not support Kotlin right now though according to Google", "An sdk doesn't need to support a language. That doesn't make sense.", "Yeah, there was a bug in the instant app SDK, but if you update the Kotlin plugin to the newest version it works like a charm", "Yeah, there was a bug in the instant app SDK, but if you update the Kotlin plugin to the newest version it works like a charm", "Yeah, there was a bug in the instant app SDK, but if you update the Kotlin plugin to the newest version it works like a charm", "Yeah, there was a bug in the instant app SDK, but if you update the Kotlin plugin to the newest version it works like a charm", "Yeah, there was a bug in the instant app SDK, but if you update the Kotlin plugin to the newest version it works like a charm", "Yeah, there was a bug in the instant app SDK, but if you update the Kotlin plugin to the newest version it works like a charm", "Yeah, there was a bug in the instant app SDK, but if you update the Kotlin plugin to the newest version it works like a charm", "Yeah, there was a bug in the instant app SDK, but if you update the Kotlin plugin to the newest version it works like a charm", "Yeah, there was a bug in the instant app SDK, but if you update the Kotlin plugin to the newest version it works like a charm", "[It is a known issue from Google that you can't do a Gradle sync with the kotlin plugin and Instant Apps SDK.](https://developer.android.com/studio/preview/kotlin-issues.html)\n\n", "[It is a known issue from Google that you can't do a Gradle sync with the kotlin plugin and Instant Apps SDK.](https://developer.android.com/studio/preview/kotlin-issues.html)\n\n", "[It is a known issue from Google that you can't do a Gradle sync with the kotlin plugin and Instant Apps SDK.](https://developer.android.com/studio/preview/kotlin-issues.html)\n\n", "[It is a known issue from Google that you can't do a Gradle sync with the kotlin plugin and Instant Apps SDK.](https://developer.android.com/studio/preview/kotlin-issues.html)\n\n", "[It is a known issue from Google that you can't do a Gradle sync with the kotlin plugin and Instant Apps SDK.](https://developer.android.com/studio/preview/kotlin-issues.html)\n\n", "Oh snap. I stand corrected! Good find. I'm sure they'll fix this before Android Studio 3.0 goes final. Something to keep in mind for the very immediate future though."]}, {"title": "Android Instant Apps starts initial live testing", "comments": ["Is there a good article/talk about how to split an app into modules (w/ best practices) and how to make them communicate between themselves?", "Just the other day everyone was like \"what about instant apps\" and that's what about. ", "How can you determine if a module meets the 4mb requirement?", "[deleted]", "[deleted]", "Here are a couple of posts (including my reply) that outline a great strategy for splitting up your app by feature, leveraging Dagger multibindings to aid in decoupling everything: https://www.reddit.com/r/androiddev/comments/5fog8n/share_your_main_project_structure/damz65q/?context=1", "Even on r/Android there was a question yesterday or the day before. ", "for me it s the opposite, just another thing to get excited about, i guess im still young.", "On the developers page it says 4MB per module", "Wouldn't I need multiple modules instead of packages for the instant apps feature to work? (due to the 4MB constraint)", "Same here!\n\nI'm very excited about instant apps, they seem very promising IMO.", "I don't think you'll necessary need to split the app into modules. If you use Dagger 2, you can use Proguard to strip all unused code from a given variant (I assume that'll be roughly how it's implemented).", "I don't think that would work. As reported in the article, once you start an instant app, it will be able to download additional modules as the user navigates in the app (eg. from product detail page to checkout)"]}, {"title": "Instant Apps Google I/O", "comments": ["[deleted]", "Absolutely, I'm interested in how google is responding to `on-the-fly` update solutions like react native.  I love native development, but whoever cracks the install barrier problem will be a market winner.", "I have been a Dev for 5 years now and I don't see why they're reinventing PWAs\n\nhttps://xkcd.com/1367/", "what are the paths to finding it? googling 'zillow' on a pixel and pray you are in the a side of the a/b test?", "Excuse my ignorance, but I can't connect the dots of how React Native could be competition for Instant Apps. AFAIK, a React Native app also needs to be installed through the Play store or does it offer any Instant App functionality already?", "At the top of my head:\n\n* Instant Apps are limited to 4MB. Web pages are not. \n* Instant Apps are pre-made. Web pages are sometimes generated dynamically, thus they can take longer to download.\n* Instant Apps are still downloaded and launched from Google Play. Web pages can be downloaded from anywhere. So a scammer would need to pay an additional $25 for every phishing app he makes and use a completely different credit card, a different valid cell phone number, and a different signature each time his app was discovered as malware. \n* Native Android apps have a uniform way of dealing with different screen sizes and densities. Web apps on the other hand have many more different ways of dealing with sizes and densities.  \n* For Android apps, their lifecycles on phones and tablets are well understood. For web apps, it wouldn't be clear what the web page was supposed to do when it gets interrupted by a phone call, or by a screen lock, and/or returns from those states.\n* Instant Apps don't run on competing platforms like iOS or Tizen. This is not a benefit for users, but it could be considered a benefit for Google. ", "Better performance and direct access to Android hardware, to name two things. Working with the camera or bluetooth come to mind. ", "React-native apps are able to keep up-to-date once they're installed, without installing a new apk. You just update the javascript bundle itself.\n\nBut agreed, you still need to install the apps like regular apps.", "1. I know of web apps that download less than 1MB to the client. Only fools will develop webapps that are huge. \n2. There are ways to optimise web app performance drastically. \n3. So now you want me to rest assured about my security because putting malware on my phone involves too many steps? This is not security, this is just friction. \n4. One official standard vs dozens of competing standards. I don't see the advantage. \n5. Okay you have ONE advantage. \n6. The last time I checked, open web and cross platform standards were a good thing. ", "Camera and Bluetooth are accessible via pwa\n\n https://whatwebcando.today/\n\n\nhttp://pwa.rocks\n\n", "React Native won't be compatible with instant apps, Google wants to push best in class native Android not 3rd party solutions.", "Does the web app work with Android pay and Smart Lock out of the box? Does it drive app installs and viral sharing?  Usually a web approach is to avoid platform specific features so they give up these features which are very useful to users.\n\nI think web is a fine approach if your use case is purely \"browsing\" content. If you want something more immersive or integrated into the phone's OS instant apps and full apps give you more capability.\n\nSo it really all comes down to use case.", "> I know of web apps that download less than 1MB to the client. Only fools will develop webapps that are huge.\n\nNot fools, but developers with different use cases. If you develop a game with lots of graphics for instance, or with OpenGL, then Instant Android Apps are not going to be for you. \n>\n> There are ways to optimise web app performance drastically.\n\nYes, but optimization is not required, it's optional. And as developers/product managers/CEOs with good broadband support and good 4G support at home and at work (even if we do like to complain about it all the time), we tend to forget about people with much slower and much flakier internet access than ours.\n\n> So now you want me to rest assured about my security because putting malware on my phone involves too many steps? This is not security, this is just friction.\n\nI didn't say that. No, you should never rest assured about your security. But good security has many-many layers to it. For instance, it would be easy for someone to kick in my front door at home because my locks are average and my door and my door frame are not reinforced with steel. But that doesn't mean that I've given up on locking my front door when I go out, and nor does it mean that my door is the only layer of security for my home. Again, good security has many layers.\n\n> One official standard vs dozens of competing standards. I don't see the advantage.\n\nI agree and yet, I've tried developing HTML5 progressive web applications and Phone Gap/Cordova hybrid HTML applications, and those are indeed perfect for some uses cases, but personally, I keep on coming back to native Java Android for the kind of applications and responsive UIs that I actually want to create. \n\nFor all I know, this could be Google's fault. Like I said, it may not be in their selfish interest to be compatible with competing platforms (now that they dominate in mobile). \n\n> The last time I checked, open web and cross platform standards were a good thing.\n\nI agree completely. That's why I said that it wasn't necessarily beneficial for end users, although Google could see it as potentially beneficial to its own interests. So may be that's why they introduced instant apps instead of trying to improve HTML5 support and standard open web browser support for access to native Android APIs.", "Thanks for the links. \n\nIn that case, I guess I would just point out the items that aren't supported, as per the first link. \n\n- NFC\n\n- Inter-app communication\n\n- Ambient light sensors\n\n- Proximity sensors\n\n- Notifications\n\n- Wakelock\n\n- Contacts (!!!)\n\nPlus, again, performance. And a better overall experience - web sites are often kind of weird on mobile. Janky animations, awkward touch targets, obtrusive interstitial ads that are made for desktop, that sort of thing.", "Oh I know and agree. Google _should_ push native solutions, and they're definitely better. /u/sebaslogen just asked how react native could auto-update without an APK change.", "At least chrome works with Smart Lock, other browsers have password managers or extensions that provide similar functionality. \n\nAndroid Pay: As I said in another comment, the standard is evolving. \nhttps://developer.mozilla.org/en-US/docs/Web/API/Payment_Request_API I'm pretty sure this will support Android pay soon\n\nSharing: there's an experimental API that might, in future become the standard as well. https://developers.google.com/web/updates/2016/10/navigator-share\n\nDriving app installs: If your use cases are covered with a PWA I don't think you even need a native app. \n\nFor something immersive and integrated, like games, VR and AR apps, things that utilizes hardware like NFC, Sensors, etc. That's the only place where you truly need a native app. \n\nAgain, I want to express that moving away all the attention from a fast evolving cross platform standard to something completely new that works only on Android is not a good thing. ", "You talked about openGL, where instant apps won't work for you, neither will web apps. This just highlights the place of native apps in the market. \n\nGood security has layers. Extra steps is not an added layer. It's just friction.\n\nIt you have to advocate something with a company's selfish interest, I think it's definitely a bad thing. I know, capitalist minds won't understand that. \n\n", "My point is, you should not take attention away from a cross-platform standard that is evolving pretty fast and divert it to something completely new that runs on only one platform. \n\nAlso, push notifications work on webapps. It's the local notifications that don't. I see that as a good thing. Local notifications are usually used by apps to get the user to open the app more frequently. \n\nOther things may get support soon. The standard is evolving. \n\nAbout the experience, developer's don't make it good enough. See the Twitter mobile website. It's is pretty cool. \n", "> You talked about openGL, where instant apps won't work for you, neither will web apps. This just highlights the place of native apps in the market.\n\nYou're right. I didn't think of that particular example all the way through. \n\n> Good security has layers. Extra steps is not an added layer. It's just friction.\n\nAn extra layer can mean both extra friction for the scammer AND an attempt at better security at the same time. For instance, locking and unlocking my front door every time I go out is a form of friction. \n\nAnd yes, this can also create extra friction for the end user as well, which is why the concept of Instant Apps was created, it was created as a way to try to remove some of the friction end users face with trying to install Android apps (mostly because users still prefer the capability of native Android apps in some cases instead of web pages). And please note that I've just said \"in some cases\". \n\nIn other cases, a web page may be perfectly satisfactory for end users, and I don't disagree that there will be some examples of developers wasting their time building instant apps when a form on a web page could equally do the job (and which most importantly, will work on all platforms, not just Android).\n\n> It you have to advocate something with a company's selfish interest, I think it's definitely a bad thing. I know, capitalist minds won't understand that.\n\nAgain, I'm not siding with the company on this point. I was only trying to answer the original question which asked why are they doing this when we already have progressive web applications.\n\nI'm not sure why you're trying to argue with me when I've said that I agreed with you and when I've already said that this particular point is a bad thing for end users. ", "While I believe we will move back to the web some day, I have been hearing this for almost 10 years. Maybe in another 10 years native apps will the minority, maybe not."]}, {"title": "Instant apps", "comments": ["You can enable them from Settings --> Google --> instant apps\n\n\niirc they are only available for pixel and nexuses currently. So, even though you can enable them, you won't be able to use it. For now. \n\n\nAlso, You won't find instant apps on play store. You'll find them from browser, when you google it (with a tiny text indicating the website has instant app available). \n\nAnd only, handful of websites currently have it. So, not useful as of now, but, cool implementation.", "Same here. \nNo instant apps option found in  the \"Google\" menu. \n\nI've updated everything ", "settings > google> instant apps > turn on", "Same. Not available in Settings - Google for me either. ", "Seems like it's available for 3/3T but not 5.", "I've followed your instructions and it worked on my OnePlus 3T so it's not just pixel and nexuses.\n\nOn [this website](https://www.nytimes.com/crosswords/index.html) when I selected an option to play, it showed a pop-up to open the instant app.", "I meant that I have an appointment called instant apps on my play store history. I have only had an OPO and OP5 recently", "Just started getting them the other day on my 3T. Didn't have to turn anything on. Vimeo and stackoverflow are the two sites I can remember that used them.", "I've had the Vimeo one run on my stock OP3", "I tried that and i dont see the instant apps option", "That's pretty weird", "OK, I see. But, I don't get that for other instant apps supported sites. Maybe it's website thing. I'll have to see. Thanks!", "Do you mean why you have instant apps in your apps history when you didn't explicitly installed? Yeah well, google (rather google play services) installs it implicitly on every supported device.\n\n", "No it was installed and removed when I set up my phone. I can't even look at the description of it", "hmmm. Do you have instant apps option in settings? Maybe google thought your device wasn't supported? It could be bug. I believe it will be installed implicitly again."]}, {"title": "Introducing Android Instant Apps SDK 1.1", "comments": ["I haven't come across any Instant Apps so far. ", "Nothing new for end users.", "#/r/androiddev\n\nFor actual dev talk on this topic, [refer to the post on the appropriate sub.](https://www.reddit.com/r/androiddev/comments/760je8/introducing_android_instant_apps_sdk_11/) Googler devs don't respond in /r/android, but if you have any non-issue questions, they're very likely to respond in /r/androiddev.", "Vimeo, wish", "Instagram has one, I replaced the full sized app for it", "Well, it comes in a smaller package"]}, {"title": "FYI: About an hour ago I had an app forced installed called \"Instant Apps\".", "comments": ["FYI:  This is nothing to be afraid of.  Instant Apps are a way Google can break up apps into smaller components and then allow various things to deep-link into an app.  \n\nThe Verge has an article [and a video from Google I/O in May](http://www.theverge.com/2016/5/18/11703884/android-instant-apps-no-download) that shows and explains what happening.  For people that don't want to watch the video:\n\n1. Apps are refactored into \"components\".\n2. Instant Apps (the thing being sent out) is a framework that handles the deep-links.  It's also a sandbox that basically runs Android apps with a limited set of permissions (basically nothing background-y or access to storage, etc.)\n3. When you click on a link, it goes to some web server.\n4. That web server (say at Buzzfeed) then points at some intent like \"Launch the buzzfeed video app\".  \n5. Android says, \"I don't have that app.\"  \n6. Instant Apps says, \"hold on, there's an instant app version of that!\" and fires up, pulls up the instant app version, downloads only the bits needed, and runs them.\n7. The framework appears to provide an \"Install\" option to install the app locally as we normally do.\n\n", "They were talking about this in r/Android", "https://support.google.com/googleplay/answer/7240211?hl=en\n\nApparently so you can real-time run an app without installing it.... perhaps preview Play store apps?", "Wow. Can you share screenshots?", "/r/blink182 is bleeding through on that Android article 😊", "Why would I want Instant Apps?", "Yeah I saw, didn't see a thread here. This is just a fyi.", "Doesn't seem to be an app I can open. It's not listed in my app drawer or in the apps list under settings.", "But is it bleeding out?", "Good question.  Seems kind of like a good idea on paper but I don't see it being big long-term.\n\nYou can google to see why they're doing it of course, but TLDR:  If you want a QUICK rendition of an app without installing the whole app, such as you're on a slow network connection or costly data...  The example is finding a recipe in an app without installing the whole app.\n\nAgain, I think it's a neat idea without an actual business case.", "It's in the apps list in your settings if you enable \"show system apps\". \n\nAs far as 'opening' it goes, go to settings => Google => Instant Apps. ", "Must be an American thing? My Canadian Pixel doesn't have it listed.", "It's being slowly rolled out.  No idea if that is regionally locked too. ", "In America and I don't have it either ", "I saw this install ok my UK pixel XL today."]}, {"title": "Just got Google Play Services Instant Apps", "comments": ["Just noticed it yesterday when I opened a Zillow link, it asked me if I want to get the instant app, I was so excited I hit yes and it took a good minute to download the app, it wasn't very instant at all. Slow moving rogress bar and everything. \n\nThe app worked much better than Zillow's awful website, that's for sure, but it downloaded quite a large app, and since I'm on Fi, I paid for it to download. \n\nI'm very excited by the idea, I look forward to using it more, hopefully not all apps are this big and are actually more instant. \n", "What is the purpose​ of this app?", "Are signed up for Google play services beta tester?", "Are you sure that wasn't just the regular app? I just went on Zillow and it asked me to download the app, nothing about instant apps. Do you have the app installed on your phone? I don't believe instant apps are supposed to be installed anywhere, they're more akin to webapps.", "I used the Hotpads instant app and had a very positive experience with it.", "There are some websites that allow you to instantly open their site as an app. It is like a webapp, but has its own icon in the launcher and such. I think this provides the Google Play Services to these webapps. [This page](https://developer.android.com/topic/instant-apps/index.html) describes it a bit.", "Yes", "Yeah it opens up within a web view, and a notification pops up saying instant apps don't need installation.", "Ya i got the zillow instant app a few weeks ago. It's pretty clear with the popup and the notification icon that it's an instant app. ", "Don't get me wrong, the experience was great, and like I said I'm looking forward to using it. I just wish the download wasn't so big. ", "Thanks for the clarification!"]}, {"title": "Google Play Store 7.8.15 Prepares for Instant Apps Support.", "comments": ["I received a brief \"Installing Instant Apps\" notification from the Play Store app the other day. I couldn't find any trace of it afterward, but interesting nonetheless.", "What are some apps i can try this on?\n", "this feature only works on nougat right ? I hope I get nougat soon", "I got it twice, I thought I was going crazy. ", "[It's in your app list](http://i.imgur.com/7wgGNa9.jpg)"]}, {"title": "INSTANT APPS INSTANT APPS HYPE HYPE BAM LOADED NO DOWNLOAD DUARTE PIXEL UPVOTE PLS", "comments": ["/uj\nWhat the fresh hell are instant apps?", "Do you live under a rock?", "[This](https://www.youtube.com/watch?v=cosqlfqrpFA&t=191s)", "Yes", "This guy looks like he's staring at my ear and it disturbs me"]}, {"title": "Instant Apps?", "comments": ["Hm I could've sworn I had gotten the Vimeo instant app to work in the past, but no such luck now.\n\nWas hoping the instant apps would be a little more prevalent by now. Kind of a bummer.", "I've never tried to get it to work, but I've definitely seen it a few times. The one I specifically remember working was the redfin app", "There aren't that many, but I've used a few.", "Using Redditisfun YouTube acts as an instant app.", "Go to your instant app settings and see if it shows an account to use or if it shows a spot for instant app permission. Ever since Oreo I cannot get past the sign in for instant apps.", "Vimeo instant app always loads when I open a link through Reddit (Sync)", "That because the RiF developer added that feature. It has nothing to do with instant apps", "I checked that and I've got it enabled for my main account. I tried turning it off and back on and it gave me the little dialog asking if I wanted to opt in so I said yes but still no luck with any instant apps. Was it working for you before Oreo?", "Huh, interesting. I'll have to remember that.", "Ah, well nevermind then.", "It worked perfectly on nougat but Oreo broke it.", "Interesting. I turned it on a few months back when I was still on Nougat, but I never actually tried using it. Hopefully it gets fixed soon in Oreo."]}, {"title": "Google Play Services for Instant Apps gets update today, target API downgrades from Kitkat to Jelly Bean", "comments": ["What app is that?", "I was wondering what randomly started updating last night.  It would disappear and then reappear.", "[Play Store Link] (https://play.google.com/store/apps/details?id=com.kroegerama.appchecker) ", "The worse is when Google Play Services wants to randomly update without little notice and freezes everything "]}, {"title": "Instant Apps Update", "comments": ["How often does android update itself without user knowing?", "Looks like version 1.0 of GPS for Instant Apps came out [in January](http://www.apkmirror.com/apk/google-inc/google-play-services-for-instant-apps/google-play-services-for-instant-apps-1-0-release-144971339-release/)", "I just saw this on my phone. Unsettling.", "I noticed an update recently, but couldn't find any in my apps or play store.", "That update has closed my YouTube app mid playing. Thanks, Google. ", "I wonder what this update is for. I'm on version 1.4-release-152253727 now. ", "It's for instant apps. To have them work."]}, {"title": "Google Instant Apps", "comments": ["I have had like 3 random instant app updates. No idea. Pretty sure they framework is there. The devs just need to use it. ", "I received another carrier services update today.  I know it's not relevant but it didn't deserve a new thread", "I think most people have had this, it gets updated sometimes, also, it's a system app that's not in your app drawer. You can check from settings >apps> tap the 3 dots > show system (assuming you have either a Nexus or Pixel device, cause I don't think many other devices are running 7.1.1", "You toggle it on/off from the Settings -> Google -> Instant App menu. ", "Maybe they've not open sourced the framework to devs yet. I feel that the instant apps were hyped up in I/O last year and then we never heard about them again.", "Google hasn't made it an official public part of the Android SDK yet. But developers can sign up for the[ early access program](https://docs.google.com/forms/d/e/1FAIpQLScPQn78CBIxsI0RhIoGPMbuU6COhQ7H2eHr9t-S0CcgtILF4w/viewform?fbzx=268538362383955392https://docs.google.com/forms/d/e/1FAIpQLScPQn78CBIxsI0RhIoGPMbuU6COhQ7H2eHr9t-S0CcgtILF4w/viewform?fbzx=268538362383955392) for it."]}, {"title": "Instant Apps on Axon 7", "comments": ["Yes. Google said that it's only available on some devices for now.", "Instant apps?", "Makes sense. A CS agent said that our phones are incompatible. Like what. We are on the latest OS, have good hardware. My mom's Galaxy S5 and My Sister's S7 both have it. ", "https://developer.android.com/topic/instant-apps/index.html", "Interesting. Didn't know that existed. ", "They're not really promoting it. Last time I've seen something about it must have been in the presentation at I/O 2016 if I remember correctly.", "They got serious about it during IO 2017"]}, {"title": "Lineage os and Instant Apps", "comments": ["I've seen Google play update it before so I assume it's there. Never used it though.", "Works for me, you know its not on all apps yet don't you?\n\nSkyscanner definitely works!", "Have you enable it?\n\nSettings - Google - Instant Apps", "It depends on the device you have! \nFor ex: On the Nexus with lineageOS you will get the instant apps section! (Gapps - nano)\n", "Doesnt even show up on settings > google", "Dont have Instant Apps on the list. ", "It's not there on my Nexus 5X or my Nexus 5 running LOS, yet I get these random downloads from Instant Apps.", "As others have said, what gapps are you running?", "Probably depends on the version of gapps installed!\n\nOn my Redmi note 3 (Stock - OpenGapps), I have the option.\n\nBut my Nexus 9 (BeansGapps-Mini-7.1.x-20170725) -- doesn't", "It's in the Google account section. You need to enable it!", "Nano", "Can confirm. I use stock gapps too, I have Instant Apps option. Just turned on!", "Thanks for the reply.  There is no option in Google Settings, yet I still get random downloads labeled Instant Apps.", "Same here! I wonder if mine has updated but yours hasn't got it yet\n\nCould try flashing the latest gapps to see if it appears!"]}, {"title": "Has anyone actually been able to use instant apps?", "comments": ["Yes, Vimeo", "Opening CBC News links triggers their Instant App for me. It worked wonderfully under Nougat but ever since the Oreo update it never loads, I get the spinner showing it's loading but it never does.", "Just a couple. Vimeo is one. The Weather Channel instant app is only a platform to get you to download the full app. I think the Realtor.com app worked as well. Honestly, I haven't seen this concept used much yet, and especially not to its full potential.", "Well now that you ask, I can't seem to get it working either. Pixel XL, Oct patch on T-mo US.", "Fuelly.com needs a goddamn instant app.", "Same! I thought it was only me."]}, {"title": "All apps suddenly crashed while viewing a GIF on Reddit, \"Instant Apps\" started installing. What?", "comments": ["It's a Google thing. Nothing to worry about. You can read about instant apps here: https://support.google.com/googleplay/answer/7240211?hl=en. But it's strange that it killed all your apps... Probably a bug or something", "lol i thught at first a new exploit was out. since i know .tiff can execute code on lots systems and .gif can also execute code but to lesser extent.", "It probably updated the webview."]}, {"title": "Are Android Instant Apps enabled by default?", "comments": ["It is not. But thanks for telling how to turn it on. I was thinking it was on by default and did not have a switch, but apparently not.", "Mine weren't. HTC u11", "Mine was off too. Moto G5 plus. But I turned it on now :)", "Google Pixel XL. When I checked it just shows my Google account so I think it is on. I have used it before so maybe I turned it on in the past and default was off?", "Thanks for checking! Instant App usage must be really low then if people have to switch it on first. ", "Thanks!", "Do you know which version you have on your G5? Thanks!", "Oh that's interesting! \n\nAre you running 8.0? I wonder if it's enabled by default for all 8.0 devices or just Google's. Thanks for your reply!", "Does this help?\n\n**Device information:**\n\n    Phone: Motorola Moto G (5) Plus (Moto G (5) Plus)\n    Android Version: 7.0 (24)\n    Device (product): potter_n (potter_n)\n    Rom: NPNS25.137-33-11\n", "Yes 8.0", "Totally, appreciate it! Thanks"]}, {"title": "Why no hardware backed keystore in instant apps?", "comments": ["Hypotethically, if there was a vulnerability (which there is, if you have the money), Instant Apps would be an extremely easy attack vector. That's probably why it's disabled.\n\n\nYou also need to remember this hardware key store, and TEE in general provides security for the user. Not you. It can act like DRM, and in fact it is used for DRM, but it can be bypassed if you have the money.  Just something to consider.", "Update:\nWhen using an emulator, I get:\n\njava.security.NoSuchAlgorithmException: no such algorithm: EC for provider HarmonyJSSE using the AndroidCAStore\n\nand:\n\njava.security.NoSuchAlgorithmException: no such algorithm: AES for provider AndroidKeyStore\n\nfurthermore:\n\njava.lang.NullPointerException: Attempt to invoke interface method 'int android.security.IKeystoreService.del(java.lang.String, int)' on a null object reference\n11-03 10:24:49.258 4403-4403/com.veqtor.ia_feature_tests W/System.err:     at android.security.KeyStore.delete(KeyStore.java:196)\n11-03 10:24:49.259 4403-4403/com.veqtor.ia_feature_tests W/System.err:     at android.security.Credentials.deletePrivateKeyTypeForAlias(Credentials.java:279)\n11-03 10:24:49.259 4403-4403/com.veqtor.ia_feature_tests W/System.err:     at android.security.Credentials.deleteAllTypesForAlias(Credentials.java:238)\n11-03 10:24:49.259 4403-4403/com.veqtor.ia_feature_tests W/System.err:     at android.security.keystore.AndroidKeyStoreKeyPairGeneratorSpi.generateKeyPair(AndroidKeyStoreKeyPairGeneratorSpi.java:466)\n11-03 10:24:49.259 4403-4403/com.veqtor.ia_feature_tests W/System.err:     at java.security.KeyPairGenerator$Delegate.generateKeyPair(KeyPairGenerator.java:728)\n11-03 10:24:49.259 4403-4403/com.veqtor.ia_feature_tests W/System.err:     at com.veqtor.ia_feature_tests.feature.MainActivity.onCreate(MainActivity.java:63)\n\nWhich makes me think that what I'm in fact dealing with is not the hw keystore being removed in IA, but rather, a buggy implementation\n\n\nWhat is it that seems to be \"supposed\" to work but crashes?\nKEY_ALGORITHM_RSA & KEY_ALGORITHM_EC when using AndroidKeyStore", "Do you care to elaborate on that vulnerability?\nFurthermore, how would allowing a user to protect their sensitive information inside the HW keystore create an attack vector inside an iApp, the keys would be bound to a certain app right?\nMy primary concern lies with my liability for information leakage from my users phones, which is why I try to build secure communications based on HW keypairs. SSL isn't really secure unless you use certificate pinning.\nAn app I'm working on also requires secure non-HTTP(S) communications (p2p). I would like to acquire new users using IA but with the HW keystore it will be difficult :/", "Well it's not just you.\n\nThe likely problem is Instant apps are blocked from binding to services. There should be exceptions, but apparently this isn't one of them.\nThe code should also should throw an exception if the bind fails, but it doesn't and that is where the null exception is coming from.\n\nI don't have any ideas on bypassing that. Probably just best to wait for Google to eitheir fix it or say it can't be done. In the mean time you can just use a different keystore, like BKS. Obviously those cannot be hardware.", "If a vulnerability exists a hacker could potentially grab all the private keys.... Instant Apps isn't really different than a normal app, but its made to be as accessible as a web browser. How would you feel if you opened a link and it stole all your information without you consenting?\n\nThat's the only reason I can think of for it being disabled. They may have added an alternative method, because not being able to do SSL seems pretty ridiculous. Or it's a bug on your end. Maybe a friendly Google developer can chime in.\n\nl will tinker a little with it later today and see what happens. I don't have a use for Instant Apps so my experience there is a bit limited. The answer may be obvious, but no one else is chiming in.", "A hacker wouldn't get more access to the private keys held by other apps than in any other scenario since the HW keystore is app-sandboxed, unlike in the Apple keychain.\nI'm pretty sure SSL is working, actually, I believe instant apps are forced to use SSL, it might be that not being able to access the HW keystore is in fact a bug and not by choice. I guess I will report it since it doesn't make sense from a security standpoint, nor does the documentation have any mention of it being a restricted feature in instant apps."]}, {"title": "Instant Apps Randomly Installing but then doesn't show up", "comments": ["It's updating instant apps inside Google play services, you can switch it off if you go settings, Google, instant apps", "Same, LG V10, I don't have any instant app installed ", "So is it on beta?", "I have it switched off, but yet I think I see it updating. Is it an issue?", "No, only certain apps support it, I think the updates are adding further support but I've yet to across an app that uses is"]}, {"title": "Android Instant Apps are here!", "comments": ["Wasn't this site there for a long time now? And \"I'm interested\" button just points you to an early access program form", "I was about to say the same thing. Hoping they will update the page soon.", "It's live now"]}, {"title": "Instant Apps Just Installed on My Pixel", "comments": ["This installed for me a couple weeks ago but I couldn't find any apps that took advantage of this new feature. Then today I saw this story: https://9to5google.com/2017/02/11/how-to-opt-in-and-use-android-instant-apps-currently-rolling-out-to-select-devices/ and I was able to get the Wish app to work as an instant app. (None of the other listed apps in the article worked for me, though).", "How did you get the notification log?", "On the home screen, press down and select widgets. Then place the settings shortcut widget on your home screen. You will then be prompted to select which setting and select the notification log.", "Add the settings shortcut widget to your home screen. It's the one called notification log.", "Thanks!", "Tapping the widget crashes the settings app for me. Any idea why?", "Thanks!"]}, {"title": "Are there any reasons for feature modules other than instant apps support?", "comments": ["Yes build times.\nWe migrated a very large monolith project into a multiple feature project Took almost 6 months to complete. Wasnt easy. \nBuild time before +- 4 minutes.\nNow its more towards 10 to 20 seconds. ", "parallel gradle module builds", "[deleted]", "That's exactly what I was thinking. I don't want to spend several months only to reduce CI times a couple of minutes when the bottleneck is installing the environment into Travis anyway, plus that's not wasted time because it doesn't block my machine. ", "This is not a \"feature\" module structure.", "That is how libgdx projects get laid out too ", "oh damn, true, I didn't seem to have read the instructions properly\n\ni mean, aside from shorter build times and separation of concerns, there's no real benefit"]}, {"title": "Google's instant apps", "comments": ["I have a Z2 Play (so on 7.1.1) and I do not have it. I previously had Instant Apps in my Play Store library, as my old phone did have it, but was unable to install it onto my Z2P. It is no longer visible, however. ", "I don't have it on my Z play either anymore but I had it a few days ago.", "Z play 7.1.1 and I don't see the setting, but I still have instant apps. Used it on Jet mobile", "Actually, I do have Google Play services for Instant Apps in my apps list. ", "It really pissing me off how lenovo or Motorola is screwing our devices. Now they didn't bother to add night mode and now they removed instant apps. Good way to keep your customers happy", "What is your Android version? ", "7.1.1, I had it after the update to 7.1.1 but now I don't."]}, {"title": "An app called Instant Apps installed itself on my Android and then disappeared", "comments": ["I have that happens don't as well. I went to apps, then there was a setting for \"show system apps\", and it was there", "Yeah I tried that and it didn't show up. Or if it's there it's under some obscure name. I think I'm just gonna have to factory reset. Thanks for taking the time and contributing the suggestion. ", "Just happened to me too. I did a cursory search and apparently this is some new Google framework that allows an app to be installed simply by clicking a link without going through the full play store process (which sounds in no way like it could be a bad idea /s). I'm still trying to see if this was some sort of ota push, or if instant apps actually installed something. \n\nI was browsing reddit using reddit is fun at the time, but I don't see any link I could have clicked on my browsing history that would have installed something (I'd only been redditing for ten minutes at the time) \n\nPost back if you guys find out anything specific. ", "Confirming this as well, appears to have been installed 4/6/17 but today is the first time I noticed a notification from it. ", "I did come across the Google version of instant apps and I assumed that it had to be a Google push. But I also noticed other  websites/apps called instant Apps, one of them being from  Japan. So I wondered if maybe I left a browser window open that downloaded it or something. It just concerned me that it downloaded without any initialization or permission from me, and then when I tried to find it, it was gone. Just felt really sneaky that it downloaded so fast and without my permission.", "Hey look what I found:\n\nStep 1:  [Settings > Google ](http://i.imgur.com/DtNn7CG.png)\n\nStep 2:  [Instant Apps >](http://i.imgur.com/muQYkVk.png)\n\nStep 3:  [Toggle >](http://i.imgur.com/XrNdfU0.png)\n\nStep 4:  [Permissions](http://i.imgur.com/6uI4vMe.png)\n\nSo it's not technically enabled unless you manually enable it. I guess as long as it sits there and stays quiet it can be an orphan on my phone. If it gets out of line I'll beat it like the little bitch it is. ", "Totally concerned me too. I don't like even the idea of the thing.", "That setting is conspicuously absent on my device. But this is still interesting information."]}, {"title": "Went to view a Vimeo video and it opened it through the Vimeo Player via Instant Apps", "comments": ["In Android settings go to\nGoogle > instant apps > opt in", "Finally, a solution for annoying video player websites!", "How do I get in on this goodness? Still opens in the browser for me..."]}, {"title": "Android Instant Apps: Best practices for managing download size", "comments": ["Nice tip in the article:\n\n>Press Alt+Ctrl+Shift+I (Cmd+Alt+Shift+I on Mac OS), type \"unused resources\" and start \"Unused resources Android|Lint|Performance\" inspection. It helps to reduce the size of the installable APK as well. ", "In the article they show separation by activities.\n\nWould be cool if they could show an example that worked for people adhering to one activity with multiple fragments architectures. (I already have an idea in my mind on how to make it work, but a tried and tested example would be nice)", "For fragment-based or view-based architecture you'd need to have at least one activity as an entry point in each feature with your own routing logic."]}, {"title": "Instant Apps w/ Nexus on Nougat?", "comments": ["Very cool feature, did not know it exists.\n\nIn september this year, Apple will invent it as \"Instant mode\" for iOS 11 apps (only for iPhone 7s and higher).\n\n\"Now, Apps are available *immediately*, this is SO convenient. And we are sure you are going to *love* it.\" - cetainly Tim Cook / Phil Schiller / Craig Federighi in september.", "Settings --> Google --> Instant Apps --> turn on toggle --> Accept Ts&Cs", "\nSearch for wish results in the google app or chrome, if the result says \"instant\", you should be able to use it", "Thank you!", "https://youtu.be/kpz647i-6ik", "[deleted]", "Whew, took me a while but I finally got it working.  Could see the potential usefulness", ">[**Google instant apps demo [0:46]**](http://youtu.be/kpz647i-6ik)\n\n>>Recorded on a Nexus 5X running the 7.1.2 beta\n\n> [*^Brendon ^Maldonado*](https://www.youtube.com/channel/UCJIAy08noOjpovGTbMOcX5A) ^in ^Gaming\n\n>*^2 ^views ^since ^Feb ^2017*\n\n[^bot ^info](/r/youtubefactsbot/wiki/index)", ">[**Ride 2 Launch Trailer [1:13]**](http://youtu.be/TPCKRiqYSds)\n\n>>With new game modes, over 170 different bikes to tame, an unprecedented level of customization, and new race tracks to explore, Ride 2 is the largest motorcycle game ever made. It's fresh, stylish, and dynamic; a game designed for those who love motorbikes and those who love to Ride.\n\n> [*^Xbox*](https://www.youtube.com/channel/UCjBp_7RuDBUYbd1LegWEJ8g) ^in ^Gaming\n\n>*^13,327 ^views ^since ^Feb ^2017*\n\n[^bot ^info](/r/youtubefactsbot/wiki/index)", "Man, thank you!  Yea that really worked, the YouTube video helped a lot"]}, {"title": "Instant Apps", "comments": ["I've only seen one app (CBC) that uses instant apps so far. I'm looking forward to seeing more developers use it so I don't need as many apps on my phone", "This morning Google Play Instant showed in the notifications, kind of bugged me, Google already is instant enough.", "Vimeo uses it. It's really nice.", "CBC loads their instant app everytime i click on something from Google news,  But i don't get the point?  why not just load the mobile page.   The instant app loads slower than the page did. ", "I'm not a big fan of mobile websites, so I kinda prefer this method. But yeah, you're right that it's a bit slow to load IAs still.\n\nI hope this gets better as it matures", "i can't say i've noticed any difference between the instant app and the mobile site in terms of usability, am i overlooking something?"]}, {"title": "Not a Sync specific feature, but links to websites with \"Instant apps\" available ask if you want to open the app. Amazing.", "comments": ["Thanks for sharing your idea. Please keep the subreddit [**rules**](https://www.reddit.com/r/redditsync/about/rules/) in mind when posting feature requests. **Duplicate requests will be removed!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/redditsync) if you have any questions or concerns.*", "Linkme: Reddit sync", "[**Sync for reddit**](https://play.google.com/store/apps/details?id=com.laurencedawson.reddit_sync&referrer=utm_source%3Dreddit-playstorelinks__bot) by Red Apps LTD |  Free with IAP\n\n> A beautiful reddit app for browsing reddit on the go!\n\nRating: 91/100 | 500 thousand installs\n\n[Search manually](https://play.google.com/store/search?q=Reddit sync)\n\n\n\n------\n\n[^Feedback](https://www.reddit.com/r/cris9696/comments/79bsd0/)"]}, {"title": "Instant apps problem", "comments": ["Let's try clearing the Google Play Service.\n\nSettings -> Apps -> Google Play Store\n\nForce Stop/Disable. Also clear data (Storage -> Clear Data).\n\nOnce you clear the data, re-enable the app.", "When is instant apps supposed to be utilized? I see it update from time to time and I understand what it's for, but I've never seen it actually used.", "Thank you for trying to help me !\nI managed to force stop the Google Play Store. But, after disabling it (and before, i checked it also before) i can't clear data because phone is \"Computing...\" or calculating how much data it uses. It is the same for all apps in a phone. \n\nJust restarted the phone again (play store is disabled). I cannot clear data regardless of app. Any tips? \n\nEdit 1:\n\nI booted into recovery mode and wiped cache partition. Enabled Google Play Store. Still computing, not even been able to update apps (e.g. whatsapp)\n\nPhone still restarted randomly and without any visible reason.", "I'm not certain why your device's space would indefinitely computing.\n\n(Even though this shouldn't help), try to restart into safe mode. From power on, get to power-off menu, press and hold the restart button.\n\nIn safe mode, try to launch the Play app."]}, {"title": "I got instant apps on my S8", "comments": ["Instant apps has been around for awhile mate.", "It's a play services thing. I've had Instant apps on mine since I bought it.", "Has nothing to do with the s8, you can install this through the play store.", "I have a web browser on my S8.\n\nIs this not the stating mildly interesting facts about our phones thread?", "What are instant apps? ", "Yeah, so?", "If something is formatted for use in a particular app, play services will make that app available and install it temporarily to utilize the source material. Like that vimeo thing for instance, if you click a video in the Bixby page or Google app that is formatted for vimeo "]}, {"title": "Google Instant Apps not loading | VZW S8+", "comments": ["Having the same issue - Verizon Galaxy S8.", "I did the opt in yesterday, agreed to terms. Went back in to check out the settings or w/e and received this pop up after selecting the option to 'Restore' Instant Apps . I click restore and it literally never finishes updating. I've cleared the cache and that hasn't helped. Anyone else experience this?", "I downloaded and installed the official Google Play Services for Instant Apps APK and that let me get back to the option to turn it on, no more 'Restore' request but none of the instant apps popped up for me in search results. \n\nI uninstalled it, it looks like the S8 and S8+ don't get to use instant apps just yet. Nobody has posted saying it works for them.", "Mine installs but when I try and launch an instant app it just crashes and never loads. Canadian S8+.", "What the shit is instant apps.", "[deleted]", "[Google Instant Apps ](https://support.google.com/googleplay/answer/7240211?hl=en)", "Same Here", "Thanks. That sounds like something I can safely file away under \"Shit I Don't Care About\".\n\nIt does say on that page that it's unavailable on some devices - S8 is probably one of them, knowing Google."]}, {"title": "Instant Apps.", "comments": ["What's that?", "I guess it allows you to use an app or game without downloading it.", "Instant apps are apps that can be displayed in your browser, no install required. The developer has to create this for each app.\n\nFor instance, if you search directions into Google and click an option, it will take you to what looks like the full Google maps app, but it's an \"instant app\" that's being displayed in the browser. You don't have to do anything to activate it. If it's available, the instant app will show.", "Is there a list of apps that have the feature?", "There isn't an exhaustive list, but these are some of them: http://www.androidpolice.com/2017/05/18/instant-apps-announced-google-io/", "Thanks!", "Solved", "No problem!"]}, {"title": "Instant Apps Now Available", "comments": [">Did anyone else\n\nProbably", "Yup I just switched it on", "[deleted]", "Thanks. Just activated it", "I got New York times crossword puzzle and Vimeo, to work https://vimeo.com/190063150", "Yeah it seems to only be the Wish instapp for now."]}, {"title": "Instant Apps", "comments": ["I started getting instant apps today while browsing Reddit.", "I noticed the same thing. Hopefully it will come in a software update.", "You are right! It's working now. Thanks for the update!", "How do instant apps work?"]}, {"title": "What is \"Instant Apps\" and why does my phone update it off Wifi?", "comments": ["Google wants you to be able to open links in their native apps (i.e. Facebook, YouTube, Reddit, etc.). There are situations where you don't have an app installed but click on a link that Google thinks should be opened in an app. Instant Apps is a temporary version of the app on your phone - it only loads the portion of the app needed to show you the link. So the downloading you see is probably Google updating the temporary app on your phone. If you don't want this happening on your phone, Google gives you the option to disable it.", "https://support.google.com/googleplay/answer/7240211?hl=en-GB", "I get a bit pissed off by all these companies that try to get me to surf the internet via their preferred eco-system (and data collection), are there any decent user-friendly apps that basically let me nominate my preferred browser and prevent other apps from doing this?\n\nWeChat and Facebook are repeat offenders.", "I have instant apps disabled and still see this notification often. No idea why."]}, {"title": "Top 5 Secrets to Getting Android Instant Apps Work Started at Your Organization", "comments": ["#\\#3 will blow your mind", "For any questions on Instant Apps Development at Ticketmaster please message me or reach out [@jeffkelsey](https://twitter.com/jeffkelsey)", "LOL maybe title was a bit too \"Click Bait\"(y)!  I still think there are some good real nuggets of info inside for Android devs! "]}, {"title": "Android Developers Backstage: Episode 84: Instant Apps", "comments": []}, {"title": "Instant apps update?", "comments": ["Just got the same. Nothing to worry about as well - I looked into it, and it's something to do with Google Play Services.", "[Relevant post from a couple days ago](https://www.reddit.com/r/AndroidQuestions/comments/65hzuw/instant_apps_autoupdating_i_didnt_initiate_any/)\n\nIt's nothing to worry about.", "How to access my WhatsApp vediocal nd viocecall", "Much appreciate it. Thought my phone might've get compromised, and I'm keeping some sensitive data on it. But then I googled the issue and found this thread.\n\nAnyways, how exactly did you look into it? I tapped the notification, and the \"My Apps\" page of Google Play opened, nothing else happened."]}, {"title": "What is the scope of SEO for Instant Apps?", "comments": ["Hope it's not limited to ASO.", "> Currently it only supports Brand App search terms\n\nType 'shopping made fun' into Google Search (**not** Play Store Search) on Android and you get an Instant result for Wish. That's not a brand term.\n\nInstant Apps are basically Google's attempt to put the \"world of apps\" and the \"mobile web\" on a path of convergence, so the impact on SEO is pretty much unbounded. SEOs will need to think about 'SEO for apps', which is not the same thing as 'ASO'. App developers will need to make their apps indexable and use deep links as a first step.", "Isn't that similar to PWA? Indexing App Pages. \n\nWell Wish isn't available in my country as of yet.\n\nTwo more questions arise :\n1) Are the Organic Bots and App Bots going to talk?\n2) If it's not for a Brand term, are we going to see more instant App suggestions or just the best one?\n\nI thinks its a half baked concept and even Google hasn't figured it out."]}, {"title": "Instant Apps not working", "comments": ["You need \"Google Play Services for Instant Apps\" to get it to work.  It's supposed to roll out in the background but I haven't gotten it yet... it's on APKMirror, though. https://www.apkmirror.com/apk/google-inc/google-play-services-for-instant-apps/\n\nUpdate:  OK, that was a pain to get working... \n\n1. Enabled Google Assistant (Not sure if this matters).\n2. Installed latest Google Play Services for Instant Apps from APKMirror.\n3. Installed latest Google Play Store from APKMirror.\n4. Installed latest Google Play Services from APKMirror (440).\n5. Rebooted phone.\n6. Typed \"jet\" into Google Chrome and \"Jet app - Instant\" appears a few items down... but didn't work.\n7. Went into Settings > Google > Instant Apps > None > OK > [My Email Address] > I accept (Basically disable / re-enable instant apps).\n8. Went back into Chrome, typed \"jet\" and clicked the \"Jet App - Instant\" link again and it worked.'\n\nThe BuzzFeed Google Play Store app does NOT have a \"Try Now\" button or anything like that for me.", "Since Oreo, only Twitter Lite works for me.\n\nGo to https://mobile.twitter.com/ in Chrome and select \"Add to home screen\" option.\n\nThe \"Google Play Services for Instant Apps\" was removed from my phone as part of the Oreo upgrade, so it may be depreciated on Oreo.", "I can confirm that worked. So Google decided to remove most of instant apps support from Oreo then? Or does anyone know why almost no instant apps work on Oreo?", "> Google Play Services for Instant Apps\n\nThat is only needed on pre-Oreo devices it seems. Since Oreo, it is now baked into the Android framework."]}, {"title": "Instant Apps!", "comments": ["Same here. G5+", "Thanks,I got the same message today on my MZP.Had read about it before.Thanks again :)"]}]