[{"title": "Use Android Instant Apps. r/android, are there any advantages of using instant apps?", "comments": ["yes, not installing an app you will use once. Vimeo has an excellent instant app.", "I don't mind it if the app's less than 20 mb each time.", "how can i use instant apps? i don't seem to have any option to run an app without downloadong it", "I don't use it, and I have the option disabled. But somehow I still get Instat App update, how is that possible if I have it disabled.", "Instant apps need a blacklist option.  Some of them are not worth using, so I turned instant apps off. It's too bad you have to block them all to avoid the bad ones. ", "Mine are turned on and I can launch my own instant app through Android studio, but every other instant app even the try now button just opens a chrome tab.", "Thank you, although, I should have made my question more clear, what's the advantage of using the instant app feature over the browser?", "Instant app modules are supposed to be less than 4mb per Android guidelines.\nPretty sure that'd be less than 20mb on any device.", "Vimeo's website has Instant App enabled", "I get the updates too, so annoying. And if I forcefully disable the app I constantly get a notification to reenable.", "> and I have the option disabled. \n\nHow to disable?", "I'm not entirely sure how it works but this seems like a blacklist option to me.\n\nhttp://imgur.com/a/AVzqwtp", "Because apps usually have better performance and more features than a browser? Feels more native. \n\nThat's like asking what is the purpose of apps?", "Vimeo is a good example. The video player on browser isn't too well optimised. It barely reacts to input, doesn't cope well with aspect ratios and so on. But the instant app? Good one. Also, that one donation app. It made use of Google's Pay mechanisms that are yet to be seen in Chrome (for Android) and thereby lowered the willpower it took to donate. ", "Search for clash of clans play store, and you can try it if you are interested. It's great for such uses, guest account ,and try out a game for example, instantly.", "Native apps have much more functionality and always will. They will always be faster. Instant apps are just responsive web sites that functionality resembles a native app. They have a long ways to go still when compared to native apps.", "Oh sweet, didn't know that", "Also, the games can be up to 10 mb", "Do you need to have chrome installed?\n", "Via Google app settings", "Nice. I wonder when they added that option. Thanks a bunch. ", "No, you should also be able to get it from clicking a link from searching in the Google app", "Ah! I already removed the Google app lol.", "I was messing with it and it works but there are more steps than the last time I used. \n\nI search for Vimeo (it has an instant app) on Google App and I don't get an option to open it as an instant app like I used to. Instead, I have to open it on the browser, choose a video so I can get the \"try out app\" pop up, click on install so it takes me to the play store and then click \"try now.\" \n\nI remember that before I searched for \"Vimeo instant app\" and one of the links that appeared had \"instant app\" under it but now I get no result like that.\n\nEdit: [It used to be like this](https://i.imgur.com/jNe5SI3.png).\n\n[Not so much now](https://i.imgur.com/oE3mEqV.jpg).", "Android Settings -> Google -> instant apps", "Does 'try now' out work on other apps now? I was also having the issue of not being able to trigger an instant app, and then once I went to an instant app URL it seemed like a lot of stuff suddenly started working", "It worked with Vimeo but I don't know about others. Wish doesn't have a \"Try now.\"", "Examples of try now include BuzzFeed and Clash Royale"]}, {"title": "Play store shows Try Now button for instant apps", "comments": ["This has been available for months, possibly over a year even. Sadly the rollout has been super slow, but if you manually install Google Play Services for Instant apps then it should appear. ", "How do you get the play store to look like that? Substratum theme?", "Honestly I've had this for months, must've been one of the first for the rollout", "How did you record that GIF?", "Odd... I never saw the button for the longest time until I checked due to this post... however upon clicking on the 'Try Now' button only opens it in Chrome.", "This is indeed old news http://www.androidpolice.com/2017/10/20/try-now-button-starts-showing-play-store-instant-apps/. ", "Today I realized it on my Samsung S7 Edge. Pretty sure it wasnt there before. Altough try now button works, chrome or samsung browser does not open links through instant apps for me.", "It doesn't. I installed Instant Apps apk two months ago, enabled it in Play Services, and never had a single suggestion to use them.\n\nEdit: now that I've mentioned it, I've decided to check what could be wrong. I uninstalled the apk, Play Services immediately prompted me to install an integral part back, so I did. Now I have a \"Try out\" button, but it only opens the Vimeo webpage. What the hell.", "Yes, [Swift Dark.](https://play.google.com/store/apps/details?id=com.brit.swiftdark.substratum)\n\nIt also themes [Google maps,](https://i.imgur.com/JWKik0t.jpg) [Chrome, ](https://i.imgur.com/9lfJ9Mx.png)etc.", "Yeah they can do that. ", "He asked Google Assistant.", "I used the built in screen recorder on my ROM, which gives an MP4 file. I then uploaded it to gfycat which did the conversion.", "Mine doesn't do it consistently. Sometimes it opens the instant app, and other times it doesn't.", "That's odd. For my last 3 devices that I've had to do it manually (Nexus 6P, Moto Z, OnePlus 5) I just installed the Instant apps apk and enabled it and I usually visit wish.com and it launches the Wish Instant app. There's also a link to Try it Now apps in the Play Store that I used with my previous two phones and it showed the Try it Now button. \n\nFor what it's worth, my 6P did take a while to show the Try it Now button despite Instant apps working elsewhere. ", "[deleted]", "is this only for Samsung?", "what rom are you using?", "If you have Oreo you don't need root or an unlocked bootloader. The only apps you need are Substratum, Andromeda (is a plug-in that you need to buy) and themes, paid or free. Other than that you have to activate debug USB in the option of your phone and download the file you have to run on your PC to activate Andromeda on your phone. I think that you will find a lot of guides on YouTube or even in the description of the apps themselves.\n\n\nP.S. once you have applied a theme, remove the automatic updates for the apps you themed. If they update while they are themed you probably won't be able to use them until you reconnect your phone to your PC and apply again the theme (if the dev of the them has supported the version of the updated app). Same things for the themes.", "No, it works with Substratum. I think it also works with whatever theme system Samsung have in their newer phones.", "With a plugin it works with any Samsung phone with Nougat"]}, {"title": "Instant Apps break PackageManager list of installed apps on Android 8.0", "comments": ["Can't view without signing into a Google account. Lovely", "What's the usecase for that API? ", "Well, one rule of this sub is to post the original source of an article and that's the original source for this: https://www.androidpolice.com/2018/03/23/instant-apps-break-packagemanager-list-installed-apps-android-8-0/", "google: for an open internet", "The packagemanager is used in launchers for example but they're using a different function.\n\nI think Nova is also using this for detecting if the Nova Prime dummy app is installed.", "That rule is only enforced on Android Police for whatever reason. Notice how all the other link posts on /top are all articles but not to the sources of those articles, and how all of them aren't AP", "Yeah, i know. Not blaming you in any way. Just annoying is all", "It's their own site for bug tracking ", "[deleted]", "Yes, and it's almost always drawn when it involves AP"]}, {"title": "Instant Apps break the PackageManager on Android 8.0", "comments": ["Just wow... This is a serious bug and Google should disable instant apps for Oreo devices until this issue is fixed.", "partyparrot", "I wonder if this also breaks checkSignatures. I've had a few users complain that after an Android update to 8.0 that my unlocker validation no longer works (which uses check signatures to verify my unlocker and trial have the same signature).\n\nDoes this issue effect 8.1 too?", "Wow, nice find.\n\nDid you mean `getInstalledPackages` besides `getInstalledApplications`? I can't find any `Apps` reference.\n\nMy app relies on `getInstalledPackages` to load extensions and it seems it's going to bite me. Sad :(", "As a temporary workaround I decided to show only part of installed applications instead of blocking whole [application](https://play.google.com/store/apps/details?id=com.sdex.activityrunner) for Oreo users with Instant Apps enabled.\nI get the list of activities and use package name to fetch applications. \n\n    Intent intent = new Intent(Intent.ACTION_MAIN);\n    List<ResolveInfo> ril = packageManager.queryIntentActivities(intent, 0);", "> I wonder if this also breaks checkSignatures. I've had a few users complain that after an Android update to 8.0 that my unlocker validation no longer works (which uses check signatures to verify my unlocker and trial have the same signature).\n\nI've not tested this.\n\n> Does this issue effect 8.1 too?\n\nAFAIK no. I can't reproduce it on 8.1.", "Typo, thanks.", "It's a good idea but only yields activities that match the intent. You could additionally query for services and broadcast receivers and merge the results, but it's still not 100%. In my case it's important that it is the full list of packages.", "Thanks. I'll try to test on a 8.0 emulator then", "You're right. I tried to get services, broadcast receivers and content providers. It adds a few apps, so I skipped them. \nAnyway, I am looking for better workaround. "]}, {"title": "Instant Apps: your experiences", "comments": ["I don't have experience as a developer. \nAs a user, my experience is not very good though. Loading screen, limited features... Didn't encourage me to try it as a developer....", "The most troubling issue I've encountered is that ProGuard doesn't automatically shrink your base module code with respect to the other feature modules. This makes staying under the size limit much harder.", "Started building one just the other day actually. 4mb is tight but as instant apps are supposed to represent a single feature, it actually just forces you to do just that, no extras, nothing unnecessary.\n\nWhen I was first researching Instant apps I wanted to find examples, and found these two:\n\nhttp://buzzfeed.com/tasty\n\nhttps://vimeo.com/71278954\n(Any valid video id should work on Vimeo)\n\nJust make sure you have instant app enabled under Settings > Google.\n\nNot sure about a public instant app from a beta release, but I'd be very surprised if you couldn't.", "It is really buggy at the moment.\nThe build process cannot deal with many resource dependencies. Results in very difficult to trace runtime errors. For example:\nUse include in a xml where the resource is from another module. Or reference resources from another module which in return also uses resources from the base module. And many more quite commonly used techniques. \nThe whole point of modules is to devide logic and its belonging resources so you can get small less than 4mb modules.\nNow you still end up with a large base module.\nWe managed eventually to convert one app. But it took us 6 months fulltime. We initially thought I would take 2 to 4 weeks.\nI have to say that Android made quite some improvements lately, but we are not there yet.", "Build a prototype for my workplace the other day. I like the principle but it doesn't work on my Pixel 2 XL (does on others), so i would not build any businesscases on instant apps yet.", "Built a prototype, and figured out that there is no way to make a file-download-like feature on rootless device (my app's one of the many features - download file directly from other device by link), you can download (to your internal storage), but can't send or share file to other apps, FileProvider is limited, fs permissions don't work, etc. Instant apps have too many limitations.", "[deleted]", "Also, it's quite hard to find examples on the store. I think vimeo had one at some point. Not even sure it's still enabled.", "Our app is currently in open beta and based on the documentation we can only have an instant app in an alpha version (that will require a link to try it). To have a production instant app, it seems that you need a production apk. You can't have an open beta instant app.\n\nAnyway, did you manage to release the instant app? Any spikes in installs / in-app purchases / user engagement after the launch?", "Thank you for your response. So, what's the verdict? Was it worth it based on the usage of the instant app? Did you see any significant increase on app installs or user engagement?", "Makes sense since they are still in an early stage. Hopefully, we'll have an update in the I/O. Thank you for your response!", "are you a developer or a product manager/owner?", "In my opinion, there is great potential in instant apps both to users and developers, however there are a lot of fixes and improvements that should be made first.", "I agree. It seems that not that many developers have tried building one, however, if the instant app works well it would be nice to have one.", "CastBox has an instant app.", "It still is and I'd say it works fairly well but seemingly no reason for it when viewing videos in the browser is just as as fast."]}, {"title": "Not sure how new this is since I hardly ever use instant apps but they show up in the suggestions bar after use", "comments": ["How did you get the small arrow on the search bar", "Wallpaper pls", "This happened to me too a couple weeks ago on DP2. It was also vimeo but I have never used vimeo or instant apps before so I was kinda thrown off. \n\nQuestion: Where were you when this appeared? I'm thinking it might be predicting based on location. For me it was at a school, not sure but maybe the school uses vimeo a lot.", "Put it on your homescreen and do a long press so you can get into app details. There should be a remove option.", "[deleted]", "It shows up if you're using any accessibility services.", "That's the Pixel launcher default app drawer ", "It was a picture I took while in Yellowstone National Park recently\nhttps://imgur.com/9DlKGvf", "Thank you. It's been a few days and it stuck around. At first I was interested but then it started getting annoying", "Nope, this is the recents/multitasking window. That bar is apps that Google tries to predict you want to open.", "It shows your main dock if you turn off suggestions in the launcher settings ", "It is? ", "If you turn on captions?", "He's talking about the little arrow which only shows up if you are using accessibility services.", "Another example of how amazing the pixel camera is also thanks!", "Oh when I was in the beta it was the same as my dock", "Not captions but accessibility services for apps you have downloaded. Some apps request these for their functionality. \n\nLike for example the app NavBar Apps uses accessibility services to get the running app and change the navigation bar color accordingly. Pie control apps use the services to emulate the back button. If any of apps have accessibility permissions enabled for them, you'll see things like the arrow on the dock.", "Actually that was on my Nikon D5100. I did get a very similar photo with my pixel however", "Ok thanks!", "Nice picture then I guess"]}, {"title": "Instant Apps: How is it possible to run an app without installing it?", "comments": ["Yes, they are an APK of max 4 MB size.\n\nSo it is installed.", "An instant app is a section of an app that can run without the rest of the app. It is as you say installed (but very quickly compared to installing the app entirely) and removed automatically (I think as a part of the Google play services). It's actually comparable to a website where you also download and execute code on demand (JavaScript), but with the benefits of running natively on the device, so all the sensors work and integration with stuff like Google pay is seamless. \nI personally think it's great. I've come across it a few times. For instance if you open an article of the NOS (national Dutch news company) from chrome you'll be taken to the instant app with the article. Compared to the website it has much smoother animations, the videos just open in landscape without much hassle and you get the option to install the entire app if you want to.\nVimeo I believe also has something like this.", "Just as an aside, they're increasing the limit to 10MB https://developer.android.com/topic/google-play-instant/\n", "Sounds like a security nightmare.  \nDo you know of any sources that discuss how this is implemented behind the scenes?  \n", "Not a bad idea considering 4 MB limit is very harsh :p", "There are limits to what you can do from an instant app, you don't have access to the full sdk. I believe that there are a few videos from IO that go into further detail. ", ">Sounds like a security nightmare.\n\nFar from it. You have to verify your website through [App Links](https://developer.android.com/training/app-links/) and sign your apks with same keystore as your main app. Checkout my detailed comment.", "I'm picturing being a user, and clicking on a link, expecting it to open in a browser - a browser that I've downloaded and configured to be very restrictive - but instead finding that the link installs an app without asking me.  Even without special permissions,  apps get much more access to the device, OS, and data, so that sounds like a security nightmare to me, or at least a privacy one.  The fact that the app is signed and linked to a domain doesn't necessarily mean the publisher is trustworthy.  "]}, {"title": "Question for devs with experience in Instant Apps", "comments": ["It took us a couple months to do ours, but we were also involved with the pilot program so there were a few bumps and changes along the way. Now that we're modularized, we have 3 features and every new feature is spun off as a separate feature module, it's pretty painless.\n\nWe would do it again in a heartbeat, we have an amazing use case for it and have seen a very large increase in users completing our flow vs mweb, so it's a big win for the company.\n\nDagger2, proguard, and 2+ features were the biggest hurdles for us. If your app is already relatively small, or you're only planning for one feature, or you don't use dagger...I imagine your time to implement would be much shorter.\n\nedit: spelling", "It took us almost 10 months. \nHardest part is dealing with the still buggy resource management. Features including resources from other modules is a pita.\nApp is now separated in 20 modules and around 15 features.\n", "Yeah we discovered that referencing resources from xml works across modules...but if you reference them from code it has to be within the same module. So each feature has a dupe_values.xml file where we put those resources that are referenced in code...but each resource in that file simply references the original resource that lives in a different module. The hope is that someday we can delete this file and never look back.\n\nAre your findings similar? What a mess.", "Unrelated to instant apps, yes. Throw in some databinging and kotlin and you're in for a good time."]}, {"title": "Dynamic Feature Modules vs Instant Apps?", "comments": ["https://developer.android.com/guide/app-bundle/#about_instant_apps", "What do you mean \"google going to prefer\"? I'm not sure what that really means.\n\nI don't think they are exclusive, and I think they will often have pretty different use-cases.\n\nI think that dynamic feature modules will make sense for most devs and companies.\n\nWhere-as instant apps will probobly make sense for some companies, but not most.\n\nThere's really no reason *not* to use dynamic feature modules (once it's out of beta).\n\nWhere-as instant apps are more of like \"demo\" apps or a tiny slice of functionality before they are forced to install.", "Will Dynamic Feature modules work if the app is distributed through somewhere other than the play store? ", "Thank you", "Thank you"]}, {"title": "Instant apps working for anyone?", "comments": ["I have try now buttons for both apps. I'm not aware of many instant apps that I don't just have the full app for, but I do know I've encountered a few while browsing and those worked like a charm for me as well.", "This game is fucking evil goddamn. Oh and the try now button worked for me", "I honestly can't see any reason why I would ever want this feature. ", "\\+", "Turns out that for me at least, it is working on some apps and not others. I tried it on Clash Royale and the Try Now button was present, in the Play Store, but for some reason this game, Paper Football, was not. Can't imagine that in the last couple of days since this episode of All About Android aired that the developer of this game took away the Instant App feature but I guess that's a possibility.\n\nAnyway, would like to hear if you guys have the same experience with Instant Apps."]}, {"title": "What are your thoughts on Instant Apps?", "comments": ["I've been working on Instant Apps for more than a year. In my experience, have them as goal driven and that goal must not be \"increase numer of installs\".\n\n&nbsp;\n\nFor example, a flights/hotels search app's goal could be \"Flight search and booking without installing app\". The user may not download the full app but the business will earn because of booking commision.\n\n&nbsp;\n\nYou can encourage your client by telling them (assuming they already have web presence and product pages) that people can search your products on google and immediatly buy with a few click with a great user experience. You can also tell them that for users having Google Pay enabled the process would be much faster. That will definitly beat the buying experience on mobile web.\n\n&nbsp;\n\nFun fact: my last Instant App stole 20% revenue from our mobile web division and ~30% Instant App users installed full app.", "My company was one of the early partners with Google on Instant Apps. It was a great experience working closely with them and it really set us on our path to modularizing our codebase (which has advantages beyond Instant Apps).\nThe 4mb limit is hard, but it's definitely doable. This helps you a lot even in getting the full app size down (we decreased by something like 36%). \n\nAs far as business case goes, we don't have a complete business case because of tech constraints. We would need other SDKs that would push us above 4mb and that keeps us from giving users a \"complete\" experience. It has definitely increased our installs! ", "That the 4 MB limit is quite rough. But I haven't worked with one beyond one that loads cats or dogs (sample code).", "I inherited a codebase that had been converted to use instant apps. From what I can tell, it destroyed the code base (though it might have been bad before hand).\n\nSo 1 year on we are still working on modularising the codebase so it is somewhat usable. It's been an enormous effort. We need to consider instant apps with nearly every decision we make and it slows us down a hell of a lot.\n\nI don't see people using instant very much so they do have potential to be a resource drain with little in return", "4 MB is not too bad when you get things modular and set proguard to 11 ;)"]}, {"title": "Unwanted Instant Apps advertised in the stock launcher? 2 XL", "comments": ["I think you have opened video somewhere in the web/reddit that was uploaded in vimeo. That's why you have the instant app in your launcher. Just go to your settings-apps and uninstall it.\n\nP.S. it is not an advertisement.", "You accidentally installed Vimeo's Instant App.\n\nTry this clip on Vimeo https://vimeo.com/190063150, and there will be link below to try their Instant App.\n\nIf you do not want any Instant Apps from creeping in, go to __Settings__ > __Google__ > __Instant Apps__, and choose __None__ to remove all instant apps and prevent any future instant apps from installing on your device.\n\n[Instant Apps introduction](https://www.pcworld.com/article/3234532/android/android-instant-apps-what-they-are-and-how-to-use-them-on-your-phone.html)", "I saw this exact thing happen to me. CBS app. I think I clicked on one article somewhere. It wasn't really \"installed\" but what the hell it was offensive. ", "Don't use Vimeo. Problem solved. \n\nDon't blame Google. ", "You probably have another App injecting that ad. Stock phone with stock launcher will not have any ads.", "Hmm. That seems like it might have been the reason for the intrusion. It just seems assinine to have instant apps installed just by visiting the website at some point. I don't use Vimeo ever, so maybe it was a video link on Reddit that I clicked that done this.", "I really don't like it. If I open a link to the one something I don't have installed, it should open the link in my browser not auto install some shit software. That has been my understanding of Android up until this point.", "Uh. I don't install apps for every website I'll ever visit. Imagine if someone was trying to not install Facebook and Messenger on their phone to keep it from draining battery. So they go to the Facebook website, but not they got Facebook installed just by going to the webpage. Seems to work like some some viruses.\n\nAlso, I can only imagine how many users will have their data shared that didn't want to. If a new app is \"installed\" , most people would simply click it to see what the heck it is. And thus permissions have been granted and now they are reading your contacts and uploading them to their cloud for marketing and to share their app either your contacts. All because something got shoved in your face ", "Is there anyway to see what placed that instant app in my app drawer?", "This is not an ad, it is a new feature which was introduced awhile ago. Instead of loading the web page, you get a tiny fragment of the full app just to view the content you want. You can disable this in the settings as someone mentioned here.\nThe general thinking behind this is that the web experience is a little bit worse than the app experience so you are guided towards the app, but if you don't want it, you can opt out. Personally I prefer instant apps to web pages.", "There might be. Start uninstalling some sketchy apps and games and see if it disappears."]}, {"title": "Android should bring instant apps to the play store", "comments": ["If I understand correctly, the whole point of \"instant apps\" is that you don't have to go to the play store to get it.  You can (I believe) use a web link (maybe on Hyatt's web site) to trigger the \"instant app\" loading.  ", "I didn't understand. Isn't Instant Apps already available?", "[there is a few instant apps on the store right now](https://play.google.com/store/apps/collection/promotion_300308f_instantgames?e=-EnableAppDetailsPageRedesign). Only game currently", "This is a feature that exists but there is just a handful of apps that support it", "Different strokes for different folks, isn't it why they made the instant apps available separately from the Play store.", "Try Hermit. "]}, {"title": "Jenkins, Jacoco, and Multi-Feature Instant Apps", "comments": ["Perhaps some more info?", "I have a jenkins job that uses the Jacoco Coverage Reporting plugin. We are building a multi-feature instant app and running unit tests against it, but the jacaco coverage plugin doesn't show that any of the methods have been exercised. When I run jacoco using gradlew on the command line the jacoco.exec files and the reports are not generated even though it doesn't appear there are any failures during the task.", "Thank you for the follow up!", "Would it be possible to share your project or an example project with the issue?  It sounds like you're not even running Jacoco at all, but it'd be hard to tell you why without seeing the Gradle.", "It's a private project for a large corporation. I can see if I can recreate it on a test project. Thank you."]}, {"title": "Fuchsia Friday: A system built for ‘Instant Apps’ on steroids", "comments": []}, {"title": "When using instant apps, they appear to stick (at least for a while) in the Pixel Launcher quick access", "comments": ["Oh, so that's how you remove it. I had the Vimeo one a while back and it was really annoying."]}, {"title": "Why does instant apps update itself from time to time?", "comments": ["Instant Apps settings are within Google Settings (of the official Google App). I have it disabled within the settings, but it still updates itself multiple times a day. \n\nWhen I had a package disabler app, it doesn't update if you freeze it. Otherwise there seems to be no way around it. ", "Instant apps no longer even work for me. ", "gotcha. thanks for the info.", "I noticed it today. I was using Opera browser and it force closedfor somereason. then I see instantapps updatingin the tool bar.. so it had something to do with opera force closing ? it never force closed an app before it had to update... just strange stuff.  I personally hate seeing instant apps update randomlyall the time. it kinda freaks me out..I can't even change the setting without rooting my phone ? that's sketchy right there. I'm going back to win phone lmao "]}, {"title": "I think instant apps don't scale well with multiwindows", "comments": []}]