[{"title": "What ever happened to \"Instant Apps?\"", "comments": ["I get the vimeo one if I click on a link from here. Haven't seen any other one. Works good because vimeo wants me to sign up all the time. ", "It's automatically being updated in my phone from time to time. ", "I only ever get it for vimeo", "I've seen it with the Dutch national news company NOS. They're pretty on point with Android apps, even embracing Google Assistant and Android TV.", "I've stumbled upon a few of them, but most of the time I think I'd just rather have the mobile site.\n\nLike most of Google's projects, I think we can assume it'll be forgotten and cancelled within a few years of its announcement. They have WAY too many app and web standards.", "My theory is it would not encourage people to download apps. Which means baddies like Cheetah mobile and Facebook would have less access to shit that has very little to do with the app due to temporary permissions only", "[deleted]", "The only instant app I ever see if for CBC News in Canada.  It delivers a basic HTML page, except there's a delay before it loads to let you know the \"Instant\" App is doing its thing - and then when you are finally presented with your news article, it's more or less a text-and-image web page, except it forces portrait mode, which is super nice because I always read in landscape mode and I love reorienting my phone for no reason.  It's like being poked in the eye twice while you're waiting for your content to be served up, thanks guys.", "I've got one or two as adds but never seen them since. ", "It's a lot of work when a site would rather get extra data given by a website or a full app download.", "It's a lot of work on the app side", "PWAs are pretty much the spiritual successor to instant apps.", "It's not available in all countries as far as I know and development is still problematic", "I see instances in the Play Store (mostly games) where you can try it before you download. I don't know if these are the same technology as Instant Apps, but the concept is there.", "I've had several pop-up. Vimeo is the most popular", "Why does Amazon feel so unpolished? Like their website isn't very good. The mobile app is clunky and slow. They are a multi billion dollar company and it's really bad", "[deleted]", "They're still around.", "They solved a problem that didn't exist.", "I was just on the play store the other day and they had a whole game section, where you could demo various games by using their instant app versions. ", "As a developer I avoid Instant builds because I want people to download my apps so I can earn a little money. I know it makes the file sizes much smaller but I can't afford for a curious user to preview the app and move on. \n\nI can see it being useful for certain types of apps, but it's not worth it imo.", "If you're brave and/or dumb enough, the Fox News site uses it. (Yes, I was being brave and dumb when I found out)", "Most Android users aren't on Oreo yet. It's a lot of work for engineers to retool their apps. Too much work for a tiny portion of the population. \n\nGoogle needs to get s better handle on their fragmentation. I wish they were more like Apple. Release and OS and it's everywhere in a few weeks. \n\nBut since we have to wait 2-3 years for any new features to be even remotely worth working on, we don't. Then, in that time, the feature is shown to be mostly useless by those developers who could afford to jump on, and no one follows suit. ", "Instant apps is still here,, just hard to develop for it --- also 4 MB limit (increased later)", "Like everyone else, I think Vimeo is one of the biggest sites using this feature.", "[AppScope](https://appsco.pe/) has an instant app store", "IMO instant app is for app advertisements. They let you interact with the app or game. And prompt you to download it and you have to play with it to close it. \n\nAnyway just my opinion, educate me!", "What a shame. This was one of the biggest features of the OS at the time. \n\nGoogle is really all over the place. I really want to switch from my iPhone to a Pixel but they make it so damn difficult. It’s like they’re purposefully saying “No no...not this year either. Stick to your iPhone.”\n", "It's just not that useful of an idea.\n\nFew apps provide much (any?) additional functionality over just a web browser unless you have an account. Even apps that *do* provide extra functionality over a browser, only really do so if the app is fully installed. You can't get notifications if the app isn't really on your device.", "It's kind of redundant when they have Progressive Web Apps.", "Instagram and Twitter have instant apps. They are initiated through chrome.", "Google happened", "It's Google, they have a hard on for deprecation.", "Google IO use it (under pain of death, presumably)", "I was just thinking about this. Why isn't there more? I'm still downloading apps for all of 5 minutes for certain uses every now and then. ", "I read and tried that if you pin mobile.twitter.com, it becomes a sort of an instant app, which is essentially an html wrapper, but it does not open a browser window, it works just like an app. What is that?", "The only instant app I've ever gotten was when clicking on a CBC article. I still do if I ever click on one but that's the only one I ever encountered.", "I know hotpads utilizes it. It was really convenient when I was apartment hunting. ", "I encounter the vimeo one all the time. It's kinda nice.\n\nUltimate guitar also has one. Their mobile site is purposefully designed to be hard to use. Lots of ads. It's zoomed in such that you have to scroll sideways to see the end of each line, and they disallow zooming in or out. Really awful, but I can force it to the desktop site and it's usable. However, the instant app is just as bad as the mobile site and there's no way to force it to the desktop site, so I hate it.", "Most of the instant apps I see, seem to be linked to news apps or other article reading apps. One thing I think it would be super useful for is food/restaurant apps. Now that there's so many of them, it'd be nice to have this functionality. ", "I got one today for the weather.com app.", "I get them periodically. Especially for the play store. ", "Wish (.com) was one of the first Instant Apps I used. It was cool, for what it was. I recently wanted to look on wish for something, only to find it required an installation now. I just looked on PC.\n\nAFAIK, they're mostly abandoned..", "They exist as trials in the app store, and those playable \"game\" ads", "For news sites AMP is easier and multiplatform so it's usually enough. I've seen some examples where it works really well like apartments.com but for the most part it's not worth the effort for developers", "I just recently enabled it on my phone, you might need to as well.", "Open the Google Play Games app and you can easily find a ton of them with \"try now\" buttons. They're shorter, free demos of apps on the play store with minimal loading time.", "I found it loathsome. Hopefully it dies on the heap of other forlorn projects.", "I was in the Google News app earlier this year and clicked on a link to a music news site. Instead of opening the webpage it loaded the instant app, problem is it didn't open the link I was clicking from Google news and instead just going to the home page. I would back out to Google News and try to open it in Chrome without any luck. Just skipped it.", "I actually just came across some instant app games on the play store. The one I tried played like those interactive games you sometimes see in ads.", "I've come across a few in my time. Jet.com was one and I think Twitter may have had one as well, other than that I've came across one or two insignificant ones I can't remember.", "I believe it didn't gain much traction because the development process was isolated. Although a very neat idea, developers didn't want to go through the hassle of maintaining the instant app separately.\n\nIn the latest build tools of Android whenever you're creating a new application you can make the same code base an instant app. So I guess moving forward we'll see an increase in instant apps.", "I'm seeing them pop up over time, It's only been a year. ", "> well, based on the comments, it looks like the answer is, \"Because it's a Google product. Thus, it has been abandoned.\"\n\nNo, there are perfectly validanswers in the comments that don't have to do anything with Google abandoning the project, one up voted comment even says it's regularly updated", "The Play Store app's settings screen on my phone doesn't even show me my account to enable instant apps.", "You've never come across those on reddit? ", "Hardly see them but I did stumble on one the other day on a real estate site, was actually pretty useful.", "There's a game. I believe it is called portal bridge. They offer you to try the game before purchasing using instant apps. It's super cool thought it was a good use of it.", "Took a few weeks, but I got my game, Genies and Gems, into one. There was a heck of a learning process for it. Lots of compromises to get it under 10MB. We'll probably revisit it later with different levels. ", "Was surprised to get the JIRA instant app when I clicked a link in an e-mail. Instant Apps could be useful if they would be a bit more popular/advertised.", "Did you try Appscope?", "It wasn't adopted much by devs, sadly.", "Now that Microsoft abandoned old Edge and is on board Chromium, perhaps these techs get more traction. Their best interest is to undermine native iOS and Android apps, as they have no control over them. Still they have their own app store that would benefit from more apps for Windows.", "They're still there. I get one for Vimeo a lot, and taxcaster by TurboTax has one if you hit try now in the play store. My mom gets one if I call her on duo. She still hasn't downloaded the app", "Vimeo and YouTube (shocker) have one. Haven't seen any others\n\nYouTube is especially annoying since I use Vanced and I get blinded by the white light in the web app", "is there no way to put a bookmark on your home screen with an app-like icon? I swear i did this once in iOS.", "CBC news does it.", "they are being used in ads. Play a free android game and you will get a bunch of ads with playable games. I hate them so much.", "I got it the other day for McMaster Carr", "There is an html5 or chrome kind of version of this still fairly widely in use. ", "The Canadian Broadcasting Corporation's news app is an Instant app. works great!", "cbc has one it is annoying.", "If you open Google play games, it will show some games and allow you to start them as instant apps. ", "To the point of everyone preferring mobile sites, AMP has been pretty good and game changing to the way we look at mobile sites", "I saw it being used for Play Store trials the other day. Angry Birds Dream Blast has a Try Now button that pulls up an Instant App.", "I don't think they've abandoned it, the Instant Apps app gets updated every once in a while, it's just that app developers haven't made them.", "There's a fair few, and it's used in the Play Store to try out apps too. Rodeo Stampede supports it, that was the most recent one. ", "I get it for Vimeo and CBC.  They kinda drive me nuts because there's no reason for them to not just use the standard web interface.", "There seem to be more of them in UK media company sites I visit.  The best one for me and the only one I have installed is the google image shrinker called Squoosh", "I found 1 game demo in the market that used it. It had the same quality as those tower defense games. ", "I saw one for a parking meter app. It was great. Never saw one every again. ", "Anyone can build Instant Apps.\n\n[https://developer.android.com/topic/google-play-instant/](https://developer.android.com/topic/google-play-instant/)\n\nDevelopers weren't interested.", "Its still here but ive only ever seen it with one app. So i guess it isnt supported well.", "I only had it happened once and it was a nice experience but the reason there are no more because lazy devs...same with Android Wear apps or other things...users had to beg the devs to make them. ", "CBC has one and I find them annoying. I don't want your app, bro.", "CBC in Canada supports instant apps", "Weather channel app has it. I love it a lot tbh", "It was a Google pet project that no one outside of its team cared about, like 90% of Google's new things lately.", "Are the Samsung Ultra apps the same thing or different? \n\nSamsung bundled the instant apps for Facebook, Twitter, Instagram, and Wikipedia into Samsung Max and called them Ultraapps.", "This is why I fear any new platform that Google announces, it dies a silent undignified death, I hope flutter doesn't go the same way,  killed for not gaining traction", "Weather channel instant app works pretty well ", "CBC.ca has it too", "[deleted]", "CNN app does it", "Stack exchange has one, it works well. ", "CBC does it", "Ultimate guitar uses it as it should", "I think Jira has one as well. It's been a while though.", "Test link for others (and myself) to click via Reddit on mobile: https://vimeo.com/8733915\n\nThis just loads the mobile site for me, am I doing something wrong? Oreo 8.0.0 tried with Relay for Reddit and Official Reddit app", "Same. Vimeo is the only instant app I've ever seen open up. ", "Does it work good or well?", "I strongly dislike the vimeo instant app cuz it takes time to set up.  Just let me watch the dang video.", "I check lots of news sites daily and only Fox News has an instant app", "Instant apps gets automatically updated? So, like PWA?", "Same, even if I have it disabled. So annoying.", "How's your Nexus 6 treating you?\n\nI had one a couple years ago, loved it. Unfortunately the charging port went out and I just never fixed it :(", "Yeah, NOS is great! I hope their management sees their innovatiness and doesn't boot them to cut costs. With NPO getting all the budget cuts and everything :(\n\nOh, if I'm not mistaken NOS also has a chatbot based on Watermelon Messenger in Facebook messenger.", "> most of the time I think I'd just rather have the mobile site\n\nIn principle, I agree.\n\nIn practice, I don't. So many websites have a deliberately shitty mobile site in order to push you to use the app.\n\nIt's infuriating.", "[deleted]", "Progressive Web Apps make them basically obsolete and useless to make.\n\nI wouldn't criticize Google for it not taking off, they tried to make something that would have improved UX a bit but ultimately wasn't worth developers time considering it's actually more valuable if the user has their app on the homescreen and PWAs can fill the niche of instant apps just as well except while being totally crossplatform.\n\nIt's also not exactly the same as Allo/Duo because the existence of instant apps is not as disruptive as many of their other cancelled services which imo makes it more or less fine if they cease to exist.", "Except for the core tech behind it is deeply integrated into the play store now, bundles are now the way most apps will be released, and I'm guessing a lot of apps will start making modules that can be downloaded as needed. ", "They just added additional support for Instant Apps in Android Studio 3.3. So it's not abandoned quite yet.\n\n> Android Studio now lets you build Android App Bundles with full support for Google Play Instant. In other words, you can now build and deploy both installed app and instant experiences from a single Android Studio project and include them in a single Android App Bundle", "They have a message that inbox is going away so and to switch back to Gmail, and I'm so sad. Inbox sucks at searching but it's so much better to look at and it's so organized. \n\nHate that Google abandons everything", "The point is to develop a single codebase that works as both a webapp and an installed app, rather than developing apps for half a dozen different platforms separately that have the same purpose.\n\nFor new projects that should *save* effort.\n\n----\n\nedit: Nevermind, I thought \"Instant Apps\" was another name for progressive web apps. Seems to be something else entirely.", "That's a valid point. It has to be worth the effort for developers / sites. Not just worthwhile, but value so compelling that it demands prioritizing instant apps over all the other things a company's engineers could be doing with their time.\n\nIt's a neat idea and a cool piece of technology, but that's kind of a hard sell when they already need to divide their efforts between a mobile site, desktop site, and two (Android and iOS) native apps.\n\nAnother issue is that you have to be able to separate out your app into pieces so that parts of them can be loaded without bringing in the other parts. If your app predates instant apps or just wasn't designed with that in mind, its design may not make that easy. So in some cases people need to do a rewrite or refactor of their code to even make it possible, which is possible, but it adds one more obstacle.", "An Instant App is a native app with limited permissions. I deal with React and Angular based apps constantly, and they are offensively bad. As an example of how much worse their UX is, they still don't use Android's networking APIs (because the underlying framework doesn't support it). [Here's the only reference to ConnectivityManager in the whole react-native repository](https://github.com/facebook/react-native/blob/794d2264f93b6eaeab4eb53c7d2eaf7880b89649/ReactAndroid/src/main/java/com/facebook/react/modules/netinfo/NetInfoModule.java). This means that every time your phone switches networks, they stick on the old network (even if it's a cell network and charging you money) until the OS kills their sockets. Then they tell the user that connectivity sucks and start reloading everything. If they are this bad on connection management, it stands to reason that the rest is just as horrid, and it is. It's hard to write a good native Android app. With these crappy web frameworks, it's easy to write a bad one and impossible to write a good one.", "Which is unfortunate, because the instant app would be much better to use in the vast majority of cases.\n\nWeb apps have become an affront to how the Internet was designed, and it's Google's fault.", "I mean, I would love to have a refined app-like UI for a lot of the websites I visit without having their app cluttering up my app drawer.", "Well, I'm really hoping Treble will help that.", "Those are not instant apps, those are Progressive Web Apps. It's a different technology. Which is probably responsible for Instant Apps not taking off as expected.", "It's a PWA", "Yes, but that's just a link to the website. I'm talking about the interface that appears once you reach the website.", "Realtor.com works too", "Just tried it, uses the browser for me. Weird.", "I was checking either battery or data usage and I noticed cbc app. I was like I never downloaded that. Clicked on it and it said \"clear instant app\"\nWhew. ", "No like the instant apps app itself. I get updates for it sometimes too.", "It has wireless charging", "It dies at anything below 50 percent if I do anything involving the camera other than that its been alright. I've read that replacing the battery helps its performance but I haven't tried yet", "Meanwhile the app is basically just a web client anyway.", ">In practice, I don't. So many websites have a deliberately shitty mobile site in order to push you to use the app.\n\n*cough* *cough* reddit.", "Well that is where PWA will change things up. ", "It's a machine learning concept in neural networks actually. You try many different variations, and see what works. Learning is done through trials and experimentation. ", "Isn't doing garage projects exactly what results in pushing out half-baked products and then giving up on them if they don't pan out?", "Yeah PWAs are different and I've seen a few of them that work quite well.", "One bad thing does not mean the rest sucks.  Not trying to say you are wrong, but your evidence is anecdote and single bad thing.", "[deleted]", "This was hugely illuminating for me.  Thank you for your perspective!", "Honestly, I really don't see a lot of cases where an instant app is really better. For Vimeo yes, because video playback doesn't happen inside a html5 player. But for content websites most of the time a mobile site is absolutely fine and the added load time is not worth it at all. Just an extra step to get to your content.", "[deleted]", "I don't understand, can you explain about the web apps bit? \n\nPS: if you don't want to, you can just ignore it", "Also, some apps are pretty terrible.  The Nextdoor app notifications were all broken and I would get dinged for stuff I couldn't disable.  Just went to the mobile site.", "I stand corrected.", "Ok thanks! I thought those were still running in a browser window!", "[deleted]", "[deleted]", "Ultimateguitar I think", "Tried and didn't work :(", "Through Google play?", "Yeah, but imo it's not practical for daily use. Plus I'd already had it for so long by that point I wanted an upgrade anyway", "Yeah, definitely replace the battery and calibrate it and it should go away. Weird that it has anything to do with the camera.\n\n", "[deleted]", "One of the very worst offenders.", "I may be biased, but I still like the old .compact interface", "Well atleast Reddit provides an API for almost all of its functions. There is no reason for anyone to complain about Reddit mobile site, or the official Reddit app, as there are so many good, ad-less, free 3rd party apps.", "[deleted]", "PWA? I don't believe I've heard of that. Could you enlighten me?", "Yeah. They'll kill the good apps and make us use shitty websites.", "This is the best explanation I've seen of how Google operates.\n\nI've said something similar (thought not as concise or tied to machine learning) for years. \n\nAnd the definition of \"what works\" includes \"what gathers the most profitable data for Google\".", "It's not the backend that shits the bed, it's the app, but more importantly, by the time the connection resets, it's already been terrible for an extended period of time, and apps don't get around it because they don't know how.", "Even the backend will still use sockets on the lower level. You just dont see it in higher level languages.\n\nBut the other reply hits the nail on the head. The app needs to switch between let's say mobile and and wifi. The phone broadcasts that its switching. React doesnt seem to do much if at all with that notification and continues on. Right up until the phone terminates the connection, causing the app to have a mild freakout while it retires. Where a proper networking implementation would handle the switch over much more gracefully.", "Oh, I know very well that the best solution isn't usually the easiest or most profitable one.", "More than half of web app functionality stops working if you go offline (usually).", "Care to elaborate on the hassle?? I'm an Android developer considering enabling IA for my app. Thanks!", "You out of Vancouver? ", "What is your opinion of your Android app?  I had it installed for years but the interface just was too cluttered and didn't work as well as I felt it should.  Swapped it out for Zillow that has a cleaner UI and just generally works better.  ", "Thanks, I'm glad some people enjoyed it, despite the headache that developing it was.", "Yes, I get those updates too and afaik there's no way to disable it. ", "It's only a guess because it dies in snapchat and when using textra  and accidentally clicking the send picture button. I've had it happen while using other apps so it could just be anything intensive. ", "Ding ding ding ding.  They're not giving you an app, they installing the ability to communicate both ways when you're not asking for it.", "Come join slide for Reddit\n\nOn Android and iPhone, free and open source ", "I use that exclusively on my phone.", "There is also a website, so you dont have to have yet another app installed...", "They don't expose chat through the API", "You talking about when Facebook went full HTML5 on there app and it was slow and crappy?", "I'm assuming he's talking about [this?](https://developers.google.com/web/progressive-web-apps/)", "Additionally Google accepts failures because it is better for them. If you can just fail and move on when the project you are on isn't being successful you stop wasting resources. If you feel like you MUST keep the project going then you burn up resources keeping the project alive.", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "Would love to see a blog post about how you did it.", "or Joey. I've tried several clients but this is the one I like the most. Active developer and it's free. Check out /r/JoeyForReddit ", "If reddit search function wasn't pure garbage maybe I would use the client full time.", "[deleted]", "Man, I literally forgot that even existed. ", "Thank you. I've never seen that written as an acronym so my mind didn't make the connection.", "Angular only works properly in Chrome. Just try to use YouTube in another browser.\n\nThe app store is the better model because Angular is making HTML do something it wasn't designed to do. It also makes your web browser into the app store and commercializes the idea of a domain name.", "Love buddy! Thanks for the heads up!", "Why exactly was migrating to kotlin a problem with IA?", "Cool, just saw a presentation on your company at a co-op related thing. ", "One thing I've liked about zillow is that it starts on the map page and the listings refresh as you pan around the map.  On Realtor, I'd often need to take extra steps to get there and then keep hitting \"search near me\" to get the listings.  I only really use the app to check out listings as I walk by them, so the zillow apps is perfect for that.", "Same here. But tbh I wished that Karma Machine and Dash for Reddit are further developed but both devs bailed for reasons. \n\nI seemingly have liking to slide focused interface. ", "Get out of here sync is for the true kings", "[deleted]", "[deleted]", "[deleted]", "Between web browsers implementing dark theme overrides and accessibility concerns, maybe. I don't know, I do like CSS.\n\nJavaScript needs to die though.", "whooboy, i was under the impression for some reason it was ~100K. I'm going to have to start using proguard when i go for IA...", "Interesting...I'll give it another look", "[deleted]"]}, {"title": "What happened to Instant Apps?", "comments": ["I think there has been about 3 apps I total that I was surprised were instant apps. Whatever happens to slices for that matter. Now that seemed like an amazing idea from Oreo or Pie and never went anywhere..", "[deleted]", "So I actually did play around with it. In the Google Play store at the time it was under a section named \"try before you buy\" or \"Instant app\" or something. The selection was real small and essentially it really reminded me of those ads that have you play a \"game\" but to me it seems like pre recorded images & video made to look like what the game would play. For example they had CSR racing and the racing graphics looked look a pre rendered low res race. Stumbling on this post I did a quick search on the store and now I can't really find it. Maybe they quietly took it out? There weren't that many games for it.\n\nEdit: I think I found it! Go to the play store and for me just scroll down on your \"For you\" page. The section labled \"Game Demo - Try now, install later\"", "The dev who coded it up got promoted and moved on to Google docs. Now there's a couple of interns fixing bugs.", "Ultimate Guitar had / has an instant app that was complete garbage. When you click a link on FB or whatver to an article, it would open the website as an instant app at the web site's homepage and there's no way to find the article.\n\nVimeo's instant app was okay... But I found a way to turn instant apps off (I don't remember how) and never looked back.", "It's clear that Instant Apps is now really pushed yet on the Play Store. I was at a Google event recently (Google Playtime 2019) and I participated in a 1:1 session with the Instant app team, so the subject is not completely forgotten.\n\nThe Android developer website provides a list of instant apps available on the store: [https://developer.android.com/stories/instant-apps](https://developer.android.com/stories/instant-apps)", "I don't think there was any real advantage to them. The only times I saw them used was to replace the mobile version a website with it's app and that was limited to newsreaders. I think those game ads where you can play the game instead of just watching a video used this technology but I'm not sure.", "I found my first one recently! https://play.google.com/store/apps/details?id=com.double_rhyme.hoenickf.doppelreim", "lol completely forgot about Slices", "Wtf was slices?", "In Canada we have our new site called CBC, any time I click a CBC link it's an instant app, and it's awful", "That's not the same as Instant Apps. Instant Apps is opening a section of an app you don't have installed on your phone, letting you use most of its native features with an option to fully install it if you want to. What you found is just streaming a game.", "This xkcd is for you\n\nhttps://xkcd.com/869/", "Basically a way export views from an app for reuse in other apps, in an integrated manner. Like a simple generalized addon API. For example to use with maps or similar objects.", "Turn off instant apps", "Actually, the \"try before you buy\" feature of Google play is in fact implemented with instant apps, it's just that lots of games half ass their instant apps & make them 480p demos for some reason.", "Yaasssssss!", "How do you turn them off?", "There's a toggle in the Play Store settings"]}, {"title": "I accidentally opted out of instant apps, and now I dont have the option anymore. Any way I can get the prompt again?", "comments": ["Go to settings>Google>Google Play instant. In this menu you can set your preference for instant apps.", "guys sorry for silly question , but what i get from instant apps?", "Wow you're right.", "In my case I wanted to try a game from play store but only a paid version was available. With instant app there will be an option to try that game :)", "In a way basically you can use apps without installing them.  \nFor example alot of facebook games can be downloaded onto a phone (wasting memory), with instant app when you want to play the game google temporarily installs it onto your phone, when you exit the game the game is then cleared of memory, not wasting memory anymore.\n\n&#x200B;\n\nTL:DR - [Google Support Page](https://support.google.com/googleplay/answer/7240211?hl=en)", "Is this region locked? I don’t think I’ve ever seen this prompt at all. Ask I checked the settings, and have it enabled already. ", "Sorry friend, quoting google support:\n\n> If you do not see Instant Apps in Google settings, then it is not yet available on your device. \n\n&#x200B;", "Suspected it is something like this. "]}, {"title": "Instant apps", "comments": ["You can connect your phone to a PC and use ADB to disable most apps.\n\nI'm not the best at describing how to do it, but there are plenty of tutorials online on how to do so. It sounds daunting but it's really not bad", "Sorry. I thought you were meaning the apps included on install, misread.\n\nIt is possible though, I guess. Might be worth researching", "There is a setting in Google play store settings. Under user controls called Google play instant", "Even instant apps? They're not installed so would it work?", "Thanks, I'll try to figure something out I guess..", "Thank you!!"]}, {"title": "Instant apps", "comments": ["Rather than trying to uninstall the app just disable the feature. Open the Play Store app and then go into the settings. Then click on Google Play Instant and on the next screen select None.  ", "It's already on none yet it still downloads.", "Then it is not an instant app.   \nThere are (were) permission, that let your OTHER app install a 3rd party app on your device.\n\nWould be easier to help, if you support the device, the OS version and app installed in this way.  \n"]}, {"title": "Everything They Don’t Tell You About Instant Apps and Dynamic Features #1 — Problems with your Dagger setup", "comments": []}, {"title": "instant apps", "comments": ["D'ya know, I switched this on across all my devices ages ago, but I'm not certain I've ever seen the thing in action. Maybe it was that good and seamless that I just didn't notice 😃", "I know Vimeo has it supported!", "I thought it was dumb but now I'm revisiting it because it makes more sense not to install an app that requires an internet connection to begin with in order for it to function properly.", "I admit, this would be useful for things like Facebook Messenger, as personally I'd not want that laying around on my phone running in the background."]}, {"title": "\"Google play services for instant apps has stopped\"", "comments": ["Find the play services app in your settings and clear it's cache / uninstall updates. \n\nThen let it re-install when you launch the playstore.", "I had some bs app called \"Google play for instant apps\" on my phone that I was able to uninstall. How do you clear the cache for an app again? ", "if it's an app, should be the same way mate, \n\nYou'll need to find the name for it in the apps menu, \n\nSettings > Apps , then click on the 3 dots at the top right and choose \"Show system apps\"\n\nThis will give you everything."]}, {"title": "Google Play services for Instant Apps 5.18-release-279768875 by Google LLC", "comments": []}, {"title": "How do I know which Instant apps are being updated? Vodafone VFD-1400 Tablet", "comments": ["It's probably just updating the system components on which Instant apps run"]}, {"title": "Google Play services for Instant Apps 5.20-release-283752464 by Google LLC", "comments": []}, {"title": "How to disable Instant apps?", "comments": ["open the playstore app, goto settings, there's an option to disable.", "I see in the options it says\"google play instant\" but when i click om that there is only one option and it says \"upgrade web links\" and that option is off. I dont see where i could disable instant apps entirety.."]}, {"title": "Google Play services for Instant Apps 5.16-release-275011254 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.19-release-281410330 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.18-release-279768875 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.14-release-273642347 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.04-release-259736417 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.04-release-259736417 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.18-release-277485328 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.19-release-281410330 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.12-release-269882371 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.17-release-276256316 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.19-release-278877137 by Google LLC", "comments": []}, {"title": "Instant apps, cloud storage, AR, AI trending in mobile development", "comments": ["I though Instant Apps was not getting much traction - and could wind up being one of ideas that are thrown up to see what sticks, and dont stick."]}, {"title": "Google Play services for Instant Apps 5.17-release-276256316 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.09-release-265904812 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.18-release-277485328 by Google LLC", "comments": []}, {"title": "App My Site’s no-code app builder : Helping WooCommerce Websites to Build instant apps", "comments": []}, {"title": "Google Play services for Instant Apps 5.20-release-283752464 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.13-release-271119648 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.16-release-275011254 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.07-release-263347321 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.05-release-260954178 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.08-release-264587951 by Google LLC", "comments": []}, {"title": "Updating \"Instant Apps\"", "comments": ["Instant apps is usually preloaded with other Google apps (either Google app itself or Google play services). It's not something to be worried about. The feature is meant to be for convenience. Say if you see a news article link in your Google results, if the website supports it, they can load an instant app (very barebones versions of the official news app) instead of the webpage itself. So you'll have an \"authentic\" app experience rather than having to deal with a slow website.", "Ah, that explains it well, thanks. I never noticed how important Instant Apps are."]}, {"title": "Google Play services for Instant Apps 5.08-release-264587951 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.02-release-257400184 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.09-release-265904812 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.10-release-267133434 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.14-release-273642347 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.10-release-267133434 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.06-release-262201536 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.02-release-257400184 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.06-release-262201536 by Google LLC", "comments": []}, {"title": "Android app services (Instant Apps, etc...) keep crashing", "comments": []}, {"title": "Google Play services for Instant Apps 5.11-release-268438026 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.0-release-253977708 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.03-release-258564291 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.06-release-262201536 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 4.24-release-251657223 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.07-release-263347321 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 4.20-release-247208645 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 4.23-release-250634058 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.0-release-253977708 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 4.23-release-250634058 by Google LLC", "comments": []}, {"title": "AppOnboard gives away tool that lets developers create instant apps", "comments": []}, {"title": "Google Play services for Instant Apps 4.19-release-246143591 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.03-release-258564291 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.01-release-255168202 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 4.18-release-245065062 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 4.23-release-250967274 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.13-release-271119648 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 4.11-release-237028920 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 4.24-release-251657223 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 4.25-release-252820199 by Google LLC", "comments": []}, {"title": "Instant Apps - How it Makes a Difference?", "comments": []}]