[{"title": "AppClips sighting—first time I’ve seen them in use", "comments": ["Mobil gas stations seem to be adding AppClips to be able to pay at the pump (instead of NFC). This wasn’t there last week, and is the first implementation I have seen of them.", "Did tapping this pull up the wallet app?", "Cool, I think. No idea what that is entirely, but what happens when someone makes a sticker very similar to that, sticks it on a pump, you think you’re buying gas, but you’re not, you’re paying some scammer? Legit question (and I might be a moron about this). I’ve never heard of App Clip.", "I can't believe Illinois is at the forefront of something for once.", "It seems to work for Tiktok links in iMessage now too! Just noticed this yesterday.", "[deleted]", "I have a Siri suggestions widget and I saw a recommendation to download the Subway app clip as I passed a Subway", "But how is this better than the NFC terminal that accepts my Credit Card, iPhone and Galaxy?", "I started seeing them around my small town near the boarder of Illinois and Wisconsin! I unfortunately already had the app but it did activate for me!", "I honestly forgot all about this...", "When I updated my iPhone X to iOS 14, I remember seeing an App Clip thing for my Control Center, but it’s now gone on my Control Center on my iPhone 12 and I can’t find it in Settings. Did I just imagine that lol ?\n\nAnyone want to explain how this actually will work? Do I use the camera app like QR or do I just go near the sumbol with my phonr or what ?", "Found an AppClip at Target in the Apple Gift Card holder, and when you put your phone up to it, it brought up an online version to buy one.", "Is this Apple’s version of QR code or NFC ?", "What kind of secret mayan calendar code is this?", "I wonder if the pandemic has halted the deployment of AppClips a bit. Not that I expect them to become a major thing.", "Remember when you couldn’t use a cell phone while pumping gas? Pepperidge Farm remembers...", "Can’t wait for them to come in Bulgaria..", "That’s a unicorn here in my location!", "I’ve never seen one before in the uk", "This submission has been randomly featured in /r/serendipity, a bot-driven subreddit discovery engine. More here: /r/Serendipity/comments/knrsvx/appclips_sightingfirst_time_ive_seen_them_in_use/", "Do these little clip things require an NFC as well as the qr-like code?  I ask because my camera app picks up the App Clip code in the image but it says there is no related info.", "Can’t wait until these are widely available in Canada in a couple of years", "I don’t think this is the ideal use case. If you want to do payments you could go with an NFC tag, QR code etc. the whole point of App Clips is to provide the functionality of a full fledged app without requiring you to download. It should enable you to do things that you’re phone can’t already do because, presumably, you haven’t downloaded the app. Payments is not one of those.", "Wish we could have these in Poland...", "The valero gas stations near me are hit or miss on allowing Apple Pay and when they do I still have to put in my zip code on the keypad. I guess they are still trying to figure out what contactless payment means. These might be cool if it solves that problem. I know many companies don’t want to enable Apple Pay since they have a higher merchant fee and they don’t get as much customer information.", "For me it launched the ExxonMobil Rewards app, which allows you to select pump and ApplePay in the app. It’d be easier to just tap and pay but this is probably more affordable if the pumps are older. \n\nI found this during a quick Google search (there was a G Pay sticker further down). [Digital Transactions ](https://www.digitaltransactions.net/exxonmobil-deploys-qr-codes-and-nfc-tags-for-streamlined-mobile-payment-at-the-pump/)", "the scammer would need an app on the app store that undergoes apple review before being published. they would easily get caught and they wouldn’t be able to make an app clip.", "They launched with iOS 14. Basically, it allows you to tap your phone and it get a miniature version of the app, temporarily, to (in this case) pay for gas. This would allow you to pay without downloading the full app, sign in, etc. that would take time. \n\nIf you have the app installed that it wants to use, it launches that app automatically. \n\nIn the case of gas pumps, it is definitely slower than just tap and pay but it works and ties in with ExxonMobil Rewards.", "You guys have been the leaders in corruption for almost two centuries!", "Still digging out from last nights snow and ice, and getting ready for Friday’s storm 🥺", "I didn’t know that would be a thing, lol. Kind of cool, kind of annoying.", "That one is probably location based.", "The merchant can use the app to upsell you other stuff. No idea what the consumer gets out of it. Also it eliminates non iPhone users so I assume anywhere implementing it will keep standard nfc payment too.", "You still have to interact with and pay through the terminal. With the app you pay through the app.\n\nScanning it opens the app then presumably either takes you right to the payment screen, or goes ahead and preauthorizes the payment with saved settings.", "We might have the same stomping grounds, lol.", "Ditto—I think it definitely has some good use cases I just wonder how many people will actually utilize it.", "NFC is always-on on iPhone XS or later, unlike in iPhone X and below where you have the manually turn it on via control center. If it’s a code, you use the camera for all iPhone models.", "Pretty sure that’s on Bulgarian devs", "I think you are missing the point here. \n\nFirst of all AppClips are NFC tags or QR codes (both standards are supposed). The idea for using AppClips as payment method is something that Apple itself [is promoting](https://developer.apple.com/app-clips/) and I think it makes sense because you then have access to Apple Pay. Sure, you can pay with Apple Pay on website too but AppClips are not much bigger in size compared to modern website and end user should feel more secure (it is an app on AppStore, not random website he visits to pay for something). Additionally compared to simple website an app like that can give additional functionality. For example let’s say you could pay for parking like that. Notification when your time is about to expire would be supper easy to implement. \n\nTL;DR\nAppClips are not full apps and are much smaller but can add additional functionality compared to standard websites. Payments is great example of use case for AppClips (even according to what Apple says).", "> I know many companies don’t want to enable Apple Pay since they have a higher merchant fee and they don’t get as much customer information.\n\nFirst, you’re correct that they don’t get as much customer information. But are you sure you want all your personal data to be involved in a data breach? No! I didn’t think so.\n\nSecond, the merchant does not pay higher fees for processing Apple Pay. In fact all tap transactions, whether it be Google Pay Apple Pay or your physical card actually cost less than swiping a card. The fees that Apple takes (varies by country) come from the Bank, since:\na) There’s less chance of card fraud. You have to authenticate your iPhone with Touch ID, Face ID or Passcode, prior to payment, compared to tapping your card and simply paying.\nb) The banks hope to capture the small purchases using your cards now. Since you already have your phone in hand, why not tap your phone for that coffee or sandwich, instead of finding cash.", "This is super interesting to me! Here in the UK, Apple Pay seems to be a given when using a card machine, and where contactless is accepted (99% of the time), Apple Pay just seems to be an extension of a regular card NFC.", "Meijer, Speedway, Loves, Costco, and Circle K are all the same for me when it comes to contactless—always requiring a zip code. What’s funny is their app allows Apple Pay, but I’m sure they’re still collecting some other information that outweighs just implementing typical tap to pay—plus not having to update pumps.", "When I’d do concerts (merch) everyone used a card. That was unless of course it was at the Greek in Berkeley where every kid had an iPhone. Dude, it was brutal. The machines we had for payments didn’t do them right so every night we’d have one or two entitled fuckers who refused to leave the line til I fixed it... yeah I cannot create a working pcb with Apple Pay behind this counter full of shirts you dickhead. I always wondered (and asked) why they wouldn’t just upgrade the POS to accept it, their reasoning was “to expensive” but by my math we’d lose upwards of $1k a night so, don’t think they really thought that shit through. \n\nAnd with that said, the kids at if Berkeley were either super pleasant and kind or the complete opposite. I hated working that venue but did it for the money and also the view... the Greek is a gorgeous place for a show.", "So you were at a Mobile station?", "Gotcha, that’s the info I needed to understand. Thanks, makes sense.", "thanks. that explains it", "I don’t get it, because they could tie ExxonMobil Rewards in through Apple Wallet, too.  Like when I buy a sandwich at Jimmy John’s with Apple Pay, it automatically triggers my reward card.  No launching any app required, and quick.", "Yes but it’s Chicago’s fault to be fair.", "Hey now, our current and last two governors haven’t gone to prison (yet).", "Kind of creepy.", "It means you can use portions of the app without installing.", "Maybe stuffs different in Canada, you just tap the NFC before pumping gas, and it totals the bill after your done, no interaction with anything", "Richmond?", "I honestly think it's completely stupid and backwards. Instead of using something universal like QR codes or NFC, Apple created this and locks it just to iOS users which limits it's usefulness.", "Well I have to disagree with you about the fee.  Apple Pay charges most merchants around 2 to 3% processing fee, while for large merchants they can often get their processing fees to under 1% through their acquirer for their Visa/MasterCard/Discover transactions. That is why major retailers like Walmart and cvs initially resisted Apple Pay. It is similar to American Express, they charge higher fees than visa and MasterCard which is why some mom and pops won’t take American Express.", "We are so far behind on NFC, but it has been expanded greatly in the last five years. More often than not NFC isn’t available, and it still seems like a novelty at some places. \n\nThe gas stations I use (this Mobil included) just started rolling out chip and pin at the pump in the last year or two (this Mobil station was in the last six months).", "Yeah, America is a little behind.  We also don’t use Chip and pin for our credit cards as chip and signature is the standard.  That is part of the reason card fraud is higher in the US. I thought it was cool in Canada when the waiter brought the credit card machine to the table to process the charge rather than taking the card to the back of the house.", "Here in the us at places I go they generally accept Apple Pay, except for Walmart and many sit down restaurants. Instead Walmart pushes their Walmart pay option which I absolutely have no intention of ever using 😂", "Yeah same. Not sure what’s with the US. Not sure why the merchants feel the need to process the card information when for most of the world, card payment is handled by the bank.", "Correct. But it sounds like it is rolling out to all Exxon and Mobil stations from an article I found.", "I’d prefer that option, and the app takes time and a solid data connection. It takes time—you have to select your pump and if you want a car wash. I usually do it in my car when it’s cold out and it is more secure versus a card swipe and faster than all of those menu screens (receipt, car wash, rewards card, zip code).", "I think it's the Midwest in general. I live in Cincinnati and we just had two city council members arrested on federal bribery charges this year alone.", "Nope. Not true. \nMerchants (eg. Walmart) directly work with Processors (eg. Global Payments, Chase PaymentTech, Stripe). These processors determine the rates set for each transaction, and each type\n\n-Card Present Swipe\n\n-Card Present Chip Insert\n\n-Card Present Tap (including Apple Pay)\n\n-Card Not Present Online\n\n-Card Not Present In-Person.\n\nMerchants have the ability to negotiate these rates with Processors. The Processor passes on the fee, less a markup to the bank, who then keeps the fee and passes on some to MasterCard/Visa/Amex.\n\nThe core difference is that where Apple Pay is used, the bank has to pay out more funds, 0.15% to Apple and the same cut to MasterCard/Visa/Amex.\n\nSo really the banks are taking a 0.15% hit in exchange for potentially higher transaction volumes.\n\nThe merchant still pays the same negotiated or stated fee per their agreement with the processor. \n\nYour information is inaccurate, I can tell you that my data comes from being a merchant myself.", "Don’t you guys still use cheques quite frequently too? I can’t remember the last time I even saw one of those…", "I would love if apple built a search function into wallet. Like, if I need gas I can search in there and it’d show me stations near me that accept Apple Pay. So sick of going somewhere and their tap to pay system isn’t working for some unknown reason, or they just don’t have it. I still have been using my cards for the most part, which sucks. I’ve been part of 2 data breaches in the past and had to level change my cards to protect myself. That’s just anti-consumer. I would love a quick and easy way to find places that want my secure business.", "Signature?! Yikes. We phased that out decades ago. Any idea why the US still use it?", "For what it’s worth I’m on the east coast of the US and haven’t used chip and signature in years. It’s all chip and pin or Apple Pay. That’s just my experience though. I’m within an 1.5 hours of DC.", "I rarely ever shop at walmart because of this. I’d rather use apple pay as it has the added security and am willing to pay more by shopping elsewhere.  Hear about too many data breaches.", "This explains the 3% cash back offering on Apple Card that recently showed up for Exxon and Mobil.", "[deleted]", "Gotcha", "> if you want a car wash\n\nFound the answer", "Nah it is government in general. It attracts criminals in suits.", "Lol, they have fallen out more and more over the last 10-15 years. My parents still use checks to pay bills if sending in by mail or paying people in person if they don’t have cash, but I rarely see it happening in stores anymore (I have a check book at home but haven’t used it in years, especially after Venmo took off). Honestly I think they’re mostly in use by the older generations.\n\nChecks are just spotty and slow to use—some places don’t accept them at all and at others you hold up the line if you do use them and feel like an a**hole.", "I just got 3 checks in the mail for Christmas from older family members. Probably will for the rest of their lives! At least I can deposit them to my bank account via my cell phone very easily.... but yea checks are annoying", "As a Brit not long  back from three years living in the US, the slower/inconsistent adoption rate of electronic payment was mind boggling to me.  Here’s a country noted for it’s tech industry, and yet I still had to pay my rent via cheque(check) and contactless or even chip & pin still not as widespread as it should.  Coming back home to the UK and instantly setting up all my bills using the Direct Debit system, and being able to use contactless via card or phone pretty much everywhere, was like fast forwarding twenty years into the future.", "IIRC it has to do with legacy hardware being used by merchants that can’t accept pins and the acquiring banks willing to accept signatures rather than pins.", "I always got funny looks when traveling in Europe and using my US MasterCard w/ no foreign transaction fees. They never expect you to have to sign afterwards and especially if the person at the register is unfamiliar with US cards it causes some confusion. \n\nI actually missed a flight in Ireland once because it was like a 7am or 8am flight on a Sunday and no gas stations were “open” so you could only pay at the pump. The problem with that was I hadn’t set up a pin for my credit card so I couldn’t get my rental car gassed up at the first 3 places I stopped and for some reason my app wouldn’t let me set one up. \n\nIn hindsight, it would have been much cheaper to just pay the fee for not gassing up lol but I thought I could still make it. The second I got my new card I created a PIN and it works perfectly when you’re abroad. \n\nThe only place that has asked me for a credit card PIN in the US is the self-service kiosks at the post office.", "Are you using a debit card or did you have to request your card to use a pin?", "I saw the sign there earlier this week promoting this and was surprised they went from marketing their own ExxonMobil credit card to promoting the Apple Card. Makes more sense now with these tags coming out.", "There are stations branding with both names?\n\nExxonMobil is a company with two separate brands.", "At certain point it almost seems like organized crime with extra steps.", "The only time I ever use checks is to pay my shitty utility company who charge a \"convenience fee\" to pay by credit card. They want you to give them direct access to deduct from your bank account but they're such fuckups I wouldn't trust them, so they get the cost of processing a paper check. Totally pointless gesture but it makes me feel better.", "Ah, they’re so uncommon here that I don’t know of a single mobile banking app that can cash them. I can take them to the cash machines outside my bank and cash them in there though.", "Credit and debit but I did set up a pin on my credit card.", "Precisely what it is. Organized crime with the moral authority for their crime and a monopoly on violence via police.", "Love the way you think. I try to stick it to utility companies cause they do the same thing for me. Except, even if they had a check they have all the info they’d need to access your account (account # and routing # are both at the bottom of the check) I’m pretty sure. Oh well, less convenient for them haha my favorite is that I have a utility that charges a “convenience fee” to deduct funds same-day from my account. As if that’s not more of a convenience for them than it is for me..", "You can deposit checks into your PayPal account as well.", "A monopoly on police. I don’t think that’s said enough.  Like all get that that’s an issue but I don’t hear that statement enough.", "[The Monopoly on Violence ](https://youtu.be/XWAEKQjN-yM)"]}, {"title": "iOS 14: 'Phoenix 2' Space Shooter Delivers Playable Demo via App Clips", "comments": ["Wow that was interesting. I just played a 30 second demo that actually felt like a game.  In a way it was sort of like those ads you see on freemium games where you play a quick game in order to get past the ad, but a whole lot better quality, it actually represented the game and I could quit at any time.  This might be a game changer for people who want to create demos.", "I thought App Clips were kind of a goofy feature as they were presented, but if they become a standard way to demo apps then they could be the best feature of iOS 14.", "I think it’s a bit annoying that the App Clip itself gets saved into your App Library. I don’t want to have to go in and manually delete it. Shouldn’t it be ephemeral?", "Their app clips looks good, I’ll try to support every app that has app clips as long as I can to hopefully made app clips mainstream.", "that was pretty cool, not gonna lie", "That was a really interesting experience. Makes me wonder why App Clips are not accessible through the app store? Or is it and I'm just missing something?", "Ok that was very impressive and way more than I thought clips was capable of so much so that it felt like a full game", "Very good game.", "Hmm I get the message saying couldn’t connect with helper application", "This is going to sound stupid but how do I get an app clip to appear?", "App Clips will become such a useful feature with time! It's much better than the implementation of instant apps in Android. Much easier to try out certain apps since you don't need to open the App Store and look for the app (using a QR code or NFC tag is much more practical).", "That was pretty cool I’ll admit.  I am the same as one of the other posters and believe most apps nowadays; especially games, suck.  \n\nHowever; if I am given the chance to instantly play a small bite like this of cool games to see how they are before paying full fare I’m in.  \n\nI’d have never given this game a second look on the store and already 10 seconds in I knew I would be getting the app at the end of the demo.  I’m fairly certain I’m not the only one who picked it up just because of this little feature.  \n\nThat being said I think it will now almost be expected for devs to have them since it has blown up in the news and this game has set the bar for what is possible.  I think this can only be good in the long run as it will force devs to put out a better quality product.  Nobody is going to buy/download the final product if the app clip demo isn’t stellar.", "i feel the 30days autodelete is too long and it should be 7 days", "Very interesting implementation. I tried it, and hadn’t it been for App Clips I would have never even bothered. Hopefully more will follow.", "This game is dope on its own as well.", "I understand that app clips was originally designed for apps other than games to allow for quicker and more convenient actions, like payment, ordering food or for renting soemthing etc. So it makes sense that some app clips should be available on safari or the web to allow users to quickly scan a QR code and get to that app clip.\n\nBut if an app clip of a game is available wouldn’t it be more convenient and probably intuitive for users to discover that game on the App Store and load the app clip immediately right from the App Store instead of hearing about the game and going to the devs’ website and play it from there? I don’t know just my two cents though", "Just tried it out. I think I’m sold on App Clips now. Really neat feature.", "Once you don't want an App Clip anymore, remember to delete it on Settings > App Clips\n\nhttps://support.apple.com/en-us/HT211546", "First thought after I loaded it up - *They fit all of that into >10MB?!*", "That was, glitch requiring me to tap retry aside, pretty awesome! Sure, game controls felt slow to me marring that experience, but it was in all pretty good.", "Nice, I’m sure it will blow up, one of apple’s strengths is they do know how to introduce a feature, for example arm macs and Big Sur vs windows on arm", "impressive", "I’m hoping this replaces some of the “open in the app?” nag popovers we see around the web.", "Didn’t work for me :/", "The experience is wild. You go from reading about the app to fill on immersion. This is a brilliant way to boost downloads.", "Huh? Phoenix 2 is free tho. Why not just download the game?", "This is pretty cool hope it grows. No sound though?", "That’s a cool use of the feature, and the first I’ve personally seen or used! Can see this being beneficial for a developer to use to demo their game, could increase sales I suppose!", "Hello", "This should definitely be standard for demoing games on iOS.", "Any other App Clips sample? The Phoenix 2 Demo is very smooth, i thought it would be like ads game.", "that was amazing!", "Tried it, and it is pretty awesome.\n(I’m thinking this may also lead to the future of mini-game advertisements...)", "While neat, I'd rather see a solution to stop the subscription epidemic.", "I wish we had this on Steam. Some day, when we will maybe be able to install games in seconds, we could basically stream a free demo of a game. This would already be possible today with smaller games.", "Another thing which Android had for years but goes nuts when introduced in iOS. I don't know what's the craze but these kind of hype for such things isn't really necessary.\nI know I'm going to be downvoted like hell, but I wanna say my point.", "Super interesting use of the API - I actually hadn't thought of that. As an aside, I had my first app clip experience last weekend. I was by a Panera bread, brought up spotlight search and the app clip was right there - and it opened in a few seconds.\n\nIt was also nice to see it live in the app library for a day or so, so I could check back in on things. I hope we developers figure out how to use it, I'd love to see the feature get some legs under it.", "It’s also a *really good* bullet hell shoot-em-up.", "This is a great idea. Shame that they have to use App Clips as a workaround and can't just offer a demo via the App Store, which would help immensely with discoverability.", "[deleted]", "Yeah this is super cool, I didn’t realise I’m up for an R-Type-like on my phone, and I wouldn’t have realised if it wasnt for this! \n\nI definitely have app fatigue and a lot of times I don’t even bother with downloading apps anymore, but this way, you instantly know what you’re getting without having to download, I love it\n\nI don’t mind spending money on apps but I certainly wouldn’t mind spending more efficiently and this sounds like a great move in the right direction (if widely implemented over time of course)", "I'm hoping this means we see more premium games make their way to the app store over time and maybe a reduction in the F2P, bleed every penny out of you, crap.", "Is it better than Google play Instant apps", "*So* much better! So many of those ads are like, here, try the game, then let you play for about three seconds before kicking you to the App Store. That’s not enough time to get a feel for the game, devs! Even if it’s something that actually looks vaguely interesting that puts me right off.", "Wow, same", "Yeah you can try an app on a website.", "I think App clips + Apple Pay are the future of any kind of contactless payment or infrequent short term rental use case. Walk up to rental scooter, don’t have the app, scan QR code, pay with Apple Pay, off to the races. No download all, create account, add card, blah blah blah.", "android has been doing something similar for awhile and it’s been working great", "it’s literally a PWA", "[deleted]", "I actually love that it saves because now I can play it again and show someone else without having to remember the name of it. Plus if you end up getting an app clip for something you would use often, why not have it saved?", "Worse for me, it appears in Siri Suggestions on my Home Screen https://i.imgur.com/8chfdFz.jpg", "You can go into Settings - App Clips and delete it.", "For other redditors that don’t have English as their first language:\n\n>\te·phem·er·al  (ĭ-fĕm′ər-əl)\n    adj.\n1.\tLasting for a markedly brief time: “There remain some truths too ephemeral to be captured in the cold pages of a court transcript”", "Would be nice to have it at airports, McDonald’s and Starbucks.", "Thanks for being honest", "I didn’t like it, but I am lying.", "AppStore is for the full experience.\nApp clips are triggered via safari/nfc and qr code. These are mini experiences that you need to find.\nBasically Apple’s pokemon :p", "Capable of everything an app can, pretty much, just limited to 10 MB.", "There’s a subreddit for this game full of nice helpful people! Not sure if I’m allowed to link it here but it’s just the name of the game", "It's a great game. Wish there was an Android port", "It is a good game. Unfortunately it’s mostly ruined for me by manipulative time-gated content a bazillion micro transactions. My kid would love it, but I can’t let him play it because he would constantly be accidentally buying shit. It makes me sad this is the state of iOS gaming.. I wish I could give them $10-20 and just turn off all the begging/time gating.", "Me too but if you press the play button quickly enough before it disappears it’ll still work", "It said that for me at first, but then I reloaded and it was there. \n\nAlternatively, I sent the link via iMessage, and the play button appeared within the Messages app! Super cool.", "[deleted]", "Or wait 30 days.", "it's <10", "It’s probably mostly shaders, which are only a couple of KB. The UI and assets are maybe 5MB. So the rest is just code. It’s probably like 7-8MB in size.", "Maybe you have private browsing enabled? App Clips don't work in private browser windows.", "It’s not to provide a free demo. It’s to get users in the app more quickly. The full game would probably take a minute or two to download.", "Also, once you’ve bought the game it will clutter up your purchased apps forever. Yes you can hide those but it’s extra steps and still in your App Library. Clips are there to load quickly and go away after a bit. Less management and clutter for the user.", "I got sound and music.", "There’s always iOS 15, bruh.", "They can (and probably do) both.", "What? The whole point is that it’s a demo.", "The point is about trying app clips, not the game itself.", "Unfortunately if a user finds the app on the app store i do not belive they have a chance to test the app clip.", "Probably.. apple has higher quality control than google", "Tbh, didn't even know Google already had such thing. I wonder how often people actually have used it. As it's quite often that when apple introduces something \"new\", everyone all of the sudden starts using it.\n\nGot to ask some of my android friends, whether they knew/used google instant.", "That’s what China’s been doing since 2016 and it’s really convenient", "True that..it's called Instant apps launched back in 2016.This feature is \"mostly\" supported by games.\n\nIf anyone has a good Andriod phone and never heard of it then Just hop onto play games apps.\nAnd u will instantly notice them. (And tons of them)\n\nThis is a good way to play full / demo games without even installing them.All our achievements are saved onto play games profile.", "Yeah, as an android user that came to iOS with the new SE these new updates have been weird. Like... you all didn’t have widgets yet? Lol", "Literally not a PWA. Completely different tech, and even conceptually, app clips serve a different purpose than PWAs.", "That’s good to know! I still find it cumbersome  that even from within the App Library, you can’t delete the App Clip from there. Long-touching it provides no context menu like the standard apps to delete it. Oddly, from the settings menu, you can’t quickly just search for App Clips to get to it quickly either. You have to scroll about a quarter through the settings menu just to view the details.", "That’s a good point! I know it’s about keeping it simple, but I wonder if it would be neat to be able to choose how long an App Clip gets saved on your phone on launch. \n\nFor example: \n\nI’m riding the train in Tokyo today and there’s an App Clip for the pass. I can launch it and choose the “30 days” option.\n\nI now want to try this video game App Clip. I can launch it and choose “Do not save” or “one time” option.", "Yeah, and I can’t find a button to remove it https://imgur.com/a/tyJS5VK/", "Weird it's not showing up for me. \n\nIs the app still open in the background? I immediately quit out of the app which might have removed it.", "How do you have Siri suggestions just on your Home Screen without them being in a widget?", "“I don’t want to have to go in and delete it”. \n\nThat’s what they said right?", "Wow that’s some slack UI/UX. Every other app deletes a completely different way, and you can’t delete regular apps this way.", "Ephemere in French", "It is Greek and means “lasting one day”. Many languages have it.", "efímero is also a word in Spanish.", "But I had the same thought as OP, and I went to the app store to find the demo. I was confused when I had to go to the website to play it. I see your point, but if this did end up as a way to play demos, it would be nice to access through the App Store too.", "Sure but I just thought it would be more useful if it was discoverable in the app store, especially if it's a demo of the app. I don't know how many people really goes to an app's website when they find an app on the app store but, personally, I have never done that.", "Android doesn’t lend its self much to game developers", "yea, the monetization part of this game is terrible. It needs a serious re-work. The pricing for credits is bonkers compared to what it gets you.", "I don’t think that’s a fair representation of the game. Tbf I love the game so take what I say with a grain of salt. There is no energy system, no premium currency, and no limit on how many times you can attempt a mission. There are 3 missions available at all times that constantly change at different frequencies depending on the type and sometimes you’ll need all that time to finish the mission even though a successful attempt only takes ~3 minutes. \n\n The only time-gated aspect is the warp gate which gives you a chance for a free ship every 12 hours. You can’t buy anything to speed up that timer. But every ship (except for a few that can’t hang at the hardest difficulty) is viable so you never have to spend money to progress. Once you get to the point where you need the “top tier” ships, I’d say there is a 99% chance you’ll have naturally acquired them. I spent $5 on the game 2 years ago after playing for 2 years before that not because I needed anything but because the devs deserve it. \n\nI will say that the options to buy credits are very very easy to find. They are on the same screen as the free ship button. But again I never had a need to buy any to progress.", "In terms of F2P content on iOS, it's one of the most tame. I've played hundreds of hours without ever feeling the need to pay any money. \n\nI'd hardly call anything about it manipulative either. \n\nEven if you pay to get the best ships, you still actually need to be good at the game, and the best players can finish missions with almost any ship.", "You’re right works great haha", "Did that and it says \"App Clip Unavailable\" on an 11 Pro on the 14.2 Beta. Might be a beta bug.\n\nDid it another time and it worked great.", "Same. I’m on 14.0.1 too so maybe that’s the problem", "Maybe you are in private browsing? Apps Clips don't work in private browsing windows.", "Texture assets are big indeed, but don't forget the entire game engine. It also required a high resolution icon to be supplied, which really counts when you need to go from 190MB to 10MB...", "It works great as a free demo though! I usually don’t go for these kind of games, but I checked out the App Clip because I was curious and it didn’t require me to download the full app, and was so pleasantly surprised that I did end up downloading the app.", "Ah, ok.", "Oh weird", "The full game is F2P with boatloads of mitrotransactions.", "[deleted]", "That’s something they need to address in a future update. It really should be a feature.", "I'd imagine almost all Android users have used it, even if quite a few may not realize it. It's quite seamless and subtle, like if you click on a Vimeo link it'll open in the Vimeo 'app' even if it's not installed. Same with some news and shopping sites. But it's not the type of thing you actively 'use', and not enough sites/apps use it to make it affect my phone experience. It's nice when it comes up about once a month.", "Don’t they use WeChat for that?", "The QR codes are just a convenient way of entering an ID. One thing that I think can be improved on about these newer payment methods is that they should work without an internet connection, similar to how the traditional NFC payment cards work.", "I loved the instant games arcade when I had an Android, it was so cool to be able to jump between demos without installing it. Instant apps didn’t seem to gain much traction in the real world though, only ever saw it once.", "I checked (note 9), can't find 1", "But we did have awesome os updates for years so there’s that", "Yeah, that’s actually a really good idea to have options on how long to save it. That sounds like something to send a feedback report to Apple about honestly.", "Wow, looks like it's removable in Settings only", "I loaded it again, but it's not showing in Siri Suggestions now. I see it in the app switcher though. *Edit it's in Siri Suggestions now. Quitting the app in app switcher didn't remove it.", "[deleted]", "Totally a meta side thought but I feel like it’s so tiring to explain every angle of a question you are asking sometimes on Reddit because people come in just addressing one part of your question and/or ignoring the rest and then get a bunch of upvotes.", "I’ll bet that eventually, or in short order, any app or game that has an App Clip will have a link to it on their App Store page.", "Nah happening for me on regular iOS 14 as well", "If they’re using something like SpriteKit then there’s probably not much to the game engine that’s not already built-in to the operating system.", "I don’t think anyone is reviewing the game itself really. Just that the use of app clips for a quick demo is really cool.", "You don’t need to do the microtransactions last time I p,ages. You could earn the crews to get new ships and you don’t have to have every ship. Just one or two are needed to be competitive. At least when I played", "What do you mean pay to win? You can earn points toward a ship by playing and if you’re skilled, you can complete a mission on a wide variety of ships", "Yer, not all Appclips should be accessible this way (location or QR experiences cant be) but devs should have the option to expose it through the app store.", "Arcade which existed earlier used instant apps too..but later on the name arcade was dropped.\nForm developers perceptive , instant apps have attracted more users to their apps.\n\nEven though instant apps name doesn't come around much..but for those who know about it surely hop onto it (in weeks /months) to play some new games without even installing them.\n\nWho knows,  now since Apple has released somewhat similar thing. It might gain some attraction.\n\n\" When Apple does something even small things gain much attraction (eg.home customization)\"\nDon't get me wrong here.", "1) Available on Andriod 6.0+(For most OEM's).For samsung devices it's Andriod 8.0+.\n\n2)[It's ON by default]If not,U need to turn on the option in Play Store setting>Google play instant>...\n\nOr go to main phone settings>Google>Account services>Google play instant>...\n\n(If the option exists you should have it)\nAfter this u might have to wait ,not sure about that\n\n3)On play games /play store (Lighting(Flash) symbol) on apps indicate that it has instant app.Or it's just written try now or instant play.    \n  \nThey are easy to find on play games app instead of Play Store.(games)", "Eh I had nexus and pixel phones so basically the same experience as iOS honestly", "thank you for being sincere and not lying that it’s a bad idea", "I did not know that. Thanks.", "Couldn’t agree more.", "Found them on play games. I didn't even know play games was a thing...", "Except the top-tier silicon", "No problem. I actually sent Apple some feedback suggesting it because I really do think that’s an awesome idea. Hopefully they take it into consideration.", "I support this statement. Honestly. Not fibbing one bit. Holding my hand up to Joe Pesci.", "Yeah, Google's implementation of instant apps has been a hidden feature for years. \n\nIt's unfortunate because the idea is so cool. \n\nHonestly it just took Apple's demonstration of App Clips to sell me on the idea of \"Apple is taking this idea and actually using it where Google failed to do so.\"\n\n\nThat (and iOS14) was a big push in why I'm going for the iPhone 12 this year after being Android for every single cell phone in my life.", "Ehh honestly performance is about the same. Maybe if apple allowed sideloading emulators like Dolphin we could see real flex but as of today nothing on the App Store really uses it...", "Typical Google. They have a lot of great ideas but don’t know how to package and market them.", "Yeah, that's the worst. Because I have really been rooting for Google.", "Google has serious ADD, so many things on their mind but never with their full focus. Apple puts the full heft of their weight behind every decision they make. Less going on, but a lot more thought into the individual choices acted upon."]}, {"title": "New iOS 14 Feature 'App Clips' Lets You Access 'Small Part' of an App Without Downloading Entire App", "comments": ["With all those situations where you need to download an app for just a certain scenario, this could save a lot of frustration, that's for sure - wonder how many devs support that.", "Hopefully this eliminates most of the times where you have to download a single-use 200 MB app do something trivial, like remote order a coffee from Starbucks or something... good stuff", "There's probably 10 or more startups that have been slapping QR codes on restaurant and bar tables to let your order or pay your tab or make a reservation and this is probably going to destroy them.", "Hopefully it gets support from many developers. Google introduced this a couple of years ago in android as \"instant apps\" and i remember being very excited about it but very few apps ended up supporting it. \n\nin fact i completely forgot about it until i saw this lol", "Almost like Android’s instant app, but since it’s Apple, this might actually get real support and be actually useful.", "[relevant](https://xkcd.com/1367/)", "As someone who uses a commuter bike, I’m hoping Lyft will integrate all their different programs together so I can use a Bay Bike in SF a Citi Bike in NY or a CaBi in DC with only having one on your phone", "Like instant apps from Google. Cool!", "Imho the biggest bomb of the keynote after ARM Macs. Legitimately useful feature that will hopefully change the app ecosystem forever and free your phone of single-use junk apps. In a world where a 100MB app is considered “small” the 10MB restriction is amazing", "I wonder if Apple Maps will use this instead of expecting people to install Yelp.", "Assuming a developer produces a clip. It doesn’t just get sucked out of the app automatically.", "It seems likely to me that these App Clips will be the first apps we see on Apple Glasses. They seem to be based around quick and light interactions with the physical world and things like the 10mb size limit make sense when consider Glasses will likely have limited on-board storage/power.\n\nAs always it looks like Apple is three steps ahead and may be beginning to build an ecosystem of apps and interactions for a future product line that hasn’t been announced yet.", "I’m still not quite following the use cases here:\n\n- Blue bottle coffee - how is this easier than just using Apple Pay at the register?\n\n- Panera bread - so the idea is you can preorder something without downloading the full app? I guess as an app developer, why wouldn’t I want to get them to download the full app and then have options to market to them/push/email? \n\nReference video: https://youtu.be/cxqZrKzAZhU", "Any idea if these will be able to be \"long-lived\"/\"long-running\"? Like, let's say I run a video streaming service and want someone to be able to scan the code, pay, and stream the video once in our \"Clip\" instantly.", "Will Clips show up in your App Store download history etc.?", "deleted  ^^^^^^^^^^^^^^^^0.2905  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/09534)", "I wonder the use case of this for countries that don’t support Apple Pay just yet. It’s a really interesting feature and especially helpful for F&B payment & loyalty programs.", "[deleted]", "this is very impressive but i don't see when it would be useful for anyone not living in a city, me included. thoughts?", "Apple should push for improving the progressive web apps ecosystem instead of adding more fragmentation in the app space. Now in addition to full native apps, developers have to support instant apps on Android, App clips on iOS and they still need web apps for other devices like laptops.", "[deleted]", "Google Play Instant, ie, Welcome to Android in 2014", "The parking app thing was a great example because this is something I’m forever frustrated with. The parking lots in my city use at least a dozen different app standards and it’s infuriating.", "Parking and public transportation apps are likely to support it. And if that is all there is, that is still a major improvement for the platform.", "For game developers that want more attention to their apps I think this will be a good addition. Basically there doesn't need to be any more \"demo\" apps, if I'm understanding this correctly.", "This is going to be another Sign In With Apple feature. It’s great for end users but awful for product owners / developers because it means you use a tiny part on an app and then dump it.\n\nDevelopers want you to use the whole thing and keep the app. So I don’t see this being used very much.\n\nI bet a Twitter will be the first to add it so you can send a Tweet quickly. But anything remotely useful, won’t happen.\n\nHonestly love the feature, but developers know what they want and what will cause a problem. Usually what the user wants doesn’t always align with the developers.", "Yes this awesome specially when you have weak signal and need to do something on a pinch.", "I doubt the app developer will.simply their app so you can quickly download it use that one feature then delete \n\nWatch the one feature of the app everyone wants to use be hidden in the full download version of the app", "Starbucks has a PWA. just for this purpose", "Or they can create the app clips for them and manage that process still.", "Much more than 10, everyone's got one these days. I used to work for one that unified the process into one app. QR codes were the worst way. Nobody wanted to download an app OR even bother scanning a QR code, which is understandable. We skipped the whole QR code mess and just went for something different.\n\nAnyway I digressed a bit, I don't think these apps will die, the entice you with loyalty programmes and discounts for using the app. It's still infinitely easier and simpler to pay with contactless or Apple pay.", "No it’s not, you can’t assume all your customers have iOS and QR code’s are truly cross platform", "You still need them for android. And realistically, you will want a QR code system to redirect to a landing page. From there, the user can choose if they want a iOS native experience or just stick to the web one.", "Apple has a tendency to push the industry forward, regardless of who did it first", "Is instant app not useful? Personally its great on my note 9", "I can finally get rid of the category on my home screen that is just all the different parking lot apps", "A lot of the new stuff felt like Apple getting jabs in at Google. Especially on privacy, but also on Maps, Homescreen changes, and Translate.", "Yeah that was in the demo", "This is what I was looking for. You’re right on the money with this one!", "Mind blowing idea. I love reading the tea leaves coming out of Cupertino, 100% agree this what they’re getting ready for.", "It says under 10Mb so whatever you can accomplish in that would fly 🤷‍♂️", "Can you explain how it works? In the demo a user goes to Blue Bottle to order/pay...how is that different than having to pay using Apple pay using their tablet kiosk?", "Higher api access like hardware features. Web apps can’t access NFC or Bluetooth for example.", "1.\tWalk up to parking meter \n2.\tTap phone to it, app clip pops up\n3.\tAuthenticate with Face ID to pay\n\nYou can’t do that with a web app. At most, you can scan a QR code and have it open safari and load the page, but the point is to not use web browser which has poor performance and low integration with modern UI and APIs and system access functionality such as instant open with NFC.", "I suppose it would be helpful for things like schedules and maps, but with Express Transit it won't be needed for payments.", "I bet we're going to see a rise in ProcGen assets now for games to keep the demos under 10mbs. Time to pull talent from the 64k Demo scene...", "Interesting, I haven’t thought about this. I’m looking forward to seeing actual documentation on this, in terms of how much codebase you sharw with the main - core app.", "[removed]", "[removed]", "As a PM I have to partly disagree. Sign in With Apple has been fairly popular and as shown on the Kayak case study, it would be the most popular choice with regular Apple users. And now, you can migrate user accounts to this method as well.\n\nIt comes down to what would the API/SDK look like for this and how much code could you reuse for this actually. So yeah, in case you need to write a different code, then it can become a mess.", "This is a very superficial analysis of app clips. The conversion rate on a real world interaction leading to downloading an app is probably very low. It is in the product’s best interest to convert people, and I don’t see how reducing friction would deter companies from implementing app clips. \n\nSign In with Apple is different because Sign in with FB/Google already exists, so there wasn’t that much of a difference in experience. Downloading a 500mb app vs tapping/scanning to start and immediately have functionality is a huge improvement in experience and likely to increase conversions dramatically.\n\nPLUS, it is a proven model. In China pretty much all restaurants have QR code’s on the table where you scan, order, and pay without a waiter. Apple is essentially taking this model to all other modes of service. The keynote shows parking and scooters, and if there was no pandemic I’m sure they’d have restaurants in there.", "To the contrary. Downloading a 200mb app to see if it functions as intended is something a lot of people avoid- but if these clips are built properly by devs, it’s a great way of showcasing the app.", "according to the presentation, services app like booking apps can allow their restaurant to “clip off” just the booking/reservation part of the app.\n\nThese apps only care about getting paid for the reservation services by the restaurant. They don’t care if the users install the app in the Long term or not.", "What’s pwa", "But then they can't sell ads for premium listings", "Also have a note 9 here, which instant apps would you say are the most useful?\n\nTo my memory, the only one I've used is Vimeo.", "I guess he just doesn't use them a lot but I use it a lot for news sites who like to use their own app but I don't want to download it", "I think what he is saying is that there is a very small amount of apps that actually have instant versions", "A lot of them are basically features that Android has had, but better execution. I’m not mad about that, not in the slightest, I’m pretty excited.", "They were throwing shade at Google hard with the privacy stuff. When they were talking about trackers on Safari, most of them were Googles analytics", "[deleted]", "Yes they can", "[deleted]", "They are almost always the use case that Apple uses for quirky new features like this. I don’t know why but they always get onboard with this sort of thing.", "This could be big now with so many places preferring you to order online to prevent the spread of covid.", "> Sign in With Apple has been fairly popular and as shown on the Kayak case study,\n\nYes, popular among the *users.* The comment your replying to is talking about how App Clips is also great for users, but awful for product owners / developers.\n\nProduct owners / developers mostly wouldn't offer Sign in With Apple because they then collect less data on you, and I would guess most apps include only because Apple required them to include it (if they use other SSO options) or get booted from the App Store.", "There's a Ramen place by me that prefers for you to download their app and order from it. Well, their internet runs really slow on a crowded night so I could see this be really helpful for them", ">  In China pretty much all restaurants have QR code’s on the table where you scan, order, and pay without a waiter.\n\nAlthough those live in one of the super apps and this eliminates the need to have one catch on here, god forbid it was Facebook.", "China and the US are different. It’s a proven model for Eastern societies. In China they use their phones for everything and I mean everything. The level of reliable smartphone adoption is not like that anywhere in the western world. You’re living in a fantasy land.", "Progressive web apps", "What do adverts have to do with paying for my food easily? :s", "Keep in mind you can still invite users to “sign up with Apple” for future features / reservations / gentle onboarding. \n\nYou could literally give people money off their bill for “signup with apple” etc. \n\nIf anything this should increase adoption, traction and revenue if the companies implement smartly instead of fight petulantly :)", "That's not how they make money.", "I Swear Vimeo is the only one. I've never encountered any other instant app or have seen anybody else talk about another Instant app.", "Idk", "Yeah because of Googles low regulation", "Same. I’ve said for years if it’s a good feature, I want it. Don’t care about who did it first.", "Apple has always said that they don’t show up first to the party, but their goal is to be the best dressed.", "[deleted]", "It says right in those pages that those are experimental technologies...", "No browser supports linked NFC api. Also a native app will always be ahead of its PWA counterpart and grant the app more capabilities.", "I understand what you’re saying, but you’re missing the point. \n\n-\tNFC is for the app clip to pop up. Yes, it could pop up with the webpage, but this would be more jarring/less smooth imo. I don’t understand why you are focused on the web browser, which would have nothing to do with NFC. It would just open up a certain URL.\n-\tYeah, Apple Pay is on the web. I knew that, and probably shouldn’t have mentioned it. I was just too casually storytelling. The quickness of an instant pop up with Face ID authentication ready to go, but yes Apple Pay is not an exclusive benefit otherwise.\n-\tIn practice, web app performance is often poor due to open standards and varying quality of devs whereas app clips will have a restricted, native UI with roughly guaranteed performance. And more interesting API potential.\n-\tSame issue with ‘any ui’, that’s a negative not a positive, but also I meant the native integration as opposed to being wrapped in a web browser ui.\n\nIn the world you described, Android is free to do that. QR codes do that, these app clip stations could include a URL for android devices too. But opening in a web browser is an inferior experience and provides less marketing throughput for devs, so why would they support it? This makes it much easier for people to download apps.", "[removed]", "Am I supposed to feel bad that developers can no longer collect more data on me?", "UX designer here. \n\nWho gives a shit about the POs?\n\n^(Just kidding guys I love you)", "Well no, I meant my comment for be from a technical perspective of a Project Manager. I do not see how this is awful for product owners or developers, at all.\n\nThe documentation for Sign in With Apple is absolutely fine and we did not run into any issues during development at all. Definitely easier than Google/Facebook, especially with focus on users' privacy.\n\nMany developers choose to implement Sign in With Apple because it creates better UX for their users and also, it's more privacy-friendly so users can trust it more easily than Google's and Facebook's SSO. Especially now with the Facebook's SDK fiasco.", "What’s progressive webs apps?", "It's the only one I know, but it's also a prime example of instant apps done correctly. I don't use Vimeo to the same extent as YouTube, only really watching linked videos rather than browsing, so it's a great use really.\n\nI still feel that the best use would be for parcel tracking. I don't want to download an app to follow one package (not that most deliverers even have an app) so that would be dope.", "So why did you say it’s great then? Do you even know what it is", "Except that isn’t true. This is directly from Apple’s site. \n\n\n“You can find App Clips from places in the real world through NFC tags12 and QR codes, and you can also launch them from Safari, Maps, and Messages. The places where you can launch App Clips are immediately recognizable thanks to Apple‑designed App Clip codes. App Clip codes are uniquely paired to an App Clip. You can scan them with your camera or tap one using NFC.13”", "Not for iOS users. No experiments for that OS. Apple might lose control over how people use their own phone.", "You’re missing my point. I used Twitter as a general example.\n\nWhat I’m saying is that the idea of App Clips is great. I’m not disputing that, at all.\n\nI’m saying that for apps that require logging in and payments, you’ll still need to use Sign In With Apple and buy through Apple Pay by using the app normally. So you’re still using the app, you’re just not downloading it fully.\n\nI’m not saying it’s a bad feature, I’m just saying that App Clips fills a niche that won’t be used very much, just like Sign In With Apple. Supported apps for that is still woefully low.\n\nAnd this whole small business thing is ridiculous but small business don’t invest in tech. It just doesn’t happen. Small business like local traders are still very much analogue, so to speak.", "Of course not, that’s not the point of this conversation. We’re hypothesizing that because it’s not beneficial to the developers, they might choose not to implement App Clips.\n\nSign in With Apple has wide adoption because Apple made it mandatory (if you offer any other SSO options.)", "Oh sorry, I didn't know the abbreviation for PM.\n\n> I do not see how this is awful for product owners or developers, at all.\n\nIt's already been explained. App Clips will mean users will be less likely to install your app on their device.", "Website that acts like a mobile app, allows much of the same functionality to circumvent downloading an app for something small.", "It is an app on your homescreen, that is loaded from the website. Offers everything the app offers.\n\nDont know how safari does it. But go to [starbucks.com](https://starbucks.com) and 'add to home screen' option or 'add as app' or 'install as app'. Something along those lines.", "Same here. Since I only need Vimeo for linked videos the instant app makes lots of sense. It just sad that other apps haven't bothered to implement an instant app function.", "It seems great\n\nI did use couple times tho", "iOS Safari has [optional experimental features](https://i.imgur.com/ZhR3Mzd.jpg) that can be toggled without any external tweaks.", "I think you are assuming everyone is trying to provide free services and is only interested in data. I've worked for some product companies that basically just wanted users to make purchases. Getting a user to download our app was always the main hurdle. The second biggest hurdle was getting their payment details.\n\nWe couldn't care less if they used a completely anonymous email or a throwaway credit card, as long as they made a purchase. These app clips would be perfect for that.\n\nI wouldn't be surprised if they get used heavily in physical stores to give more information about products or offer some sort of alternative way to purchase things. In the demo they were showing electric scooters, which seems like a perfect use case to me. Another might be public transport. These guys don't care whether you have an account or not. They would prefer it, but their main preference is that you actually use their service and pay them.\n\nI could also imagine it being used in restaurants to make take away orders. Think how in Mcdonalds you have those big touchscreen ordering machines. McDonalds also has an app that can do the same, but who wants to have the McDonalds app on their phone? I am sure various food delivery/takeaway apps will integrate app clips.\n\nBut like you say, I can imagine this is totally uninteresting for apps that offer free services in return for your data.", "Beneficial to developers? What planet are you living on? Developers design for the end users...", "No worries at all! \n\nProbably very true, it will change the game. Is that a good thing? Well that depends on how you approach it. Also means that you might acquire new users from App Clips that you would not target before. That all through different marketing channels and user experiences. \n\nI agree that it's challenging, no doubt about that. However I believe developers will be able to leverage this the same way they did it with other interesting concepts from Apple like ARKit (probably more to come on that within 2 years).", "But not an app.", "It’s not an app and does not offer everything an app does. “Add to home screen”\nonly adds a shortcut to the webpage. Native features like notifications are unavailable.", "I share your disappointment. I can see how some app developers might see it as a waste, but the alternative is that I'd just not use that service.", "With covid too i'm sure no one's tryna touch a germy screen to take their order.", "Good example but I recall the clip needs to be under 10mb and I’m thinking just image sizes alone in something like a menu would exceed that with a lot of items.", "Developers design for the product owners, and the product owners have one goal: Make money. Sometimes, yes, that means designing for the end user. Sometimes that means collecting user data because the user is your product.", "Good thing for the users, definitely", "Yeah, you don’t have to download it, you just go to the website.", "No they aren't. I have them on Firefox", "That’s because Safari is a shitty 3rd rate Browser. It is behind Chrome and Firefox.", "I think you are overstating how big images can be. [Take this image of a burger.](https://i.imgur.com/27dE0Md.jpg) It is 15kb. You can have 200 images like this and it would be 3 mb. I just counted my local McDonalds menu items available for online ordering and they had 96 pics. This included every pic, including pictures if ketchup. This would fit in less than 2 mb no problem.\n\nIs it an amazing high res pic of a burger? No. Is it enough to order a burger? Definitely.\n\nEdit: and just looking at my local food ordering app, images for McDonalds are about 35kb. So my local McDonalds menu has 3 mb worth of images. Also now I want burgers.", "The app clip in itself has to be >10mb. That doesn't mean that it can't rely on fetching data/images from a backend.", "So a website?", "Nope, it’s better than all others imo. Nobody needs PWAs anyways, native is the way to go.", "I thought they needed to be large resolution retina sizes. I want burgers too.", "A website SPECIFICALLY designed to work on a mobile device. It can have background tasks, splash icons, a logo for the save to home screen feature, offline mode etc"]}, {"title": "Apple Releases iOS 14 and iPadOS 14 With Home Screen Redesign, App Library, Compact UI, Translate App, Scribble Support, App Clips, and More", "comments": ["It seems to be working quite well on the 11 Pro Max. \nMight be a placebo, but I feel it’s a little more fluid than iOS 13. The animations and just general navigation!", "Pretty terrible update so far on the iPhone 7. Camera,flash,bluetooth earphones are the things I need every single day which are broken right now. Will be rollinrg back to iOS 13 tonight.", "Higher battery drain than 13.7 \nIphone 11 \nWhy ?", "What’s the point of having the music or podcast widgets if they have to open the app first anyway?\n\nAnd in the case of podcasts, once it switches into the app you still have to click play!", "Anyone think it's kind of hilarious the app library is all the way to the right.  So I have to swipe left seven times to get an \"organized\" view of my apps.  Sheesh.  I don't get why there isn't a single button to get an alphabetical list.  Or.. maybe there is and I'm just dense.\n\nEdit: ok swipe left seven times and down once to get the alphabetical list.  Still, why is this hard to get to??", "After update, home screen is not available on landscape. Is this a bug? [iP8+]", "Are there plans for a Health widget? This feels like a glaring omission of something I’d actually LOVE to have on my home screen instead of just having Photos or my phone’s battery.", "I just wish they would've let me change the default music app, it's the only one that actually ever caused me day-to-day problems.", "I’ve used my phone for about 2 hours now and it’s at 79% and normally after 2 hours it’s at around 80-85% but it should get batter as the phone adjusts to the update but I’m not sure I’m not an expert", "With all the new widgets (and more to come!), I would love if Apple added the ability to tack apps in place.", "Is Safari any snappier? 😂", "Im afraid to upgrade because i dont know if ill be able to sync my iphone with my mac on high sierra", "Well, I decided to bite the bullet after saying that I was going to wait until 14.0.1 or 14.0.2. Apps didn’t start crashing, my phone didn’t explode, the Four Horseman of the Apocalypse didn’t come strolling by my house.", "Use this a Megathread for iOS/iPadOS 14 discussions\n\n---\n\n### Full change log https://pastebin.com/qAQXZTVm.\n\n---\n### Compatibility:\n\n\n#### **‌iOS 14**‌ is compatible with the same iPhones as iOS 13, including older devices like the original iPhone SE and ‌iPhone‌ 6s. ‌iOS 14‌ compatible devices are listed below.\n\niPhone 11 Pro\n\n‌iPhone SE‌ (2020)\n\niPhone 11 Pro Max\n\niPhone 11\n\niPhone XS\n\n‌iPhone XS‌ Max\n\niPhone XR\n\n‌iPhone‌ X\n\n‌iPhone‌ 8\n\n‌iPhone‌ 8 Plus\n\n‌iPhone‌ 7\n\n‌iPhone‌ 7 Plus\n\n‌iPhone‌ 6s\n\n‌iPhone‌ 6s Plus\n\n‌iPhone SE‌ (2016)\n\niPod touch (7th generation)\n\n---\n\n#### **‌iPadOS 14**‌ is compatible with all of the same devices that were able to run iPadOS 13, which include:\n\nAll iPad Pro models\n\n‌iPad‌ (7th generation)\n\n‌iPad‌ (6th generation)\n\n‌iPad‌ (5th generation)\n\n‌iPad‌ mini 4 and 5\n\niPad Air (3rd generation)\n\n‌iPad‌ Air 2", "Every app is prone to freezing up and needing to be force closed and opened again since updating to iOS 14\n\nEdit: it’s terrible; would rollback if I could\nEdit2: restarting seems to have fixed it", "Man, the new way to enter time for alarms and timers is DOGSHIT. Who thought that was an improvement? Dropped the ball on that one.", "Is it possible to change the photo of a pinned group text that is not all iphone users? It seems like that is not an option. Ugh that is so frustrating.", "How is OS14 doing on 6S? Anyone?", "I love the PiP on my iPhone XS Max. Finally watching some twitch while browsing on reddit.\n\nCheers.", "My whole phone (x) freezes up and phone crashes and restarts every 2-5 minutes. Can't roll back because I didn't back up my 13.7. Anyone else experiencing this? My phone is literally unusable.", "got a few apple devices, here\n\nXR and 6S works fine, but there are a few bugs especially with widgets\n\none annoying thing is that everytime I unlock my XR it says the airpods are connected, I know that they are but why it's showing every single time and not just once\n\nthe auto switch between devices for the airpods is just awesome\n\non the iPadOS the write to text funcion with pencil is nuts, my scribing is shit and it can understand!", "I can’t seem to watch 4k YouTube videos even after updating to ios 14. Is this on purpose?", "When I scroll I feel like I see my text and scroll stutter? I’m on iPhone 11 Pro, didn’t have before I updated", "I lost all bookmarks and favorited links in safari on iPhone SE (2020). Anyone also experiencing this?", "Why are my widgets so blurry? Anyone know?", "No widgets on home screen for ipad? Lame", "iPadOS 14 Home Screen is awful", "Fonts?? Anyone found an app that actually works with that or are we still guessing", "Default browser option\n\nCan see when people are typing on the main messages screen\n\nWhat’s the green dot on the camera app for?", "So people are able to change their app icons, yet I can’t find it In the update notes or the settings? Any ideas?", "Im keeping ios 14 beta😂 its stable", "No placebo, I agree. iPhone X here though.", "[deleted]", "This is common after performing an update/upgrade especially to a new iteration of iOS. Your battery life should improve significantly/return to normal after a few days. There is internal indexing and processing running in the background that impacts battery life despite not being explicitly indicated as a temporary drain of resources.", "try eject sim card, it's work for me, lol", "I agree! It’s a small step backwards. Unfortunately affects 3rd party widgets too. No more quick-log with Streaks, and WaterMinder at least knows which drink you tapped and logs it, but has to open the app (and unlock phone if it isn’t already) to do so.", "You can hide Home Screen pages you don’t want to see and also swipe on the dots at the bottom of the screen to quickly go from left to right", "Super hilarious, not sure why they didn’t just put the alphabetical list when swiping down for spotlight.", "I agree. And we already have folders. I don't get the need for it", "I imagine there’s got to be one in development.  The widgets are definitely half baked right now.", "That’s typically how it goes. Think of it like getting new products at a retail store. It takes extra staff and hours to reset the shelves and reorganize the product. Same thing here. The phone needs to reorganize settings, Siri functions, new features, etc. Especially in terms of Spotlight Search. It takes extra background processes to do so. \n\nThat is why any battery life comparisons should wait a week, maybe a couple restarts, THEN start doing comparisons. Hold off on concerns for at least a few days :)", "wym IF you could? You can lol", "I didn’t mind the scroll wheel", "Yeah it’s horrible now. I felt iOS 13 made this worse when they made you select date and time for reminders separately (why would you ever set a reminder for a date only??) but now that you have to type the time, or use the tiny wheel, it’s terrible.", "You can still use the scroll wheel to set alarms, just hold down on the time itself for a second and you can then scroll both hours and minutes while keeping your finger on the screen.", "Well considering you can’t rename it, I wasn’t expecting that. Damn green people!", "6S+ here, I kinda feel my phone faster, which was not expected at all", "Does it work with YouTube?", "Yes", "Well I reinstalled it and calls now work with a Bluetooth headset. Camera still not working.", "There's also the fact that most people tend to use their phone a lot more after a major update, often without realizing it, just because they're poking around and seeing what's different.", "I always see this as the response in these threads.  Not doubting at all that it’s true, but is this something that Apple has ever confirmed?", "Ok,thanks\nI was thinking about downgrade to 13.7", "Well someone at apple sure did because it’s in the OS but hard to get to.", "I figured as much. It’s wild to me that they didn’t implement one from the start, considering how heavily they pushed Health/Fitness this year", "Yeah your right", "How?", "Yes! That was/is so dumb!", "Yeah, that tiny little window. It sucks.", "That is a good news. Thanks. I was kind of worried.", "Nope sadly not, even with youtube premium it still doesn’t work for me", "Lots of people wipe and install the new os as new. Things like this can happen otherwise. I don’t, unless I experience issues, but it’s worth considering, anyway.", "Download ipsw and flash via iTunes.", "What about the video player apps like VLC and such, can I watch a video and do something else?", "Thanks", "Mkv file that I tried playing via vlc didn’t work. Perhaps vlc still needs to support it.", "My mkv files play in VLC fine..", "I mean the PiP since that was the context of the question right...?", "Ahh yes, I see. The developers will have to update the apps to support new features"]}, {"title": "ExxonMobil now using App Clips NFC tags at the pump", "comments": ["The Google one in the corner just gives users this [link to download an app](https://gpay.app.goo.gl/1XYXhaftZctk3xnm6) instead of utilizing Android's Instant Apps feature :/\n\nEdit: never mind, it now works with the new Google Pay app.", "Looks great. Can you post a screenshot of the process/ user experience? Never seen this in real life use in Europe yet", "You made it!\n\nLink: [https://appleosophy.com/2020/10/29/apple-app-clip-sticker-shows-up-at-exxonmobil-gas-stations/](https://appleosophy.com/2020/10/29/apple-app-clip-sticker-shows-up-at-exxonmobil-gas-stations/)", "[deleted]", "Just add nfc readers and integrate your rewards into apple wallet, where it’s one tap of the phone for both rewards & card. All of these places adding nfc tags, or QR code payments claiming to be a hero on contactless payments or “making things easier” for the consumer is bullshit. It’s not convenient at all.", "What is App Clip?", "I’ve seen a few in Dallas now. Hella excited not to have to go inside a gas station anymore.", "So again, as with all things App Clip, I'm asking \"why bother?\" as the regular NFC  reader is still there with its proven technology and familiar-to-use interaction.", "I think chik fil a uses it as well", "Do you have to do anything to get this working? I had my iPhone near one at a mobile station and nothing happened.", "So I've tried to use the nfc app clip at Exxon and Mobil pumps, but nothing happens. If I scan it with the camera, it says there is no usable info. Am I doing something wrong, or did this stop working?", "[Here](https://cimg1.ibsrv.net/gimg/www.flyertalk.com-vbulletin/920x2000/674f44fa_fe47_4781_abcb_8242fd227164_d79b66d90d66f80995afd496992ebb3727c66d2f.png)", "I think the app development and price for stickers costs less than paying for NFC readers at thousands of pumps. This isn't a proper excuse for a billion dollar corporation, of course, but it seems that they're not interested in upgrading their payment technology.", "They mentioned they were [looking at NFC in their App Store reviews](https://apps.apple.com/us/app/exxon-mobil-rewards/id668175318). Maybe one day.\n\n>As for NFC, absolutely something we are watching, for now we're focused on delivering a consistent experience combining your payment and loyalty into a single step.", "A app doesnt have to install apps on their phone.(Idk well..)", "It’s a way of downloading a small “clip” of an app, to perform a various function, say, paying at the pump via a PARTIAL app download. It basically grabs only the resources it needs to complete whatever task has been set, and then it temporarily downloads that info, you interact in whatever way it has you, and then you’re done. The app doesn’t fully download, and I don’t think much in the way of residual files are left over. Pretty smart.", "I don’t think Exxon has NFC readers on their pumps, at the least ones I’ve seen.", "NFC readers aren’t always the best solution in rural areas, or in places with no physical infrastructure for payment transmission. Some places still don’t have Internet. LoL", "I haven't seen anything of the sort at their locations. Do you have a picture?", "What model?", "The iPhone NFC antenna is actually in the upper top area of the phone, the NFC tag is directly underneath the app clip code (circle graphic), you'll need to hold that area of the phone over the app clip code for a second roughly to start the experience. In the center of the app clip code graphic you'll notice a visual clue as to where your phone should be held against it. Hope that helps. Here's a visual to roughly show where it is: [https://i.imgur.com/OT1RFhH.jpg](https://i.imgur.com/OT1RFhH.jpg)", "What model of iPhone do you have and are you on the latest OS?", "Thank you! That is really great!", "[deleted]", "Well as long as they are monitoring it, I can’t complain. Just as long as they aren’t against NFC readers like Walmart, HD, Kroger and Lowe’s!", "I haven’t seen any Exxon or Mobile pumps in my area with them. I have a new Texaco that has it and that’s the only time I’ve seen a gas station with NFC.", "u/sconniefella posted this link about Exxon further up the comments. It refers to Exxon pumps with NFC tags in the last paragraph which is what prompted me to make my comment. \n\nhttps://www.digitaltransactions.net/exxonmobil-deploys-qr-codes-and-nfc-tags-for-streamlined-mobile-payment-at-the-pump/", "No, I’ve only seen NFC at QT and SOME 7-11 locations. Outside of that, not much.", "12 pro", "iPhone 12 Pro, iOS 14.4.1", "Also a great solution to not needing a waiter or waitress to bring you a final bill. They could just post whatever your fee is to the table as you go, and then when you’re ready to go, check out!", "Ugh, clunky WalmartPay is a joke. Hate that crap.", "In Pittsburgh we have Sheetz, GetGo, speedway and Costco all with NFC readers at gas pumps. There are a handful of Sunoco’s and some have NFC readers and others do not. There used to be stickers on sunocos pumps saying “nfc coming soon” however those have been ripped off. GetGo is a big one, at the start of the pandemic Giant Eagle (grocery store) was pushing tap to pay at the checkout and now is encouraging us to tap at the pump too.", "Wait never mind, try scanning the Exxon QR code next time. The one in my image just prompted me to launch the App Clip upon scanning.", "Yeah, the QR code works, but the app clip doesn't via scan or NFC. Didn't know if it was a problem on my end or with the sticker...\n\n[trying to get app clip to work at Mobil ](https://www.dropbox.com/s/b2bmcynefvoatqa/RPReplay_Final1615957798.MP4?dl=0)", "Perhaps a sticker issue. Maybe let them know.\n\nEMrewards@exxonmobil.com", "Thanks! I'll let them know."]}, {"title": "These iOS 14 apps offer home screen widgets, App Clips, and much more", "comments": ["I must be being stupid, because I've got both Streaks and Spark, and I can't get a home screen widget for either. Streaks has a widget in the Today view, but I can't move it to the home screen, and I can't get a widget for Spark at all.", "No weather widget on the lock screen?  How did they overlook this?", "This will be a much better feature once more 3rd party apps offer widgets", "When I try the Apollo home feed it doesn’t show MY home feed .. has other subreddits that I’m not subscribed to", "I still don’t understabd the appeal of widgets on the hone screen", "I have pedometer ++ and waterminder. Neither of them seem to have widgets available though? Ive updated all apps already. Strange", "I might be stupid, but I went to the websites of several of the apps that offer App Clips and can't get anything to show up (no banner at the top of website). Am I doing something wrong?", "I must be the only one who thinks the gap between the bottom row of icons and the dock make the homescreen look hideous. It just looks stupid at least in 13 the dots were at the top edge of the dock but the icon spacing is just terrible now. Its bad enough that I'm considering going back to 13.7 before its too late. Only thing stopping me is I updated my watch.. stupid..", "In Canada, I can confirm that Apollo, Spark, and Carrot Weather are NOT available.  Actually, none of my apps (non Apple default apps) have widgets...  :/\n\nEdit: Also, clock widget would only show Cupertino time, not my home city time", "[deleted]", "I need fantastical widget in my life ...", "Press and hold on the widget, then choose edit widget. Will let you chose what subreddit you want", "I get the appeal of widgets on the home screen, just not most of the ones we have right now", "I use Todoist to keep track of a to do list daily. The point of the app is to make sure I don’t forget any tasks. Sometimes I’m dumb and neglect to open the app toward the end of my day to make sure I didn’t forget anything. Having the list on my Home Screen puts those tasks at the forefront.", "If you have the screen space: seeing the stock ticker without opening the app is nice. Also a mini weather radar right on your Home Screen? Winning!", "I use widgets for my support ticketing system and my booking/subscription analytics for the business I own. It is a game change to not only see the info at glance but to get into that exact item from a tap.", "Been seeing that you have to open the app after updating.", "Edit widget to change details.", "Search for the apps directly on the App Store, even open the app page. You may have to update them manually.\n\nI’m Canadian too and I’ve had all these widgets since this morning.", "That's what it was, thanks. I thought the apps were up to date, because they weren't amongst the hundred that automatically updated this morning. Turns out I had to manually update them\n\nThanks.", "Yeah those options work (individual subs or All), but when i choose Home, it's showing the Popular feed", "I just keep the 2x4 weather widget up at the top of my home page, rather not strain my thumb reaching for apps at the top.", "I find them pretty useful. \n\nI have a work page (that I toggle on/off when I’m working) that has a large reminders widget a small notes widget and a couple of apps. \n\nMy main homepage has a couple of shortcuts widgets in a stack with 4 buttons for different light settings for my apartment on one stack, and then a stack with water tracking, caffeine tracking, a button to quickly clear my clipboard, and a Shazam button (I plan to change that to something else but haven’t setup what I need yet)\n\nThe siri suggested apps widget is pretty damn good too. \n\nIt’s very dependent on the person and use case though. It’s clearly not for everyone.", "Mini weather radar?! Please let me know how", "Has your stock ticker app been updating in real time? Mine is only showing the closing price and chart from yesterday.", "Seems to be the case for me too.", "Thank you!!  That solved one of my problems!", "Ahh there it is...  dumb that we have to manually update it for widget to work.", "My friend had that problem and then after a while it refreshed and started showing his", "I was thinking about doing that... Having a home screen page just for work. And then it can be toggled off on the weekends or whatever. It's kind of nice to be able to have different layouts of apps and widgets for different scenarios. If you were going on vacation or something, you could make a custom app page and then turn off all the others.", "[Carrot Weather BUT it’s $7.99/month](https://imgur.com/a/3XKj43a)", "Doesn’t look like it’s updating every second but it’s showing current price. That’s what I have it set for in the actual app. Maybe yours is set to show closing price?\n\nEdit: wait, I don’t know where that setting actually is but I do know the widget is showing me current price.\n\nSecond edit: that’s how I have it set for my watch. To show current price. ¯\\\\_(ツ)_/¯", "It just that the update haven’t been pushed to you yet. You don’t get app updates the second they are put online.", "Well that sucks. Thanks so much for the response", "Agreed. I hope someone comes out with another cheaper option.", "Yeah, I love Carrot Weather but I'm only on tier 1 because I just don't want to pay that much. Tier 3 is $30/year, a big savings over the individual $8/month, but yeah I'm not paying that ATM. \n\nThe Weather Channel just came out with their widget. You can see radar, but the caveat is that it's only on the massive 4x4 widget. So not exactly mini."]}, {"title": "App Clips could be just the start of a new approach enabled by 5G iPhones", "comments": ["Interesting take. \nI wonder how developers gonna react to app clips. My guess is app that has business with real world would be very quick to adopt app clip.", "Leveraging “5G” into a situation where it’s not warranted. 10megs is a ton of code; I want app deva to be efficient, not sloppy, which they will be if they’re offered unlimited bandwidth.", "This is exciting! But I live in Chile and I won’t get 5G in yeaaaaars, unless I move to Santiago (the capital), then it’ll only be yeaaars", "The issue with App Clips is that developers want you to download the entire app.  If they don’t offer an App Clip, are you just not going to use the service or are you going to download the app?  I expect that a lot of developers will bet on the latter, particularly in the situations where App Clips would be most useful (parking, etc).\n\nSo Apple needs to take away the incentive for developers getting the full app installed.  That likely means needing to go far further with limiting how much data that apps can collect on you.  Take away the data incentive and offering things like App Clips are purely benefit for developers, rather than a trade off.", "Considering android has had app slices for a while now, I'm guessing they won't take off.", "Yea I really hope this App Clips thing doesn’t flop. It’s a really cool feature that will work really well if it gets adopted correctly.", "I can see them being a point of entry. I live in a suburban town in the middle of Rust Belt, Ohio and don’t visit large cities all that often. If I need parking, I can use App Clips to find the correct parking app or if I buy something from a small business. Could be interesting but let’s hope it works as Apple plans.\n\nJust had a thought, what ever happened to iBeacons?", "There’re many things that flops until Apple make one though. Like wearable for example, Google did it way before Apple and their Android wear is flop. But look at where Apple Watch is now.", "I am a Developer and I have never seen how to install and distribute an android app slice. Apple even created a new QR Code system which is instantly distinguishable. Instant Apps is cool idea but Google executed it terribly.", "How good was google wallet support before Pay?", "Mobile payments is a better example. No businesses bothered to upgrade to or advertise their participation in Google Wallet, but now Apple Pay is everywhere. I wouldn’t be surprised if something similar happens with App Clips. I’m sure it will at least be successful with companies that are heavily reliant on an app. The scooter rental demo from WWDC is I think the perfect example.", "I mean samsung pay is way better than android or apple pay since it can fake a credit card. EDIT: why the down votes, its true. I guess a ton of people here are die hard apple fans that won't admit apple has any flaws.", "That was so damn annoying. I am an *early* adopter of NFC for the US. And when I was trying to use contactless payment on my Nexus 5X *nobody* supported it yet. It was only after Apple got Wallet out the door did any business in the US care. \n\nI’m hoping this is the same, I want app clips to work as badly as I wanted instant apps to work.", "Mobile payments had the benefit of building on contactless payment systems already in place, especially in Europe. Perhaps the US saw greater adoption because of it, but much of the backbone of that system was in place with pos machines having NFC built in. \n\nWill these app clips utilized more than android, sure, but I am not anticipating it to be all that revolutionary.", "It was a right place right time sort of deal with Apple Pay. Stores already had to replace their hardware anyway, Apple just made it so they didn't cheap out and buy stuff that didn't support NFC (which they very much would have since contactless usage in the US was near zero before then).", "That’s not a perfect example either. NFC adoption was further incentivized by updated liability rules for merchants, i.e. chip vs swipe. Most newly upgraded terminals also included nfc and offered the same liability protections as using chip\n\nEditorial note: I’d say Android/Apple Pay is more secure", "I have to agree, Samsung Pay seems to be the best way to pay via mobile. Not sure why people here can’t see that, you can use Samsung Pay pretty much anywhere.\n\nHowever, it’s only as good as it is because Apple showed everyone that paying with your phone is actually viable. Samsung doesn’t get to be the best without Apple pushing them there, same with a lot of services and products.", "It’s better in terms of usability, but not for security. It stimulates a card swipe, right?", "MST is certainly nice, and I enjoyed having it on my Gear S3, but I still prefer proper NFC support since it is a little more fluid. The number of times that I’ve waived my wrist around the card swipe at Kroger (who still doesn’t support NFC...) and having to try again more than once to make it catch it made it pretty cumbersome on occasion. \n\nAlso with NFC points, more merchants put out the little tile to tap than they did when it was just card swipes or Chip card readers, so a lot of times I didn’t have a card swipe to tap at all.", "I guess you got downvoted because faking a card is a huge security issue, because you still need a specific application for this, and because it cannot work outside of the US (Europe for example).", "Instant Apps never really took off, did it? I was always impressed the handful of times it happened, but it was rare\n\nPs: nexus high five! I had a 5X too (RIP). Best fucking camera I’d ever owned at that point", "Yeah, I recall when Apple Pay was first rolled out there were a number of POS systems it would work on, and they were easy to recognize after a while, but rarely was there any signage denoting it. Even today a lot of POS terminals just have an unmarked “sweet spot” in the top-right of the screen for instance, but now most cashiers recognize what I’m trying to do and coach me as to where I should aim. \n\nI don’t think App Clips will be a huge thing either. I think the more interesting angle will be to see if small businesses build app clips without having an actual app themselves. Apple said Yelp would be facilitating this idea. Would be a novel way for people to check the menu, see other locations, phone numbers, etc... like a digital brochure.", "Contactless really took off when the US made the switch to EMV because verifone’s most popular terminals at the time had built in NFC, just waiting to be enabled. It’s accelerating now with the emphasis of touching things less because of COVID.", "Yeah but the same is true with android pushing apple. They all kind of push each other to be better.", "It didn’t. Vimeo, and Zillow are the only two instant apps I ever found in the wild as of 2018. Neither were any better than the web browser version either, so it didn’t make sense to me.", "Verifone and Ingenico (among others) would have made US specific models without contactless hardware had Apple not rolled out Apple Pay when they did. Remember, we tried contactless before and it flopped badly (to the point where banks and merchants were pretty much okay not trying again). Hell, there are places that *still* don't let customers anywhere near the terminal despite a pandemic going on.\n\nUnfortunately, the downside is that NFC usage is still pretty low because a lot of people likely tried early on and got frustrated enough not to bother again. Which feeds into comments from others on why the US should have gotten Apple Pay much later than everyone else.", "Absolutely. iOS 14 has a lot inspired by Android, Android 11 has a lot inspired by iOS and at this point, both OS are quite good. Comes down to preference now more than ever.", "They could have made US specific versions without NFC but they had been making the NFC versions in such volume that no merchant was going to  buy the “special” one for a higher price. Companies spent millions upgrading their terminals, they bought the ones they knew would have the most support of the global payments industry. International retailers want one system to manage.", "There was something like 10 million+ merchants in the US at the time of the EMV migration, with a fair chunk of retailers having thousands of locations each. It's a big enough market where a country-specific model may have been worthwhile for the big terminal manufacturers. In fact, there are at least a few hardware devices that were originally designed for the US market (namely Square and similar that don't offer hardware PIN pads) and at least one or two of those that still don't sell outside the country.\n\nBTW, the Verifone MX915 and 925 are predominately used in the US. They're sold outside the US, of course, but there haven't been many takers in other countries. IIRC, the first models of those also offered/required an external attachment for contactless but got rid of it in favor of building the reader into the display."]}, {"title": "These iOS 14 apps offer home screen widgets, App Clips, and much more", "comments": ["Does anybody knows where can I find the third wallpaper? (The non stock one) Thanks!", "Until they make a way to not have the name of the app under the widgets, I won’t be using many.", "Thanks for the link my man.", "[deleted]", "All these customizations after they removed the basic phone widget.. makes no sense", "would like to know too", "Even first-party widgets have that, so you’ll have to wait for Apple to change its mind on how widgets work.", "Submit feedback.", "Only if they also remove app names under apps (which I’m here for). Otherwise the vertical spacing between apps and widgets would look inconsistent", "Jailbreak is the way. Easily removed by tweaks", "https://developer.apple.com/app-clips/", "Win some and lose some. Maybe ios 16 will allow this.", "Yeah if only they change that for widgets.", "Wow. This looks like it’s gotta be a big thing."]}, {"title": "App Clips could be just the start of a new approach enabled by 5G iPhones", "comments": ["App Clips are probably my favorite feature of iOS 14. It makes a reality of what I've always envisioned the smart phone to be. Being able to just tap anything and instantly get an interactive experience to either pay for something, redeem rewards, find more information on something, get directions, etc. is straight out of a science fiction novel which is strange to say because the underlying technology isn't new at all, just finally realized in a useful way. I can't wait for this to become a widespread thing. This will also result in a massive push towards more companies using \"Sign in with Apple\" which I'm all for.", "I’m really excited for coffee shops and fast food places with seating to use App Clips for ordering for a more seamless experience.", "Did anybody else immediately think of this during the App Clips segment: https://xkcd.com/1367/", "From the article: \n\n> App Clips themselves don’t need 5G. Apple requires them to be 10MB max, so they will download quickly on existing LTE networks.\n\nJust for kicks I checked the size of the ~500-word article itself: 10.3 MB. That's right, this one web page about App Clips is itself too big to be an App Clip. \n\n5G isn't going to enable a new approach to apps; it's going to enable even more ads and trackers to be crammed into web pages.", "Does anyone know what happened to Instant Apps on Android. Loved the idea, never really got popular on Android (as is common), I’m assuming this is pretty much the same?", "This feels like an advertisement at this point. 5g is now a buzzword for anything tech related.", "5G doesn’t have anything to do with App Clips. They weigh just 10 MB and are perfectly downloadable via 3G.\n\nIf people don’t have any trouble with downloading 10 MB videos from Reddit with current tech, they won’t have any problem with App Clips.", "“Yup, App Clip!”", "Can you imagine the implications when you include/combine ARKit4 improvements, U1 chip technology, App Clips, and then get it all coordinated with glass?! \n\n5G use case implications aside, Apple has the ability to offload all the processing to the iPhone - you could interact with your environment utilizing all these tools just by looking. You could purchase things with a glance. This IS exciting!", "I agree this feature is actually exciting. I for one don’t have many apps on my phone, and I don’t like having to install and have them if using every once in a while, so this approach for me would work perfectly.", "An under-reported part of App Clips is that they can be part of Place Cards in Apple Maps.\n\nSo if developers implement it properly, you could just lookup a coffee shop or fast food place in Apple Maps, and have the App Clip for the business open right in Maps and order from there.", ">\t5G isn’t going to enable a new approach to apps; it’s going to enable even more ads and trackers to be crammed into web pages.\n\nIt seems like Apple’s actively taking steps to prevent that from being the experience though.", "[deleted]", "[Still going](https://developer.android.com/stories/instant-apps). I expect there will be more adoption now that Apple has an equivalent feature.", "Instant apps are a different idea than what I remember seeing App Clips is. Instant apps are super seamless. When you click on a url it can launch you into the instant app. They also let you try out games before installing completely. Its used extensively in Google Play Games so you can test out games it recommends before you install. I dont remember a ton of websites linking to instant apps but I do remember listings in the Play Store having it. \n\nI’m expecting App Clips work out cause Apple is really pushing for it to be a way to interact with the real world and everyone has iPhones in the US.", "Maybe dead 💀", ">\tApp Clips are ... a new paradigm of app development that will become richer with 5G. With App Clips, Apple developers have to start thinking about what code actually needs to reside on a device\n\nThat’s a legitimate discussion to start.", "This is exactly the sci-fi stuff I was talking about! The glasses will be the missing link to tie it all together. All I kept thinking about during the presentation of App Clips and changes to Maps was how awesome it would be to hop on your bike or scooter rental, scan the tag with your phone or watch and then get a HUD on your glasses of your travel path to your destination, along with indicators of upcoming stairs and other things they demonstrated. Or going into an office building or department store, scanning their tag, and getting directions to a certain office or product in the store on your glasses. Things are going to get insane over the next 5 years or so I think.", "Even better!", "You are right that LTE is fast for most use cases the problem is capacity. The carriers are running out capacity. It is like a traffic jam on the freeway. Freeways are fast (LTE) when it isn’t rush hour. 5G is adding more lanes on the freeway so that everyone can have fast speed all the time.", "Honestly, I'm still fine with 3G. Love that tech is progressing, but I don't really have a use for faster mobile speeds yet.\n\nMaybe that very tech will enable entirely new use cases in the future though, and that's exciting.", "I’m looking forward to it."]}, {"title": "So i made an instant camera hybrid app that allows you to take a film-like photos, digital-like photos, or best of both worlds combine! Supports app clips and widget", "comments": ["If you want to try the app clips, head to www.kontax.cam", "Downloaded! This is a very rad app. Is there going to be an option where you can add photos you've already taken?", "Also live on product hunt! Would love some appreciation there if you could 🙌 https://www.producthunt.com/posts/kontax-cam-for-ios", "Hi, does “Lab” section has any editing/develop options, or is it just a “folder” that’s holding photos (if there are no extra options, then saving straight to Photos would be a much better/user friendly)?\n\nAlso - can I pick Colour Leak color or it will always be red?\n\n\nThis app looks like a mix of Lomograph, VSCO and stock camera minus editing/flexibility. Overall- good job, but I can get much more from a stock Camera app (or Moment) + [Lomograph](https://apps.apple.com/pl/app/lomograph-retro-photo-editor/id1291776269) (best filters/analog film emulation I’ve seen so far - add [Focos](https://apps.apple.com/pl/app/focos/id1274938524) into the mix and start fooling people that you’re shooting with an old DSLR ;)\n\nI hope your app will grow nicely as I like how it looks (B&W filters are nice as well). Good job!", "i love the design. great job", "Just downloaded it, but can’t use the other filters.\n\nEdit: oh my bad I didnt see they were $1.99 to unlock each filter set... ill maybe try it when theres the feature to import pics... filters look great btw congrats", "I got \"app clip unavailable\" not sure if it's just me or everyone though", "That looks like a cool app. I just downloaded it", "Looks great, can’t wait to play around with the black and white collection!", "Thanks for the kind words! Yes that feature is on my roadmap(: basically, import a photo, select desired filter + effect(s), and done!", "Hi there!\n\nThanks for checking the app and enjoying it. Lab will surely improve in the future, there are lots of potential to it! \n\nYes, you can customise almost every effects by long-press it. Sorry i should have made it clear (although i did put a 'tip' label on the effects information screen).\n\nIt is indeed a mix of everything, it's very new and young, so i'm keen to see it progress in the future when new features and improvements will be added (:", "Thank you! Appreciate it🙌", "Other filter collections can only be unlocked via iap. But you can try them to see which one you liked most", "Thank you!🙌", "Awesome! The BW collection is one of my fav, i’m quite happy with how it renders on screen!", "Oh, a long press - I should have tried that :D\n\nBTW: Option to change exposure with a swipe would be really handy in a future update.", "No problem", "that's alright, maybe i should've done a better job at making sure that the users are able to discover that feature 😅\n\nAnd yes, that's on my roadmap. Future update! 🚀"]}, {"title": "These iOS 14 apps offer home screen widgets, App Clips, and much more", "comments": ["I love the TripIt widget that can show your next ~~fight~~ flight and updated gate. I used the Siri shortcut “what’s my gate” a lot. \n\nNot that I’ll be asking Siri this for a while now.", "Current iOS 14 home screen widgets are good", "Juwt waiting on Audible.", "I wish Carrot had App Clips. People send weather forecasts all the time. Just this morning, my mom asked what the weather here was like and I sent her a screenshot of carrot. Would be nice if she could get a little app clip.", "It’s nice to see that, without fail, Apple adopts tech 10 years after its debuted on other OSs", "[deleted]", ">\tshow your next fight\n\nPerfect for those UFC Fighters.", "Carrot Weather has an iMessage App.\n\nIt should be ready to go:\n\nhttps://www.howtogeek.com/272077/how-to-install-manage-and-use-imessage-apps/", "What’s your point?", "[deleted]", "Haha oops. \n\nWell you know, crowded airports, pre-pandemic.", "[deleted]", "[deleted]", "How is it neoliberal exactly?\n\nOn top of that, no one is acting like Apple invented this. You’re arguing against no one. Feel free to stay mad for no reason, though. Seems like a fun way to live.", "[deleted]"]}, {"title": "Exclusive: TikTok could be testing out App Clips", "comments": ["[deleted]", "Can confirm. My sister and I are avid TikTok users and whenever she sends me a link through iMessage I can see the the App Clips banner below the thumbnail.", "Nice, seems like the perfect app for it. I imagine it will just be a Tiktok player so you don’t have to open safari, maybe with a sign in/up feature", "Isn’t tiktok a bunch of clips it seems redundant", "Tim Tom is stupid fucking cancer Jesus Christ", "#Exclusive  \n\nWow. Great journalism!", "oof that roast", "I don’t get it... I guess at 34 I’m officially old. But what is an app clip?? I had tiktok for a week and it was ok... kinda boring so I deleted it but it’s basically clips with music. Not sure what an app clip is though at all.", "Yeah I’m not a big tiktok user so having this clip thing would actually be pretty nice so I don’t have to put the app on my phone just for when people send me stuff", "Wasn’t even meant as a roast lol, but i like it!", "It's a miniaturized version of the app that doesn't need to be installed, it's like a web app, someone sends you an imessage with a vid from the app and that vid will open an app clip and play inside of it.\n\nGives much more ability to interact with content outside of an app"]}, {"title": "Flutter iOS App Clips Tutorial", "comments": ["Hi\n\nThe github link in the description is not working.\n\nBrad", "Doesn’t this defeat the purpose of the app clip? Flutter apps have some minimum bundle size of several megabytes, and app clips should be as small as possible.", "Very cool! I'm looking forward to when all those steps get bundled into one command!", "Hey man,   \nGreat video.   \nI understand that it's in very early stages but an explanation of why things are done the way they are done would've been helpful.  \nSince it's mostly just a video representation of [Steps Described](https://github.com/flutter/flutter/issues/60029#issuecomment-652093356)", "As long as a standard Flutter iOS app is larger than 10 MB, you cannot create App Clips using Flutter. AFAIK, the \\`.ipa\\` of a minimal app currently measures \\~11.9 MB which is too large. And even if you'd be able to ship a 9,9 MB clip, the whole idea is that the app loads immediately like a (good) web page and that requires IMHO an app size < 1 MB. I dare to say that this is impossible with Flutter.", "i’ll fix it", "Actually the video is made just to demonstrate to process. You are definitely not going to make an app clip for the entire app."]}, {"title": "App Clips - Apple Developer", "comments": ["❌App Clips\n✅Appetizers", "I love the focus on the user experience here", "I thought they said Applets at first during the conference until they showed it in text\n\nApplets is a way better name imo lmao", "Google did the same stuff several years ago, then I never heard of it a single time. Plus, I don’t see companies paying for an instant app that is limited to 20% of the market share", "Drake meme", "2010 Apple would have definitely used this name", "They really dropped the ball here right", "Games work with it. Google has had success with it", "Companies tend to follow Apple. Google may expand and push their version again and then companies will suddenly be able to access way more than 20% of the market.", "I can hear Phil Schiller saying it on stage"]}, {"title": "How to Create App Clips for iOS 14 in React Native", "comments": ["How much of the 10mb does packaging RN eat into", "Oh man i was waiting for this", "And PAY 30% cut to Apple because they say so", "[deleted]", "About 7mb", "Is your point that App Clips is trying to claim a 30% stake that they haven’t had up to this point?", "[deleted]", "I don’t know what you are yelling with all caps. Maybe that is why they are downvoting you. \n\nI have four apps published across as many years. So I’m intimate with Apple’s App Store revenue model. \n\nYet I’m trying to get to your exact point. Apple has taken 30% cut since the beginning for certain types of apps. This isn’t new information. \n\nOne could make the case that the type of scenarios Apple may be going after with App Clips are those that typically would transact on the Web. \n\nIs this what you are getting at or are you just complaining in general?", "Ok mate , I cannot understand why programmers support this business model in which you and me code for hours/days as slaves to publish an app and then see how they take such a % by clearly practicing bad-monopoly business strategies ....it is a scam and us (developers) should never ever foment the continuity of this kind of business models.... the guy & people upvoting him ard just doing that...Cannot F understand ..", "Got it. And I agree with you. Apple deserves a cut for creating the platform. But 30% is excessive. Very excessive. \n\nHowever, I think downvotes are that you aren’t contributing to the thread’s content and hijacked it to stand on a soapbox. And to be clear again, it is a message I personally can get behind. \n\nAs a suggestion, perhaps pen a message and start your own thread in the subreddit? One that links to how the policy affects react native developers specifically."]}, {"title": "Create App Clips for iOS 14 in React Native", "comments": ["Good info. Thank you!", "How well does it deal with memory limitations for app clips? That's the main issue running RN as other extensions, like widgets.", "How did you get the size so small? Even an empty RN app is 12 mb or so (off top of my head).\n\n\nYou say you removed some pod files. Which ones?", "I'm confused. Are App Clips just widgets in Android?", "your welcome. I hope it helps :)", "I exported App Clip and parent React Native App. RN app size 1MB and App Clip app 833KB. I  also add in my medium post. Thanks for pointing out.", "Well , empty RN (iOS) app is 5mb without app thinning. I didnt removed any Pod. but for App Clip I may remove some of them. for now didnt optimize any thing.", "App clip without app thining is 1MB.", "Nope. Android equivalent is Instant apps.", "I'm more worried about memory consumption due to the javascript runtime, my apps usually idle at over 200MB, so that would be a no-go for extensions.", "as I understand limitiation for app size not for memory consumption. Widgets are different story. but i also tested official example from Apple memory at around 282 MB. my example was around 10-12MB."]}, {"title": "The Yelp App Clips that were shown at WWDC are starting to show up in placecards", "comments": ["And yet I still can’t look at more photos of a place with downloading the Yelp app.", "mmmmm....and now I can't stop thinking about soupy dumplings....", "But don't you think that has more to do with Yelp \"owning\" those pics?  As more folks leave reviews directly on Maps, those are the pics you will always see.  Apple doesn't own Yelp and I'm sure that was part of the deal for even letting Apple synch Yelp to Maps in the first place.\n\nIt will slowly go away.", "I mean, Google shows images from websites it doesn’t own. I just wish when you tap the pictures it sends you to the web version to see the pictures, or just show the pictures with a huge Yelp watermark.", "Google shows thumbnails that open the original website when clicked. So it’s pretty much the same behavior.\n\nAlso Google is scraping websites, whereas Apple is almost certainly using Yelp’s API, which at their level of usage is going to have a contract."]}, {"title": "Phoenix 2 demo using App Clips. This will become the new norm for iOS demos", "comments": ["“Couldn’t connect to a helper application.”\n\nLove the idea though. I somehow didn’t consider the implication of app clips for games.\n\nEdit: Must have been a blip; works fine. Absolutely the future of demoing games.", "Very impressed. Took a while to load, but overall this is big for trying games before you downlaod", "I see no banner. And yes im in safari in iOS14 and no I dont have the game installed.", "Doesn’t work for me.", "How long did it take? Mine was 2 seconds", "Mine took at least a minute, but I’m currently on school wifi"]}, {"title": "Have folks encountered good AppClips examples, yet?", "comments": ["https://www.firigames.com/phoenix2 This game/App Clip is really good.", "With Quarantine, haven’t been outdoors too much so I haven’t spotted them yet but I can only hope local zoo’s or parks are implementing them instead of those stupid audioguides", "My app, kontax cam, has an app clips which i think has a really good use case! Check it out here www.kontax.cam", "I was trying to find an example one too, from the WWDC talks I gathered that you could have invocation URL’s that could redirect you to the App Clip but I’m yet to see a working example.", "Not seen them in the wild at all. My hope is cR parks with apps use them and perhaps public transport to get info from a specific bus or train station. I guess in current climate, companies are hesitant to spend money on projects that work best when people are out and about\n\nEdit: i tell a lie. I did play a game on appstore using it. Was cool being able to test without full download", "Wow, that’s awesome. I didn’t expect App Clips could also be used as a demo for a game", "**I found links in your comment that were not hyperlinked:**\n\n* [www.kontax.cam](https://www.kontax.cam)\n\n*I did the honors for you.*\n\n***\n\n^[delete](https://www.reddit.com/message/compose?to=%2Fu%2FLinkifyBot&subject=delete%20g8s6aoz&message=Click%20the%20send%20button%20to%20delete%20the%20false%20positive.) ^| ^[information](https://np.reddit.com/u/LinkifyBot/comments/gkkf7p) ^| ^<3"]}, {"title": "App Clips", "comments": ["If you use Apple Maps, and search up Panera, an app clip will pop up which you can order off of.", "What exactly are App clips? Are they like web clips? i keep seeing the term used in various places but no one explains what they are.", "It has to do with Apps available in the App Store. An App Clip lets you take temporary use of the app’s feature without having to download the app and store it on your phone maybe never getting used to it. Example: instead of downloading an app to rent a scooter or call a taxi, you can use the app clip so you can do what you need, all without having to ever download the app.. hope it’s clear", "I’m not sure what a web clip is but an app clip is like part of an app. So instead of downloading the full app to use maybe once, you get the app clip and do your thing and then the app clip goes away - if you want to then download the app you can! \n\nI think in the WWDC or a different event they used the example of paying for a rent a bike type thing, they scanned a QR code and the app clip loaded where they could then use Apple Pay to rent the bike. \n\nWWDC Video on App Clip here: https://m.youtube.com/watch?v=cxqZrKzAZhU\n\nInfo on app clip here: https://developer.apple.com/app-clips/"]}, {"title": "How to Create App Clips", "comments": ["Great writeup! Just wondering, if you were to actually publish the app with the app clip, you'd need to actually own the [scooter.app](https://scooter.app) domain name right?", "Thanks. Glad that you like it :)  \nYep, you're right. You need to have access to the actual domain if you want to submit an app to the App Store."]}, {"title": "[Discussion] This Twitter thread has a bunch of indie apps with iOS 14 features support (widgets, app clips, etc)", "comments": ["🧵 We're getting close to the iOS 14 &amp; macOS 11 release, which makes now a great time to show off the apps/projs you've been working on all summer, especially when reviewers are looking for things that showcase neat new technologies. Reply with screenshots and I'll happily share!\n\n***\n\nposted by [@stroughtonsmith](https://twitter.com/stroughtonsmith)\n\n^[(Github)](https://github.com/username) ^| ^[(What's new)](https://github.com/username)"]}, {"title": "ExxonMobil now using App Clips NFC tags at the pump", "comments": ["Not sure if this will work on Samsung Pay.", "I think it will just bring you to download the app on Android (heard it doesn’t support Android’s version of App Clips)."]}, {"title": "Exclusive: TikTok could be testing out App Clips", "comments": ["They definitely look like they are. Sending tik toks through iMessage look way more like app clips than before", "But it won't matter since TikTok is getting banned! /s", "Yeah I've noticed the logo also has the app clip pattern around it"]}, {"title": "Anybody figure out how to invoke App Clips?", "comments": ["The website has to have it set up. I was under the Impression you’d be able to download or clip a sample of the app but I think I was wrong \n\nIt looks like “clips” is on the developer side of things. Ie: you’re parking in Dallas on vacation. Pay to park is “Dallas park app”. You go to the website or there is a QR code on the meter and you “clip” the app to pay for parking. No need to download the app since your only there for 3 hours to see your wife on work release from the institution.", "Yeah I read about that as a common use case as well. I’m hoping someone has encountered one I can trigger somehow without having to be in an exact location but maybe it’ll just take some time for places to start implementing. I live in nyc which normally would be a place where this stuff happens early on but also everything is so weird with covid so who knows when.", "Yep. I know it sounds stupid but this was a added bonus being stuck in the house. I have been playing with it and changing my home screen, messing around with widgets I also keep updating apps because every day new apps have added widgets to the application. I use Apollo for Reddit set up or what is it with quick links to subcredits.\n\nhttps://i.imgur.com/Sx0ayr1.jpg"]}, {"title": "App clips feature on iOS 14", "comments": ["Basically if theres a small part of an app you need to access but you don’t have that app downloaded, you scan the nfc tag thing and it pops up with the page you needed to get to without actually installing the app. I think thats what it is", "It’s all detailed in the keynote?", "Go watch the developer conference like everyone else big boy.", "Thank you! And thank you for an actual decent response, rather than others that Were snotty!", "No problem! I didn’t understand it too at first so i don’t see the point in being annoying", "I know, forum for discussion and to help people with the beta’s, no need for some people’s attitudes to some questions", "Exactly. Don’t reply if you’re not saying anything useful", "I’m glad someone agrees with me!"]}, {"title": "iOS App Clips tips from Guilherme Rambo", "comments": []}, {"title": "How to Create App Clips", "comments": ["Very nice ineed."]}, {"title": "How to Create App Clips", "comments": []}, {"title": "How do App Clips work? Have they been enabled yet?", "comments": ["App clips are small versions of apps with limited usage. Right now they can only be found with a TestFlight app. The only app I know of that has App Clips to test is Unwind.\n\nYou wont be seeing any official ones until iOS 14 is publicly released.", "Thanks for explaining. What I’ve read online has been somewhat vague (to be fair, I haven’t looked too hard for info). I appreciate it!", "Parcel is also testing out their App Clips", "No problem. The best way to look at them is like a limited demo for an app to get a taste for it that will then let you download the full app to get the whole experience.\n\n[Unwind currently has 3 different App Clips that they’re testing, giving you a look into what it can do before you commit and get the full app.](https://i.imgur.com/bCNGgB8.jpg)\n\nYou can’t have both an App Clip and the full app at the same time and iOS treats them as one and the same.", "Oh, nice. I didn’t even notice it was added and I’m testing that app as well."]}, {"title": "ExxonMobil now using App Clips NFC tags at the pump", "comments": []}, {"title": "Apple App Clips in RN possible?", "comments": ["[This article](https://www.monterail.com/blog/create-app-clips-react-native) is the best I've found so far", "This article is helpful: https://medium.com/@nazrdogan/create-app-clips-for-ios-14-in-react-native-abfade233fea"]}, {"title": "[Feature] iOS 14 Dev Beta 1 - App Clips settings pane - apps are removed 30 days after use", "comments": ["If you’re going to insist on screenshotting everything please do so in English. Reddit is an English speaking platform and all these images are a) going to be reposted otherwise b) of a lot less help since we can’t read it\n\nPlease Make your settings English based temporarily if you’re gonna flood the sub", "[deleted]", "It has nothing to do with being american. This is a predominantly English speaking platform! Every single image he posts is foreign and sometimes there’s a lot of detail we can’t grab. And then someone else posts it again in English and you get double the clutter. Move to another platform if you don’t think it should be mostly English but this one is"]}, {"title": "How do I find App Clips?", "comments": ["I googled this same question a few days ago just to see what they were like. Ended up trying an app clip for some game, the app clip banner to play it appeared in safari under the address bar on top of the screen when I was on the developers site. The game was alright, I understand app clips now, and my take on the concept is that until there’s a really useful situation for them (I don’t go to Starbucks so apples example of being in line there and quickly using their app clip for rewards and stuff isn’t for me) it’s nice that it’s an option for developers to be able to take advantage of, definitely, but it’s not really useful enough yet to the average user. In a couple years as long as support exists for it which it probably will, I assume, I’m sure there will be more situations I’ll find it handy in, but just not now. It would be cool to have it where you can demo any app in the App Store or something like that, but the logistics of building that type of thing up sounds like way too much to hope for soon\n\nEdit: the game I played was called [Phoenix 2 by Firi Games](https://firigames.com/phoenix2)"]}, {"title": "Are Apple's `App Clips` fit for simple hyper casual games?", "comments": ["[https://toucharcade.com/2020/09/25/phoenix-2-app-clip-game-demo/](https://toucharcade.com/2020/09/25/phoenix-2-app-clip-game-demo/)", "Nice. It seems that apps clips can go much further that I had thought!", "yeah. not sure if there are any code examples of doing something like that, but it seems people trying out the clip are downloading the game. tho that one is free to play."]}, {"title": "Exclusive: TikTok could be testing out App Clips", "comments": ["[deleted]", "What kind of issues are you having with iOS 14?", "[deleted]", "Oh damn, that sucks. I’m sorry to hear you’ve been having that many issues. I’ve definitely had that notification issues with messages but I can’t say I’ve heard of the rest. I hope your issues get resolved soon"]}, {"title": "These iOS 14 apps offer home screen widgets, App Clips, and much more", "comments": ["How about these [200+ apps](https://appraven.net/collection.php?listId=5f62faa619f82c022915816a)?", "Thanks for sharing :)"]}, {"title": "These iOS 14 apps offer home screen widgets, App Clips, and much more", "comments": ["Hopefully AutoSleep gets updated as well"]}, {"title": "Has anyone tried App Clips in the new beta?", "comments": ["I’m not surprised it’s not there yet. App Clips seem to revolve around third party apps. There’s no need for App Clips on stock apps.", "It relies on the outside world like restaurants & scooters & stores & hotels...\n\nThose 3rd parties need to develop their own App Clip. I dont think NOBODY has done it in 2 days since the beta was presented.\n\nI'd expect the first Clips to be available arround Early August? Hard to guess, but that would be my call.", "Oh damn... I thought App Clips didn’t depend on the third party apps... kinda like how Siri uses Shazam for finding songs", "Well they won’t depend on third party apps when the functionality actually exists, but third party app developers probably don’t have any app clips ready for use yet is what I meant.", "Makes sense"]}, {"title": "App Clips looks like a powerful new feature. Does anyone have any details on if developers have access to launch another app's App Clip from within our own app?", "comments": ["Based on the following API documentation, you have different ways to invoke the app using the URLs.\n\n [https://developer.apple.com/documentation/app\\_clips/responding\\_to\\_invocations](https://developer.apple.com/documentation/app_clips/responding_to_invocations) \n\nIt's not clear if these invocations can be called from other apps, but based on the following document under the heading of  \"Identify URLs for Your App Clip to Support\", if you are partnering with someone and if they register your url, it seems that your question is possible.\n\n [https://developer.apple.com/documentation/app\\_clips/configuring\\_your\\_app\\_clip\\_s\\_launch\\_experience](https://developer.apple.com/documentation/app_clips/configuring_your_app_clip_s_launch_experience) \n\nBut of course it's best to try it out with a sample app.", "This is probably all the information we have on App Clips so far. https://developer.apple.com/documentation/app_clips\n\nKeep an eye on the WWDC videos though"]}, {"title": "Apple iOS: Codes für App Clips können nun von Entwicklern erstellt werden", "comments": []}, {"title": "App Clips looks like a powerful new feature. Does anyone have any details on if developers have access to launch another app's App Clip from within our own app?", "comments": ["They have a [create app clips for other businesses](https://developer.apple.com/wwdc20/10118) video this week. \n\nIs that what you mean?", "Pretty sure they said you can launch an app clip from a special URL, and an app can open any URL, so it should be possible."]}, {"title": "AppClips sighting—first time I’ve seen them in use [X-Post From /r/iphone]", "comments": ["**[Original Submission by /u/cooperthekid](/r/iphone/comments/kn70cl/appclips_sightingfirst_time_ive_seen_them_in_use/)** into /r/iphone\n\n---\n\n# Subreddit Overview\n* A community for: **12 years**\n* # of subscribers: **2,877,984**\n* # of mods: **22**\n* Subscribers per mod: **130,817**\n\n# Popular Posts Summary\n* Top domains: self.iphone **(55%)**, i.redd.it **(9%)**, 9to5mac.com **(6%)**\n* % NSFW: **0%**\n* Average Score: **615**\n\n# Discussion Summary\n* Average Comment Length: **~39** words per comment\n* Flesch-Kincaid Reading Level: **4**\n* Comments per post: **~83**\n\n# A sampling of top posts:\n* Top all time: [Now you can cook on it (45771 points by /u/killswitch13)](/r/iphone/comments/d2cg5w/now_you_can_cook_on_it/)\n* Top this month: [Let's appreciate Apple for making distinctive and instantly recognizable app icons unlike Google (21923 points by /u/izenil03)](/r/iphone/comments/kiuwnm/lets_appreciate_apple_for_making_distinctive_and/)\n* Top this week: [Christmas present me and my brother made for our dad showcasing the first iPhone that he ever had (13389 points by /u/achisto)](/r/iphone/comments/kkh662/christmas_present_me_and_my_brother_made_for_our/)\n\n## **[Subscribe at /r/iphone](/r/iphone)**"]}, {"title": "Why do app clips require you to set up a website? Why doesn't Apple give you a URL that you can use?", "comments": []}, {"title": "Japanese café uses Apple’s new NFC App Clips to let customers order and pay with their mobile phone", "comments": []}, {"title": "App Clips WWDC Session 🔥", "comments": []}, {"title": "iOS 14’s App Clips will save you from always needing ‘an app for that’", "comments": ["[removed]", "Sorry, your submission has been automatically removed. New accounts are not allowed to submit content. This is to combat spam.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/techcrunch) if you have any questions or concerns.*"]}, {"title": "Apple App Clips", "comments": []}, {"title": "Here’s why Apple’s new App Clips are about to change apps as we know them", "comments": []}, {"title": "App Clips.", "comments": ["They haven’t been released yet.", "There won’t be any until public release of IOS 14 and even then there will probably still be a little time for developers to push them out."]}, {"title": "App Clips: Hands On with Multiple Apps", "comments": ["Cool Video\n\nSubbed you\n\nI woud love to have some feedback on my video.\n\nYou can sub also if you like the content\n\nTop 6 Indian Famous Failures before Success\n\n[https://youtu.be/0SE5bU2Du0o](https://youtu.be/0SE5bU2Du0o)"]}, {"title": "App Clips on watchOS", "comments": ["App Clips is only for iPhone, actually.\n\nIt’s a way to discover apps without downloading the whole version of the app by simply tapping the iPhone or scanning the code using its camera.\n\nThe watch is way too small for App Clips to demonstrate their value. It’s not an ideal device for App Clips’ purpose."]}, {"title": "Is there currently any app that has implemented App Clips and/or is this even released for development yet?", "comments": ["I think they need to be approved like App Store apps, so you need to wait until official release as you can’t test this with TestFlight"]}, {"title": "iOS 14 - Widgets | App Library | Compact UI | App Clips ..and more. Link to full post in COMMENTS 👇🏻. Follow us @applenews_in on Twitter | Instagram | Facebook | Reddit #Apple #AppleIndia #AppleNews #AppleNews_IN", "comments": ["To See The Full Post 👇🏻\n\nInstagram [https://www.instagram.com/applenews\\_in/](https://www.instagram.com/applenews_in/)\n\nTwitter [https://twitter.com/applenews\\_in/](https://twitter.com/applenews_in/)\n\nFacebook [https://www.facebook.com/AppleNewsIN/](https://www.facebook.com/AppleNewsIN/)"]}, {"title": "@NBCNews: Conspiracy theories around the \"deep state,\" billionaire Democrat philanthropist George Soros and QAnon have become a constant fixture on Spanish-language YouTube programs, WhatsApp clips and pro-President Trump Facebook groups aimed at a Latino audience. https://t.co/N3oilvD6ab", "comments": []}, {"title": "App Clips iOS 14 in NZ", "comments": []}, {"title": "How to Create App Clips for iOS 14", "comments": []}, {"title": "Learn how to present from Apple| my analysis of how apple structures their app clips presentation.", "comments": []}, {"title": "App Clips could be a Trojan Horse for Sign In with Apple", "comments": []}, {"title": "App Clips - Apple Developer", "comments": []}, {"title": "@NBCNews: Conspiracy theories around the \"deep state,\" billionaire Democrat philanthropist George Soros and QAnon have become a constant fixture on Spanish-language YouTube programs, WhatsApp clips and pro-President Trump Facebook groups aimed at a Latino audience. https://t.co/N3oilvD6ab", "comments": []}, {"title": "App Clips for iOS", "comments": ["There is a [discussion on Hacker News](http://news.ycombinator.com/item?id=23630775), but feel free to comment here as well."]}, {"title": "Playable demo for space shooter 'Phoenix 2' available via App Clips", "comments": []}, {"title": "App Clips for iOS", "comments": []}, {"title": "Introducing App Clips", "comments": []}, {"title": "Apple launches \"App Clips\": mini apps to discover and onboard new users offline/online", "comments": ["This would be useful for some wallets and other crypto-related services."]}, {"title": "CNET: We got iOS 14 early: Hands-on with widgets, App Clips and other new features - CNET", "comments": ["CNET/CBS Interactive reserves all rights to any CNET publication and logos.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CNET_ALL_RSS) if you have any questions or concerns.*"]}, {"title": "App Clips - Apple Developer", "comments": ["Is this something like Android Instant Apps?"]}, {"title": "The official subreddit for Apple App Clips", "comments": ["Thank you for posting to /r/promotereddit.\n\nHowever, as reddit.com is not in your payment plan, your post has been removed by your ISP. Please spend $5 a month to post on this subreddit.\n\nJust kidding. But seriously, this **could** be the future one day.\n\nIf you believe in Net Neutrality, please go to https://www.battleforthenet.com/ .\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/promotereddit) if you have any questions or concerns.*"]}, {"title": "iOS 14 preview: Hands-on with widgets, App Clips, Back Tap and picture-in-picture", "comments": []}, {"title": "@TechCrunch: iOS 14 reimagines how you find and use apps with App Clips, widgets and an App Library https://t.co/GGXQFLVWxE by @sarahintampa", "comments": []}, {"title": "iOS 14 reimagines how you find and use apps with App Clips, widgets and an App Library", "comments": []}, {"title": "Apple App Clips", "comments": []}, {"title": "Introducing App Clips", "comments": []}, {"title": "CNET: App Clips get you the apps you need right when you need them video - CNET", "comments": ["CNET/CBS Interactive reserves all rights to any CNET publication and logos.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CNET_ALL_RSS) if you have any questions or concerns.*"]}, {"title": "The impact of App Clips and Widget Kit on App Marketeers and developers - Widget Kit -> a huge retention tool, App Clips -> ability to better advertise your apps in the physical world.", "comments": []}, {"title": "Can I develop App Clips Now?", "comments": ["Hi, there is an upcoming event for app clips, you can find it here https://appmeetups.com/"]}, {"title": "App Clips for iOS", "comments": ["Welcome to r/patient_hackernews! Remember that in this subreddit, **commenting requires a special process:**\n\n1. **Declare** your intention of commenting by posting a _**pre-comment**_ containing only the single letter **`R`**. _(This pre-comment will not be visible to others.)_\n\n2. **Wait 24 hours** or more (you will receive a reminder).\n\n3. You can then **post a new comment with your actual reply** in the same location.\n\nComments that don't abide by the 24h delay will be automatically removed.\n\n**NOTE:** since step 3 is not mandatory, pre-comments can also be left as a way to **set up a reminder** to check up on the discussion in 24h.\n\n[More information](https://www.reddit.com/r/patient_hackernews/comments/fgwtlh/welcome_to_rpatient_hackernews_readme/) on how this forum works.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/patient_hackernews) if you have any questions or concerns.*"]}, {"title": "App Clips support?", "comments": []}, {"title": "@TechCrunch: iOS 14's App Clips will save you from always needing 'an app for that' https://t.co/Jr0LZSZf8L by @sarahintampa", "comments": []}, {"title": "Day Two at WWDC 2020: Take a deep dive into WidgetKit and App Clips – Apple", "comments": []}, {"title": "App Clips could be a Trojan Horse for Sign In with Apple", "comments": []}, {"title": "App Clips: iOS bekommt schnelle Lite-Apps für den Instant-Gebrauch", "comments": []}, {"title": "CNET: App Clips in iOS 14: You can stop downloading iPhone apps you only use once - CNET", "comments": ["CNET/CBS Interactive reserves all rights to any CNET publication and logos.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CNET_ALL_RSS) if you have any questions or concerns.*"]}, {"title": "App Clips - Apple Developer", "comments": []}, {"title": "Apple's App Clips: another way to start an Augmented Reality experience", "comments": ["Related:\n\n2018: Google’s bringing augmented reality support to Instant Apps\nShoppable products in AR straight from search results\nhttps://www.theverge.com/2018/5/8/17326260/google-play-instant-apps-ar-android-update-new-features-arcore-no-download-io-2018\n\nBrands are also working with Google Lens to start AR experiences: \nhttps://www.levistrauss.com/2019/12/17/amplifying-in-store-storytelling-with-google-lens/\n\n2020: Huawei Quick Apps is Huawei’s alternative to Google Instant Apps\nhttps://www.xda-developers.com/huawei-quick-apps-alternative-google-instant-apps/"]}, {"title": "App Clips could be a Trojan Horse for Sign In with Apple", "comments": []}, {"title": "CNET: WWDC 2020: Apple introduces App Clips for iOS 14 - CNET", "comments": ["CNET/CBS Interactive reserves all rights to any CNET publication and logos.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CNET_ALL_RSS) if you have any questions or concerns.*"]}, {"title": "CNET: App Clips for iOS 14: There's an app for that, but you don't have to download it - CNET", "comments": ["CNET/CBS Interactive reserves all rights to any CNET publication and logos.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CNET_ALL_RSS) if you have any questions or concerns.*"]}, {"title": "[iOS14 DB6] Unwind's App Clip in action using an NFC tag", "comments": ["I've also [written a walkthrough](https://kushagra.me/testing-app-clip-cards-with-nfc-tags/) on how I got it to work. If you're a developer looking to add NFC support for App Clips, feel free to reach out!\n\nEdit: That's a funny looking award, haha! Thanks, stranger :)\n\nEdit #2: Thank you for another award /u/Hi_Dan11\n\nEdit #3: Thank you /u/badhache /u/BenSova /u/BaconDutchess /u/mausv /u/MAVERIK___ /u/jeromeof\n\nEdit #4: [Here's the TestFlight link](https://testflight.apple.com/join/g6EBWpjP) if you're looking to test App Clips!", "So much potential with these for payments in restaurants etc without having to download a different app every time.", "Wow, they nailed the sound and speed.\n\nHow large is your App Clip that it loads so fast?", "amazing!", "That’s awesome. Totally forgot about App Clips.", "This is amazing! I can’t wait to start seeing businesses use these", "Apple never fails to surprise me with how it makes sure all the advertised features work just as planned, unlike inferior devices that fail or need multiple trials to do a task featured in one of their keynotes.", "This is why App Clips will rule the world. They’re so simple, yet so helpful. \nJust one question though: Where do you think someone would put this App Clip tag/code?\nI think I’d be nice in hotels so no one has too much energy and is running around ruining my sleep. “Scan this code to calm down with Unwind, the best app for you to calm down (or calm up).”", "Any other apps with App Clips I can test right now?", "Beautifully designed app. Nice!", "Would it burden/mess with your website if you allowed access from other users for a fee? I don’t want to host a website and I’m not a developer, so I can’t attempt this", "😍😍😍", "I really love Unwind! Especially the watchOS app!", "Wait this is so cool. Could you do things like put NFC tags with certain hue lighting setups so someone who isnt on my homekit could just tap the wall and change the light settings?", "Unwind isn’t in Wind Down shortcuts. 🥺", "OP: The title of your post must include the beta version your device is running. If it does not, please delete your post and try again.\n\nOther users: Please report this post if it includes a Bug, Feature, Fix, or Workaround flair but does not include the beta version running on OP's device in the title of the post.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iOSBeta) if you have any questions or concerns.*", "Looks awesome! Really well done! Side question: what brand / model NFC tag do you use?", "Is there a TestFlight link to this? Do developers only have access to creating App Clips?", "Can’t you already just use Apple Pay and the Wallet?", "I love the sound/haptics too—something is very satisfying about it.\n\nThe App Clip is downloaded using TestFlight/Xcode, so it's already on the device. Hence it doesn't require a download.\n\nHowever, once the App Store allows the uploading of App Clips, I am sure every App Clip will download super fast since its size limit is 10MB. Unwind's App Clip is about 6MB.", "App Clips have a 10mb limit, so it should always load this fast!", "thank you!", "Thank you!", "What are you asking?", "Looks like this guy\n\nhttps://shop.linqs.in/NFC-tags/linqs_amaze_nfc_tags", "Thank you! I bought [these NFC tags](https://www.amazon.in/gp/product/B06XD4BDFX/ref=ppx_yo_dt_b_asin_title_o00_s00?ie=UTF8&psc=1). Also found similar ones on [Amazon.com](https://www.amazon.com/Black-Bubble-Stickers-NTAG213-Tagstand/dp/B00SC3ZML4/ref=sr_1_23?crid=21M9P4EV16IUQ&dchild=1&keywords=ntag213+nfc+tag&qid=1598553316&sprefix=NTAG213+%2Caps%2C402&sr=8-23)", "Here: https://testflight.apple.com/join/g6EBWpjP", "In some restaurants you can pay for your food from your table by using an app. For example we have an app called Qerko at work. You come to the restaurant, you take a magnetic card, charge all food to the card, open app on your phone and pay by scanning qr code on the card. So the app is pretty much just for scanning the qr code and paying. For this, the app clip wil be great. I also saw some gas stations starting to use apps for payment", "To pay, but it won’t get you business-specific rewards points, or gift cards, since places don’t let you use their gift card on Apple Pay", "laughs in Alaska", "I think they’re wanting access to the TestFlight.", "Nice, thanks man! And I’m guessing when it fully comes out I can configure which nfc tags do what via some settings?", "Yeah. I love putting in my payment details in New random apps and services all the time...", "Maybe? I just want to be able to use this. I’m pretty inexperienced and dabbling with HomeKit/shortcuts lately. \n\nI can’t even find the “App Clip” tab, (I’ve looked and searched everywhere.) iPhone X. Pb5", "If you want to see the App Clip Card work with NFC tags, install the App Clip via TestFlight. Follow the instructions [here](https://kushagra.me/testing-app-clip-cards-with-nfc-tags/) (**Setting up Local Experiences** and onwards) using my domain and bundle ID, and the card should pop up.", "The app clips use apple pay as far as I am aware so you will not need to input anything I think\n\nFor the current apps - it’s an option, not a requirement. You can still pay the regular way if you want", "Thanks so much for the detailed help. \n\nUnfortunately I don’t have a “developer” tab in my settings menu. Probably have to be a dev to do that I guess.", "Not all banks and cards support apple pay.", "Ah! If you have Xcode beta, just plug in your iPhone to your mac and let Xcode finish processing it. The \"Developer\" menu will show up.", "...so just use the old way?", "You’re the man! 😎 Brb!", "Ah I misread that. Don’t have a mac 😖. Thanks for the help though, I’m going crazy with HomeKit and shortcuts. Can’t wait to throw App Clips in my daily routine too!\n\n\nGet to work? Do not disturb, screen time lock. \n\nGet home? Lights on, podcast playing\n\nHop in my car? Pop up music and directions, etc", "That’s not App Clips. These are routines in the shortcuts app. App Clips are mini versions of apps", "Ugh starting to get overwhelmed. HomeKit, shortcuts, App Clips, routines, austomation, using Alexa occasionally, and having 3rd party apps that HomeKit can’t control. \n\nI wish ifttt was more viable. Seems to break the ecosystem woes. \n\nHomeKit accessories are insanely overpriced compared to other standards."]}, {"title": "1st app clip utility app in the wild", "comments": ["https://i.imgur.com/IJelKkk.jpg\n\nOh it’s Victorian government restaurant check-in for contract tracing", "Very surprised that Australia, which normally lacks behind in adopting new technologies, is utilising this functionality. Good work, Victoria. QLD next, please.", "CHECK-IN NOW", "What is this for?", "Cool ! I hope this gets implemented in more places, seems like a really good application for app clips", "Oh wow, I just saw that today for the first time as well! Checked into a cafe in Phillip Island", "I was wondering about this cool to see that it’s picking up", "I ran into one for a menu. When scanning the QR code for the menu it popped an app clip. Was actually pretty cool", "Are things somewhat normal there yet? I know Victoria had a pretty bad time for a while.", "[deleted]", "Cries in  watch series 4 lack of ECG", "Contact tracing in Victoria, Australia.", "Is it the same app?", "Oh. Good to know. That means they have a full sized app as well", "Thanks. We were in more than 100 days of stage 4 lockdown but I think we’ve successfully eliminated the community transmission though I hope that doesn’t change as we started accepting international travelers again.   \n\nSee the news today:\n\nVictoria has ended its run of no active coronavirus cases with five confirmed positive in hotel quarantine, but the state remains free of community transmission of the virus.", "Victoria is going great now, there hasn’t been any new cases in like 40 days consecutively. It had some of the hardest restrictions but it paid off", "I wonder what’s the difference between this and the webpage check in? Perhaps slightly more intuitive and responsive compared to a website", "Yep! Service Victoria", "Nice, hopefully it’ll be used state wide."]}, {"title": "Free Hand Sanitizer at Meijer in the MPERKS App. Clip the deal before checking out and scanning your card!", "comments": ["Yep. It’s normally $3.99. I love Meijers.", "I'm not seeing this on the app?", "Is this in person only?", "Where is the link?", "I got the coupon in the mail today. It also had a free empress or smart care paper towels.", "The one I got was $6.99. 16oz or something, I'd have to look at it", "Sometimes they're regional; I know I've seen some posted here before that weren't available on my app.", "That was going to be my next question, thanks!"]}, {"title": "App Clip is going to take developer innovation to a next level 🙌", "comments": ["I hope apps like Starbucks, Tim Hortons, and [insert grocery shop rewards app] will take hold of this. It’ll be nice to get rid of five or so apps I rarely ever use.", "Going off the WWDC examples, hopefully this means I can delete all the different parking meter apps off my phone.", "I’m waiting to see how annoying Reddit implementation would be for the web version ...\n\nThe possibilities are really good, especially when traveling abroad and you want to use local ride sharing or payment systems without installing the apps ... but want to see how long before the abuse forces people to disable them, like they do with notifications.", "I hope now that iOS supports it too, people will actually adopt it.\n\nAndroid has had that feature for two years now and nothing uses it.", "What is it?", "I need this for Lyft (or capital bike share) rentals!!", "i hope app clips arent taken advantage of and turned into advertisement style pointless mini apps", "I don’t see these being used. Remember rich replies for messaging apps? No one uses those because they want your eyeballs in the app.", "Anyone know how to change default mail and web browser apps on iOS 14?", "What’s an App Clip?", "And that’s exactly why I don’t think developers will be jumping to support this. What advantage does it serve them for users to have the functionality of the app without having the app installed? \n\nDevelopers want you to always have their app installed and to be always using their service", "And the few that have utilized it make it seem pretty... useless. Curious to see if this pans out the same way.", "The main difference between the two is the park of compatible devices on the latest OS.\n\nIf you try to support it on Android, Android Studio will warn you that you’re aiming at sub 3% user base. A percentage most marketing & dev departments refuse to budget or spend the time on.\n\nOn the other hand, Apple gets 60% of its user base on the latest OS in less than 60 days post-release.", "10MB-or-less miniature versions of apps that allow you to do some action (pay for parking, renting a scooter, ordering coffee, etc) that doesn’t require you to download the full app.", "This will explain [WWDC 2020](https://youtu.be/GEZhD3J89ZE)", "How much money do app developers make through downloads? Do they make money every time someone downloads the app? (Genuinely asking) \n\nA lot of rewards card apps mainly don’t make money off advertisements on the app, unless it’s their own product. \n\nI understand if they made money off a per-download or even from an ad-placement standpoint, but if that isn’t the case, what would be the reason to not support it?", "Instant Apps were supported all the way back to Jelly Bean (Android 4.2) so no, that's not the problem.\n\n>If you try to support it on Android, Android Studio will warn you that you’re aiming at sub 3% user base. A percentage most marketing & dev departments refuse to budget or spend the time on.\n\nNot sure what you're talking about here, even the latest version when they introduced Instant Apps (I think Marshmallow) should be at >50% now,", "Oh that sounds useful!", "Got a time stamp?", "Definitely no money is made from a download. Yes, ads make most of the money. The value of your app is also driven heavily by how many instances of the app are installed. \n\nYou are also less likely to want Starbucks if you don’t see that little green app on your phone.", "> Do they make money every time someone downloads the app?\n\nYes ... in negative currency.\n\nMore seriously, for most developers, especially for large firms, there’s a cost of client acquisition. So you can put a price tag (that you pay) for every new person that downloads your app, this cost can be direct ads, marketing campaigns or just development costs.\n\n\n> A lot of rewards card apps mainly don’t make money off advertisements on the app, unless it’s their own product.\n\nThey don’t make money that way. The money is made in other fashions, for example: keeping a consumer consuming regularly, Increasing the user base to increase brand success and market share, tying the consumer to a service, using the large consumer numbers to leverage funds (especially for pre-IPO companies), etc.\n\nUnless consumers are making you bleed with service costs, just having a large user base is a sign of success.\n\n\n> [...] but if that isn’t the case, what would be the reason to not support it?\n\nLogically, there isn’t, as a company’s main target is to sell services, not apps. But certain larger companies have a different long term vision/plan, and can decide against this for many reasons, some are:\n- The want the user to install the app and use it regularly rather than a one time (Uber, Netflix, etc)\n- Some monetize their apps via big data or ads rather than IAP, so an App Clip is against their business model\n- Some want user info rather than the temporarily Login with Apple id\n- Some want to circumvent the Apple 30% fee, so Apple Pay doesn’t interest them (Netflix, etc)\n\nBut, unless it’s an archaic company that can’t adapt to modern times, supporting App Clips should be a non-brainer.", "> Instant Apps were supported all the way back to Jelly Bean (Android 4.2) so no, that's not the problem.\n\nThat’s not true, here is the documentation from Android portal:\n\nhttps://developer.android.com/topic/google-play-instant/overview\n\n> Google Play Instant enables native apps and games to launch on devices running **Android 5.0 (API level 21) or higher** without being installed.\n\nAnd this is just starting to be compatible with the Instant API, which needs to be enabled by makers (Some devices are not compatible even if they run the correct OS).\n\nThen, you have linked libraries to offer services. Certain services like *FOREGROUND_SERVICES* or *PHONE_NUMBERS* are only available from Oreo and up.\n\nThat’s what reduces your available market. Along hardware requirements like if your app uses NFC, etc.\n\nEdit: Also adding that the discussion here is why this **wasn’t** more successful at release until now. If we look at market share today, yes Marshmallow and up represent more than 50% of the market share, but it wasn’t the case 2 years ago.", "27:35\n\nIt’s worth quickly glancing over the parts that interest you (iOS, iPadOS, etc), as it’s already super compressed and shows many that will deeply change the upcoming systems.", "Google Play Instant is basically a rebranding of Instant apps. They also dropped back compat for older versions with that.\n\nThe initial release of Instant Apps was supported all the way to 4.2.\n\n[https://www.androidpolice.com/2016/05/18/android-instant-apps-is-googles-new-way-for-you-to-use-apps-you-dont-have-installed/](https://www.androidpolice.com/2016/05/18/android-instant-apps-is-googles-new-way-for-you-to-use-apps-you-dont-have-installed/)\n\n \n\n>Then, you have linked libraries to offer services. Certain services like *FOREGROUND\\_SERVICES* or *PHONE\\_NUMBERS* are only available from Oreo and up.\n\nThe foreground services constant wasn't necessary before API 28 because they only added it to stricten background execution of apps.\n\nObviously newer OS features offer newer features but that doesn't really have anything to do with the discussion here. It depends on your app, if you could support older OS versions, then you could also support those with an Instant App.", "Thanks! I’m planning on watching the whole thing eventually but work’s been cruising so probably gonna be a couple days. Appreciate it!"]}]