[{"title": "Android TV gets Google Play Instant Apps, PIN code purchases, and more", "comments": ["I've recently become frustrated with the built-in Chromecast on Android TV. Only the Netflix account signed in on the TV itself can cast to it. If I sign out, then another person has to sign into their account on the TV before they can cast to the TV. It completely removes all the convenience of Chromecast since if someone has to manually sign into the TV anyway they may as well just use the Netflix app on the TV.", "The biggest oversight that still needs to be fixed is better support for multiple users. It's ridiculous that after all this time you still have to fully sign out of YouTube in order for someone else to use their account. YouTube Leanback on other platforms like Roku has had no issues supporting it, but Google seems to have some aversion to fixing it on their own platform.", "Now if android tv on my x950g could stop randomly crash/restarting that’d be nice", "When can we expect Sony to adopt/update to Android 11? 2023 or so? :(", "I wasn't expecting the instant apps on the TV. Finally Voice typing, I envy my gf apple tv with that feature.", "I don't need any of these. I need Stadia.", "We recently got an Android TV and this is extremely frustrating", "What the faaaack?!?? I was just about to get one too!!", "I have not tried recently but freezing the app on Android TV would let the cast app do the whole thing  instead of work as a remote. I wish Netflix would offer the tv app with a different if like Hulu does.", "Had the same issue when I tried to cast to someone's TV. I think it had LG's WebOS, so it's not an Android TV specific issue.", "Holly shit yes. We face the same annoyance. I have both roku and androidtv and the experience is almost identical if it weren't for this. Signing out completely is bonkers.", "Every now and then, I get a little sad that I went with an LG C8 OLED, rather than the comparable Sony OLED that year because I sort of want Android TV. Then I see posts like these and I'm glad that WebOS is actually rock solid. It's been nothing short of excellent for me, even if I am missing out on some apps and native Chromecast capability.\n\nApologies mate, because otherwise your TV is excellent. Sincerely hope it gets sorted for you soon.", "This article isn't about Android 11, just the improvements being made to the installed apps.", "My 2 year old Bravia is stuck on Marshmallow. Fuck Sony.", "First thing I tried was disabling the Netflix TV app. TV wouldn't show up in the cast menu for Netflix at all after that.", "I recently bought a Sony 950H and man Android TV is really good. I haven't had any issues yet, but the whole integration with your Google account and the OS has been really enjoyable. \n\nAndroid TV was a big reason why I went with Sony because I just wasn't familiar with LGs OS and Samsung OS is just frustrating to me sometimes. I would really recommend Android TV so far from my personal experience.", "Shield is great 🤷‍♂️", "Hoping for a black friday discount! Do you recommend the pro?", "With the new Shield, it's a little weird... I have the standard  version of the 2nd gen, when basically the only difference was more storage and a larger size on the Pro model. Since USB storage is easy to use, the standard was the one to go with.\n\nNow, USB ports and extra storage are only on the Pro, so I'd personally pick that over the Tube. If you know you're not going to use the extra hardware specs or USB ports, the Tube might be fine. But in that case, might as well save even more money and wait for the upcoming Google device. Those USB ports really make the Shield a powerful device, so I think it's worth springing for.\n\nJust don't bother with the Shield Controller, it sucks. Get an Xbox controller, Dualshock, or 8bitdo controller and you'll be much better off.", "Pro gets you:\n\n1. USB ports\n2. 64bit OS (both have 64bit processor but 64bit apps will not run on the tube)\n3. a little extra storage\n4. will run plex server if you so desire\n\nI had the tube and returned it for the pro specifically because some apps I wanted to sideload apps that only work on 64bit systems.  I also use the USB ports to connect a USB hub, wireless dongles for game controllers and a mouse and keyboard, and a logitech webcam for (Zoom and Google Duo video calls, both sideloaded).  If you don't otherwise have a home NAS plex server, that is a nice bonus, but I have one so I don't use the shield for that.\n\nIf none of what I listed above appeals to you, then the tube is probably fine.  The USB ports do create a lot of possibilities though and I'm sure there are some great uses that I haven't considered."]}, {"title": "Do Instant Apps through the web still work ?", "comments": ["I also tried finding examples and nothing is as advertised.\nI still have a screen grab of the supposed experience, searching vimeo and launching +installing right from the search results, with automatic smart login.\n\nReally sad it's not a thing anymore.\n\nRemindMe! In 1 week", "I was just able to get the Vimeo instant app to launch via a Google search in the Chrome app. However, the first time I clicked the link it opened the website and the second time it opened the instant app.", "Do you have the feature enabled in the play store/google settings?", "Yea even knowing that it has been deprecated would be nice, I just cant seem to find any info on it anywhere.e", "Can you walk me through how to do that? Possibly a video capture?", "Yep. And so the Try Now button appears in the play store. I also have the \"Upgrade Web Links\" checked but no google searches ever take me to the Instant app."]}, {"title": "Are instant apps opt-in for the user?", "comments": ["Mine is on, but I can't remember if I turned it on a long time ago.\n\nAre there any good instant apps now? I can't remember ever using one without explicitly searching for an instant app", "It's off for me, on an Android 9 phone.", "I have been unsuccessful in finding an Instant App that is triggered via an \"upgraded link\". As for ones via the Play Store -- you can try out Vimeo."]}, {"title": "Google Play Store for Android TV adding ‘Instant’ apps/games & purchasing with PIN code - 9to5Google", "comments": []}, {"title": "How do I uninstalled instant apps?", "comments": ["[Tap this to delete it.](https://i.imgur.com/nBeFN0z.png)", "They can be found in settings - apps and notifications - all apps \n\nAnd then scroll to find the app you want to delete or use the search bar.", "Either go into play store search for the game and press uninstall or hold down on the icon and it should say uninstall at the top of your screen, drag it there", "I only know about this setting https://support.google.com/googleplay/answer/7240211?hl=en", "They're not installed on my phone. They're instant apps. There's no icon to hold and they're not installed on the app store"]}, {"title": "Android Instant Apps Now Accessible by 500 Million Devices", "comments": []}, {"title": "Google Play services for Instant Apps 6.09-release-345429215 by Google LLC", "comments": []}, {"title": "Instant apps work with games now", "comments": ["This isn't new. I remember playing New York Times Crossword since Instant Apps was first rolled out.", "They always have, games have been the biggest appeal of it", "You are only years too late", "I never noticed it, maybe it's now roll out in my country.", "Aww, sorry for that guy being rude, but I'm glad you discovered instant apps! I was really stunned with the feature when it came out, and, although it's not a completely new feature, it is impressive nevertheless.\n\nI haven't seen many apps support it, so the ones that do are really cool."]}, {"title": "My phone, while locked, popped up a progress bar labeled \"Instant Apps\" which rapidly filled and disappeared. I have no app by that name. WTH just happened?", "comments": ["Go to Settings/ scroll down and tap on \"Google.\" From here, scroll down and tap on \"Instant Apps.\" Next, tap the toggle at the top to turn the feature off."]}, {"title": "Instant apps and arcore", "comments": ["I haven't used arcore in a long time, but the main thing you might struggle with is getting the instant app download size below 4MB. I suspect that the arcore lib is quite big", "Thanks you but Google announced support arcore with instant apps back in 2018 but there haven't been any documentation regarding it. Should i follow this route or make a simple app that scans qr and displays 3d objects", "You don't build instant apps any different to normal apps now a days, you just build a normal app and if it is under 4MB, then you can instant enable it. So you can always try to make your project an instant app and if it's too big you can just release it as a normal app"]}, {"title": "Google Play services for Instant Apps 6.07-release-334576853 by Google LLC", "comments": []}, {"title": "Instant Apps On Excelleo.com", "comments": []}, {"title": "Google search View in 3D and Google Instant apps", "comments": ["https://photos.app.goo.gl/C45YiXADNSfkim1G7\n\nhttps://photos.app.goo.gl/CuDZiSgSj5BU2KGPA", "Thanks a lot for checking", "Np"]}, {"title": "Can I prevent instant apps or PWA's from installing when saving a link to home screen in Chrome?", "comments": []}, {"title": "Google Play services for Instant Apps 6.06-release-330716331 by Google LLC", "comments": []}, {"title": "A Short Overview on Instant Apps for Android", "comments": []}, {"title": "Google Play services for Instant Apps 6.08-release-335882674 by Google LLC", "comments": []}, {"title": "Instant Apps en betalingen met pincode in Android TV", "comments": []}, {"title": "Google Play services for Instant Apps 6.05-release-321374564 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 6.05-release-324904644 by Google LLC", "comments": []}, {"title": "Android Instant Apps- Next Big Thing to Watch Out", "comments": []}, {"title": "Google Play services for Instant Apps 6.01-release-301630826 by Google LLC", "comments": []}, {"title": "Android Instant Apps- Next Big Thing to Watch Out", "comments": []}, {"title": "Google Play services for Instant Apps 6.04-release-310192859 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 6.04-release-314591424 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 6.04-release-310192859 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 6.0-release-298828028 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.23-release-294999175 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 6.02-release-304164787 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 6.01-release-301630826 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 6.0-release-298828028 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.23-release-294999175 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 5.23-release-288677643 by Google LLC", "comments": []}, {"title": "Huawei Quick Apps ersetzen Google Instant Apps auf Huawei Smartphones", "comments": []}, {"title": "Google Play services for Instant Apps 5.23-release-288677643 by Google LLC", "comments": []}]