[{"title": "GitHub - felvin-search/instant-apps: Your search box is now an app store! 🎉", "comments": ["I don’t quite get it? Do you mind explaining a little bit? Like do these show up on different search engines (forgive my ignorance).", "👋 Another maintainer of the project. Let us know if you think the project is interesting or if you have any questions. :)", "[deleted]", "Hey, thank you for asking! They are primarily available on [felvin.com](https://felvin.com) (which is another search engine) e.g. [https://felvin.com/search?q=flappy%20bird](https://felvin.com/search?q=flappy%20bird) \n\nBut we're working to distributing these apps on [Google.com](https://Google.com) and other search engines (e.g. duckduckgo) through browser extension.", "The web search results are coming from Google API. We have other plugins like search directly from the GitHub API and search on Google Drive or Notion. Though these are on the older website and we haven't moved it to the new website yet, checkout: [https://neera.ai/](https://neera.ai/)\n\n&#x200B;\n\nWe plan to allow people to integrate their own plugins soon, stay tuned :)", "Are the app’s proprietary for felvin.com? Or like how are the apps made and what are they made for?", "We believe search is a great interface to distribute app or any kind of information for that matter. Compared to the case where you have click on multiple buttons here and there do bring up the right \"widget\", so this repository explores this idea.\n\n> Are the app’s proprietary for felvin.com?\n\nAll the apps are open source, right now we are distributing them through felvin.com. \nIt should be possible for you to use it on your search engine or create some other way to use them, say in your own desktop/mobile application. You can see source of all apps here https://github.com/felvin-search/instant-apps/tree/master/apps.\n\n\n> how are the apps made\n\nThey are web apps, created with React."]}, {"title": "We need Flutter Instant Apps", "comments": ["> Outside Silicon valley app based companies such as Uber and Doordash, web is king and mobile apps are treated like a second class citizen for most parts IMHO.\n\nWait what?", "Do people actually take instant apps seriously anymore? \n\nOf all the things the flutter team needs to worry about, this should be close to the bottom. \n\nMy opinion has always be if you need the best of the best apps, or a lot of native features, your probably best doing a native app. \n\nI just don’t see a use case that someone would prefer an instant app over just a webpage.", "So your solution to the problem is to make flutter apps not work at all unless the user goes an downloads the engine separately.\n\nI’ve heard of putting the cart before the horse, but this is putting the cart and the horse on different continents…", "I think this would be possible in fuschia os.. Because the engine will come with the os and flutter apps are first class citizens. \nOn iOS  and windows it's not possible as they'll never agree to it. \n\nMay be it can be done in Android but it'll not work on previous versions of Android and it's totally upto the Android team. \n\nLinux is leaning more towards flutter so there might be a possibility 🤞.\n\nFor web Google tried shipping dart SDK but js devs backlashed, the won't welcome the new kid on their turf. So shipping flutter engine would be out of the question.\n\nAlso is there any possibility of downloading the engine seperately from the app once installed so all flutter apps can use this. The engine app must be automatically updated to the required versions requested from the apps. If it's possible we can reduce a the size.. just being optimistic I know it's not possible.. but java apps do it, the majority of the os ship jvm with it or you install seperately to support it.", "I might be going off the beaten path here, but to me it seems like getting Dart to bootstrap itself would go a long way in improving the speed.  I think of languages like Red/Rebol, Nim, and I think Zig.", "Yea, we do need instant app support. For that I believe the .so files size has to be reduced. Right now I guess the minimum app size is around 12-14MB. Instant apps need to be smaller.", "Not exactly Instant Apps but we are using a solution to update \"over-the-air\" our flutter apps without the Google Play Store. When the user open the app the SDK checks for updates in background, and if there is an update avaiable, the app will do the update in background.\n\n[https://codepush.dev](https://codepush.dev) \\- our idea is to launch it as a SaaS soon! :)\n\n&#x200B;\n\n>Yea, we do need instant app support. For that I believe the .so files size has to be reduced. Right now I guess the minimum app size is around12-14MB. Instant apps need to be smaller.\n\nu/basanthverma yeah, a major challenge is the distribution of these .so files and other assets via CDN. Good quality network bandwidth are so expensive :(", "For many companies, mobile apps are not the primary revenue driver, their website is. Mobile apps are built for customer convenience and or to facilitate business services.", "The only instant app I have ever seen is Shazam, do others actually exist?\n\nWhat would be the benefit of an instant app over a pwa anyway?", "OTA updates looks interesting, is it allowed by the app stores?", "Citation needed I'd say :)", "It is, it’s been around for years for platform such as ionic and react native", "No data on my end but look at it this way: there’s a lot of software companies. Granted. But there’s and equal or greater amount of businesses that just want some sort of interface on a client‘s device. Think takeaway food. Where I live most local shops let you order food directly from their website or through some sort of proxy. I don’t spend a lot of time on these sites/in these apps. They are really only a means to an end. Any sensible business decision would conclude in just shipping the mobile site. Yeah, UX is horrible. Will that stop me from ordering food from them though? Probably not… \n\nJust my 2ct ofc"]}, {"title": "Flutter and instant apps", "comments": ["Your research is correct, that’s related to the size limitations of instant apps and clips. From what I recall the size needs to be pretty small which is usually extremely difficult for a multi platform framework such as flutter.\n\nLast I checked a “hello world” flutter app was around 5mb. So it will work assuming you can then keep the rest of your app within the limitations for instant and clips.\n\nCorrect me if I am wrong, but I think it was 10mb so if your app really simply needs 1 screen and your assets are small or not shipped with it you should be fine. 5mb is still a lot of room to play with really.", "yes, it is possible. My recommendation, tho, is to keep 2 separate projects, one for the pull app and one for the app clip.", "Is there any guide on packaging the native instant app project with the flutter project?", "This is what I did for my project and it’s worked out really well!", "Yes, just google it :)", "I have googled, I can't find anything that even indicates it's possible. If you don't mind helping me I will send you $5 USD of crypto on Coinbase. Ill be specific, the project needs to be multi module, mostly written in flutter (several screens), but 1 screen (module) will be an android instant app / iOS appclip. That screen can be isolated from the main app but it all has to be one package.", "if you type \"flutter app clip\" in G, you'll see the official guide and one github issue.", "Android instant apps is what I'm more interested in, and that example has a disclaimer that says it won't even work for production (app size >10mb).\n\nI know it's possible to deploy a flutter app as an instant app, but I need to know how to package it in such a way that the instant app is a seperate native module that will be very small (1 screen). Again android focussed", "I have no exp. with Instant Apps. I did a lot of research tho and there are plenty of limitations I can't recall right now. For instant apps, my recommendation is going 100% native."]}, {"title": "Google Play Services for Instant Apps Nedir, Nasıl Kullanılır?", "comments": []}, {"title": "Use Play Instant Apps", "comments": []}, {"title": "Felvin Instant Apps @ Hactoberfest 🎉", "comments": ["👋 Another maintainer on the project! Let us know if you have any questions - we'll be happy to help with your first contribution. :)"]}, {"title": "Instant Apps Development: How to Create One for Business", "comments": []}, {"title": "Instant Apps Development: How to Create One for Business", "comments": []}, {"title": "How Can You Get More Users With Android Instant Apps?", "comments": []}, {"title": "Google Play services for Instant Apps 6.16-release-381024757 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 6.14-release-367282920 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 6.13-release-360645094 by Google LLC", "comments": []}, {"title": "Is there a way to back up Instant Apps", "comments": []}, {"title": "Google Play services for Instant Apps 6.10-release-351623847 by Google LLC", "comments": []}, {"title": "Google Play services for Instant Apps 6.11-release-353984765 by Google LLC", "comments": []}]