[{"title": "I’ve just used App Clips (accidentally) for the first time since they were announced over a year ago. What happened to them? Has this just been a bit of a quiet failure, or do you reckon it will be adopted a bit more?", "comments": ["App clips are great for when you're visiting a city or hotel or something for a short time.\n\n2020 was not the best year to introduce something for the traveling iOS user.", "Here in Australia the governments adopted them for the covid QR code Check-in apps - they work great, and I reckon it’s made the experience way more seamless and got more people doing checkins.", "The only time I've used them is when a friend texts me a TikTok link. I don't have the full app (nor will I ever) but the App Clip works to watch the video and move on.", "Google made a similar feature 2-3 years before Apple and it wasn't widely adopted either, no surprise there, if there's a Full App then shops are not incentivized to create an App Clip version of it.", "They're infrastructure for AR glasses. Currently I think there is little to no reason for say a starbucks to make a clip app that cannot gather a lot of data. \n\nI've used them a couple of times, surprised the table service apps that appeared because of covid didn't use them more, but again, probably a data thing.", "I think the case is similar to almost every new not-mainstream feature of mobile OS's.\n\n* Most of the big app makers already figured out ways how to do the same task without app clips\n* It is not cross-platform, so cross-platform apps must reject it\n* Most of the people responsible for features in smaller apps don't know about it at all\n* It is still new technology, new workflow, so plenty of apps reject it because you need to provide description how to use it, which basically cancels all the advantages of it", "I used one the other day to order some food for takeout. It was a great experience actually - no pain of going through the process of downloading an app and setting up an account to place one order and delete the app. \n\nI hope it becomes a more common thing in the future.", "It's weird but they actually cross my mind often lol. They never took off at least in my country", "I’ve used these at Exxon gas stations to pay. They’re pretty rad!", "App Clips will play out a lot like CarPlay. Slow uptake to begin with then they’ll be everywhere", "I used one for paying for parking in my city the other day and was presently surprised to see it! A much nicer experience than a website would've been.", "Developers want you to download their whole app, because your usage patterns are just as valuable as whatever purchase you’re going to make in an app clip meant for limited use.", "iirc they are a bit of a pain in the butt to implement unless you specifically plan around them when initially coding your app. I know I didn’t even try adding support for it with my first app since it was a free app and that would have added some considerable development time.", "Same thing as the equivalent Android feature introduced in 2015. No one uses it.", "I’ve used them at a few restaurants, they show up in one of the widgets on my Home Screen, and I think a store or 2 has had one. Overall I like them for the restaurant to look at the menu and even pay.", "I’m afraid the only place I’ve seen them are at Apple Stores to promote self-checkout.", "I’ve used these to pay the bill at a few restaurants around here. The printed bill comes with a QR code on thermal receipt paper as usual, and the app clip comes up on the phone ready to pay with tip and optionally ApplePay. I think it’s called Toast. Super convenient, I hate handing my card over to wait staff. I won’t even give them one with numerals on it. Apple Card only for safety.", "I’ve used app clips a couple times when paying the bill at restaurants and they work great for that. But that’s the only time I’ve seen app clips used. \n\n(A popular app called Toast for paying the bill at restaurants is the one I used.)", "They are a slow burn feature, use will increase over time.", "I have never ever one time ran into an instance where is App Clip popped up.", "The only time I’ve ever used one was Shazam when I asked Siri was a song was.", "Toast uses it pretty extensively, and allows for a better purchasing experience when I do take out at my fave restaurant.", "They work great for stuff like renting scooters. Its ridiculously easy to use. Scan QR code, click pay, go.", "I've used one once at a gas station, and another time when parking. The sign at the parking lot had an NFC tag that opened the app clip embedded in the sign, pretty nifty.", "There is a restaurant near me that has QR codes on the receipt that pull up an app clip for Toast (popular POS provider) that lets you pay your bill with Apple Pay.  Very convenient, the bill is paid instantly without the business ever needing to see your card or making the waiter walk back and forth with it.  It’s just better for everyone all around.", "I would imagine that most of the things people would end up using App Clips for are things that they already have installed the actual App for.\n\nApp Clips are theoretically very useful but it's just a feature that you won't end up needing to use 99.9% of the time because we all generally know what Apps we need to have for most situations in our daily lives.", "I think Exxon uses them at the pump but have only seen it actually work once. Not sure if it supposed to get you to sign up or pay quicker. I usually pay from the app in the car then pump my gas since it never worked previously.", "I’ve only seen them in restaurant menus. Which I assume kind of defeats the purpose when a QR code to menu link would have sufficed", "User testing uses them with their QR codes, also yelp does.  It’s up to developers to add this, wouldn’t say it’s a failure.", "I used it once at a restaurant, it gave me the option to pay using Clips and Apple Pay, which I thought was interesting. \n\nIt didn’t work, had to use my card.", "My only experience with an app clip has been with an unattended parking lot that directed me to download a clip. It was definitely faster than downloading an entire app to pay for an hour of parking. As with Apple pay, I predict a slow rollout, but I hope more places start using them.", "I used clips at a gas station in California to pay for gas/activate the pump from my phone.", "They’re around. I’ve used a couple different ones several times when paying the bill at restaurants. There’s even a TikTok one that opens up right from iMessage when my friends send me TikToks (I don’t have TikTok installed).", "They are great for renting those scooters and bikes. Other than that, i havent used it. The technology is nice to have though and i hope it catches on.", "I’ve used them to pay for things through Toast and thats been really nice", "I used them to ApplePay for gas the other day at a Mobil station. Good workaround for the old pumps that didn’t have the wireless receiver for the checkout process. They just printed and slapped a QR code on there, it launched an app clip and viola.", "In Dubai, the parking meter has been digitized and Apple Pay compatible thanks to App Clips. You no longer need to dig your car or pockets for change.", "Nicest use I’ve seen is App Clips in maps, it lets me avoid downloading 20 different fast food apps", "It’s a flop. Just like it was on Android.", "I think it’s great but the brand is bad ..they should rename to something like mini apps", "I think it's a lot like Apple Pay.  Retailers, especially restaurants, are going to realize that they can restructure their business and by doing so greatly reduce workload on the employees, increase customer flow, provide a better experience, and make the payment process more transparent (people spend more when they have less of a physical experience doing so).\n\nThis outweighs the benefits for many businesses that don't care as much for customer data (local restaurant) or have other means of acquiring it.\n\nGrowth will also occur as 3rd party developers of App Clips increase their awareness and small businesses sign on as a result instead of having to pay for a full app to be developed and then provide the incentive to customers to download and install it.", "These are for AR", "To be clear, app clips codes are not the QR codes everyone is seeing because of uptake of QR codes from covid check in apps and menu websites. Maybe this is a good indication of unfortunate timing for apple that the world was thrust into actually knowing what QR codes are after a decade on next to no mainstream use.\n\nFor anyone interested https://developer.apple.com/app-clips/", "I use app clips each time my brother sends me a tiktok\n\nI get a proper app interface without ever having to download the app and risk that addiction factor", "I went to a restaurant recently and when the bill came, there was a QR code on the receipt that opened an app clip to pay via ToastTab. Was a cool little moment.", "Bad timing and competing technologies seem to have limited uptake. I've never used one.", "I use the to pay bills by scanning QR codes instead of swiping or tapping cards — or installing the restaurant app.", "My friend texts me TikToks he finds funny. I don’t own the app and one time it opened it in a little app clip. It was a nice change compared to opening it in a browser tab. Sadly, it’s only happened once.", "Toast has a really useful one but I’ve only seen it once out in the wild and I eat out a TON.", "Between taking all or less of your data, companies want all of it. Hence, the low desire to support it.", "Covid", "I would have loved them for things like mobile ordering from fast food places. I really don’t need an entire Arby’s app for the rare time I decide to go there.", "That’s interesting. As someone else has pointed out, it seems companies are hesitant to not have full data collecting apps, rather than think of simple user friendly options.", "Interesting. Which state? I don’t think I’ve ever used Clips and check in through the Service NSW app after QR code scanned.", "Here in QLD, we've only used our \"Check-in QLD\" app, and no app clips were ever prompted to me. The neat thing I found is that I could use the camera from my lock screen to scan the QR code, and it takes me to the app.", "Fellow Aussie here! It’s great, isn’t it. I also like the Shazam one, super cool.", "Do they work on Android phones/tablets as well then?", "Same", "IMO there’s really no point in making an App Clip when a website is sufficient *and* works on all platforms.", "Android Instant Apps are severely more limited than App Clips though.", "100%\n\nAR future long game.", "I think they’re doing a bunch of things for AR, spatial audio, head tracking, the object scanning thing, U1 chip etc", "You are 100% right", "Maybe that was the intention, but I’m yet to see one anywhere in Australia. Regular QR codes out the wazoo though.", "The idea of Starbucks gathering data on our phone with their app is so fucked up lol", ">\tThey're infrastructure for AR glasses\n\nSource", "With their small footprint, App Clips also undermine surveillance capitalism. They are less invasive than a full weight app and don’t persist on the device long after they’ve been used.\n\nToo many companies are hooked on user’s private data like heroin addicts. Anything that threatens that revenue stream will be shunned.", "Same, I think they’re a great feature lacking adoption", "What app was it?", "To be fair, Google can't even get a mobile wallet off the ground though, so I don't think that's a good comparison.", "I’ve seen this but they are region locked, so it didn’t work in my device", "This was only because it was Apple related, so on their actual site checking a product serial number. Completely forgot they existed before that.", "Yes! The TikTok Clip is the best", "That actually does work at some places.", "To my knowledge (dated by a few months) only VIC uses it, it’s fantastic no need to download an app. SA, TAS, NSW, QLD all use their own full apps. Can’t comment on WA and NT", "Agreed. But unfortunately there are so many places that insist on apps like the parking meters all over my city. I was hoping app clips would replace those. \n\nAnd I guess applications and app clips do have some niceties there over websites like the notification integration.", "Okay, I’m gonna cal BS on that. \n\nI use app clips pretty regularly for paying my tab at bars and restaurants. \n\nI would NEVER have made an account on some website, and put in my payment information for that, but because the app clip already “logged me in” anonymously and allowed me to use Apple Pay directly, I’ve been using it nonstop.", "It depends on the use case. App clips, being apps, have broader access to system functionality and don’t need to be downloaded each time you want to use them if you need to use them multiple times (unlike a website that needs to be downloaded each time you view it after closing it).", "Maybe, I don’t think it’s long game as much as short game to get people on board with protocols for sending the world. EG of I pull up my iPhone sensor when I read a menu. Future interfaces will be fully aware of what you are doing and know you are at a particular cafe and just load the content, no human input required.. also no QR codes, it just reads the world around you as one big QR code.", "No source, a guess. Don't quote me.", "It’s odd though. If the user doesn’t have an app already, an app clip is a powerful tool to hook into the user. Companies that have mobile web apps could benefit from having a streamlined registration flow, push notifications, smooth transition to native app with the best deep link possibilities.", "Android had “App Clips” a few years ago (Instant Apps) and I’m pretty sure it was the same thing.", "Based on my PayPal history, it was Honk Mobile", "It sounds more convenient for sure.  I honestly forgot clips existed and was a feature I had thought would be nice to have when announced. But when I saw it was being used here, I figured it had to have been a different state considering the Service NSW app is prompted at every QR code check in.", "WA has SafeWA. It's good.", "Yeah I know Vic still uses it, and it’s great. (source: Am Victorian, No: 1 in Lockdowns Baby!)\n\nOnly issue I have with it is the QR code is often finicky, and with iOS 15, really hard to hit it as it’s more of a two handed operation thanks to the moving, tiny link button (iOS issue, not Service Vic). Makes me wish we had the old 14 banner design, worked much better.", "[deleted]", "Not sure why you think that is exclusive to App Clips. Websites like me&u here in Australia already let you go straight to Apple Pay without requiring an account after ordering food/drinks.", "Websites can actually designed to not be re-downloaded every time you visit the site. With the enormous amount of stuff being added to JS each year, I doubt there are major functionalities that are only available to native apps. With that said, Safari on iOS does impose heavy limits on what webpages are allowed to do compared to browsers on desktop.", ">\tNo source, a guess. Don’t quote me. -alfiehale\n\nGot you", "It’s like the future has arrived, you scan the code the thing pops up, open the app as if it was on your phone. Literally game changing, such a shame it isn’t used more", "I’m in vic. The service vic QR codes have been app clips for months and months. Delete the app and go scan one!", "I know it’s not the only way to do it, but it’s currently the only way I’ve seen it implemented in the US.", "> I doubt there are functionalities that are only available to native apps.\n\nPush notifications, background location services, automatically added to App Library and Siri suggestions widget, etc.", "listen here, you", "Completely surprised me when I first saw it pop up last year, especially being a government app and all.", "Ah that’s sounds like a much nicer option. Maybe not necessarily from the QR checking, but I can’t tell you how many apps I have that have offloaded from lack of use. Having the clips would be much easier", "There is a difference from an app clip and a deep link. If it opens the App Store it’s a deep link if it opens the app without the App Store it’s an app clip.\n\nFun fact,  Shazam is an audio app clip. Use the Shazam button from the control panel when it is uninstalled and it will install an app clip when you have it identify it’s first song. Apple are the only ones who could do this because it’s their sandpit, the first example of an app clip not initiated by their own QR code pattern.\n\nAs a developer there is a lot of potential for them but there are a lot of hoops to jump through to get an approved apple app clip and they need to send you the physical material too from memory.\n\nAlso you can’t just use any normal QR code it needs to be the apple style from iOS to read it and function accordingly.", "*“listen here, you” - alfiehale*\n\nThis is fun.", "[deleted]", "> Also you can’t just use any normal QR code it needs to be the apple style from iOS to read it and function accordingly.\n\nNope, it can be delivered with standard QR code, it doesn't have to be that [circular App Clip Code](https://developer.apple.com/app-clips/images/icon-app-clip-codes.svg). You can also use NFC tag, and even a standard link  that can be put on Safari banner or iMessage.", "Is there any advantage to deleting the service Vic app tho? Besides saving a tiny bit of disk space. Can you connect your vaccine certificate to the app clip?\n\nIn my experience, scanning a QR code using the camera app takes orders of magnitude longer than opening the service Vic app, selecting check in and scanning it that way, and sometimes it doesn’t work at all. The service Vic app is so fast that sometimes it’s recognised the code before I’ve even positioned it correctly.", "That’s great, do you know where I can learn more on that. I’ve not had much luck."]}, {"title": "What App Clips have you used?", "comments": ["I've used one at a restaurant once to order. Was super easy and would recommend. But that was the only time, and frankly I was surprised when I saw it and was like \"ohhh right this thing\"", "In Melbourne Australia right now and the way you check in to businesses and restaurants for contact tracing uses an app clip. It’s a regular QR code so can be scanned on iOS or Android I’m pretty sure, but on iOS it opens as an app clip. Pretty neat really.", "The TikTok one is handy over iMessage (if someone texts you a TikTok video it comes up in an app clip). \n\nThere’s also an Etsy shop one that works with any Etsy link and it’s handy because you can check out with Apple Pay without creating an account.", "I still don’t know what an app clip is tbh.", "sadly, none", "I enabled the Shazam toggle in control center. so whenever I “shazam” a song, it presents an app clip of the song (with ability to play it or add to your apple music library)\n\nAlso, like others in this thread, use the TikTok app clip when someone sends me a video. Ain’t no way in hell am i signing up for that app", "None. TBH I forgot this was even a thing and I’m an iOS developer.", "I forgot all clips were a thing, because I’ve never seen one", "I have only ever seen one in real life, at a gas station", "TikTok,\n\nIt’s real nice, i dont have to have the app installed on my phone, but if someone sends me a link to one i get to view it inside a native App like view.\n\nBut then i cant scroll more than a few swipes so i dont end up spending hours looking at TikToks", "Here’s some App Clips to try:\n\nhttps://app.airport.community/lists/recJnVa0BxqPQ1Weq", "I use led Shazams app clip often. But lately it just links me to the App Store to download the full app instead.", "I only thought about it once but decided not to hassle with it in that particular instance. I haven’t seen another time since. I forget they exist until someone mentions them here.", "None.", "I saw once at a gas station. Stared on it for a while but swiped my credit card to pay", "I don’t even know what that is", "I've paid the bill at a couple different restaurants using an app clip. Only time I've ever seen or used them.", "Recently used one for concert tickets", "I’ve used it at restaurants to pay a check and at Exxon gas stations", "Wtf are app clips?", "Just the Apple store one. I doubt they will see much penetration outside of the US where iPhone market share is lower.", "I have no idea what a Clip is.\n\nBut every year brings a parade of new iOS features that I can't figure out why anyone would be interested in, so...\n\nIn related news, it was fun getting waken up by a text from my mom on the other side of the planet at 4AM this morning, which is how I found out that \"Focus\" had somehow stopped setting my phone to \"Do Not Disturb\" at night.", "Only one I’ve seen was the other day from Toast for paying the tab at a restaurant. I feel like I would have used a lot more by now if I didn’t already have the full apps on my phone. Infrequent things like Etsy and parking payments stand out as likely contenders.", "I’ve used the Dunkin Donuts clip, used one to pay for a parking meter once. That’s about it. \n\nIt’s a great idea, but the adoption hasn’t been great. \n\nI tried using one to pay at the gas station recently, but my phone wouldn’t recognize it.", "I walked past a McDonalds once and their app clip appeared in my library. Other than that never seen one in the wild.", "Here in the Netherlands I’ve never used one.\n\nBeen to a lot of restaurants some of which allow you to order with an app, but none used app clips so far", "A bar I visited over the summer while traveling had it. Super convenient and helped convince me to visit them again before I left.", "Gas station. Was pretty convenient to do hands free payment", "Don’t think I’ve seen any.  Are they available in Canada?", "I’ve had a similar experience! We sat down, ordered, ate, and everything else. The check came and had a QR code to download an AppClip for the app they use for payments. It was actually really, really convenient! A quick download + Apple Pay made paying for the meal super quick but we still had to wait on others to give and receive their cards and signature.", "I have no idea if the NT version I use has the same feature. I just check-in from the history icon on the app’s Home Screen. Mind you, there are only about 20-odd places I frequent these days so everywhere I’m usually going is on that list already.", "Yeah, I don’t have TikTok but my girlfriend does and when she sends me ones she wants me to see I get the true native UI rather than a web version despite not having the app installed. Not a huge difference but pretty neat.\n\nOther than that I’ve only seen it at a couple restaurants and gas stations.", "My wife sends me TikTok videos pretty regularly, and I use the app clip which is way  more convenient. \n\nThe Etsy one blew me away. I had a couple of links to items sent to me, and the fact that I could go through the whole order process without doing any extra steps was amazing. By far my best experience with an app clip.", "Wait how do you get the app clip? My wife sends me tiktoks all the time but it only plays them in safari", "They were introduced at WWDC2020.  [WWDC2020 Day 2 recap](https://youtu.be/-OtSv3IZlas).\n\nhttps://support.apple.com/en-au/guide/iphone/iphb3a73ec53/ios", "It’s a shortcut to use specific features of an app without having to have the app installed.", "Whew. Glad I’m not the only one!", "Thank you!", "https://support.apple.com/en-au/guide/iphone/iphb3a73ec53/ios", "They are available in most regions, it just depends on developers / businesses to take them up.", "I use the QR code 10/10 times when I see it on a receipt. Absolutely love the process and speed. But I wish everyone at the table would utilize it.", "Idk it just works\n\nhttps://support.apple.com/en-us/HT211546", "Is she copying the link then pasting into iMessage or sharing directly to the person on iMessage via the share sheet? The former won’t have an app clip I believe", "Instead of clicking on the photo, click on open", "I'll have to ask"]}, {"title": "Buying tickets with App Clips", "comments": ["That‘s really cool!", "I guess the mall itself has to take some Actions in Apple business register", "I don’t think so, it’s from an app called Tiqets, and most other places listed in that app also show tickets in Maps. I think it’s coming from the app and not the businesses directly.", "Ok. Interesting. Meaning A LOT of places in the world should have the same kind of interaction in Maps.", "There’s a lot where I am. And other ones too:\n\nhttps://i.imgur.com/hxbUq9A.jpg\nhttps://i.imgur.com/CjUDIjO.jpg", "Ouah ! That looks great. None of this in France/Luxembourg except OpenTables.", "For Audi Beverly Hills, I get exact same screen except I do not have this pricing tag.", "Many of these appear to be region locked, probably due to only being published in the US AppStore."]}, {"title": "Parking meters got App Clips, anyone tried it??", "comments": ["For those out of the loop, App Clips are basically 'snippets' of an app that provide a certain feature for the public to use, without requiring the user to download the app entirely.\n\nFor example, the RTA app has hundreds of features in terms of payment services and info lookup, but while you're at a parking meter, you just want to pay for your parking. So you scan the QR code, it opens a 'micro-app' which only has the option to pay for parking meters, and you pay and get done with. No need for any account setup or Emirates ID linking hassle.", "What injustice did Android users do? 😭", "These App Clip Code are only compatible with Apple. Does it work with a Droid?", "I was just telling my friend about how it’s weird they don’t make a scan feature for this type of thing! Wow that’s crazy", "That’s awesome. Didn’t realize they’re implementing it.", "In the time taken to walk to and scan that thing I could have typed the code on the phone.", "It’s similar to a QR code right? Seems good", "Very cool", "Thank you kind sir", "[deleted]", "No", "It says apple pay so I think it is.", "I think this is targeted to users who would usually use the machine and prefers to pay using Apple Pay.\n\nFor me it’s easier to use the app where I have all my car plates saved in one place.", "Except it's only for iPhone currently", "There was supposed to be Instant Apps... Don't know where Google has hidden it away", "You can only top up the account right? You can't pay directly with Apple pay.....\n\nI also only use the app, top up using the app when ever needed.", "It's there.....in fact it's been in Android for long time.\n\nApps like vimeo etc use the instant app function in Android....", "No account needed, just add the details and pay with ApplePay. \n\nThis is good for visitors that don’t want to use the app or top-up more than needed, I have 100 AED in my AD account since 2013, only used it twice. \n\nAlso I think office users can have an AppClip in their office and use it to pay/renew parking for themselves or maybe their guests.", "Exactly this. The back and forth between Android and iOS continues..."]}, {"title": "Apple is adding app clips in the new pride band packaging to allow for easy access to the new watch face.", "comments": ["It's only a matter of time before Apple locks custom faces behind the purchase of specific bands. They need to do something to differentiate their bands from the AliExpress versions.", "😍🌈\n\nhttps://imgur.com/a/LaaZECs/", "Can you access the face without the band as well? If so, where do I find it?", "Couldn’t be done with a QR code?", "Yes. Something other than make a better product, anyway", "Would this be the first Nike face available to all? Edit: Never mind!", "beta?", "once the update comes out, it will be at the top of the watch gallery and in the pride section as well", "That's just it -- most of the stuff on AliExpress comes off the same assembly lines as Apple's stuff...", "this is not a Nike face", "Yes", "fluoroelastomer, and silicone and not the same thing.", "I havent seen a single braided AliExpress that compares to apple. If they really are from the same line then they must be QC rejects.", "They’re a decent enough clone, but having owned both, they’re certainly not identical. Different materials etc", "There’s a Nike face on the sport loop. Is that a stock Nike face?", "Apple marketing is good at their job.", "They probably are. That's more likely than factories set up to produce knockoffs. But some of them are identical except for the packaging.", "Depends on the band. Some of them really are identical.", "that one is Nike exclusive. the one in this post is not. the Nike one shown with the new sport loop came out with last year's Nike pride sport band.", "Still not the \"same thing\" Go look for stress and rip tests between fluoroelastomer and Silicone. I bet you think all wall warts are the same if they look the same too."]}, {"title": "Completely forgot about app clips until just now…", "comments": ["Tiktok has an app clip for viewing tiktoks without needing to install the app or have an account. Great for when someone is sending you tiktoks", "The contact tracing app in Victoria, Australia uses App Clips if you don't have the app installed. Thousands of times better than a web page.", "They actually have them at a local Exxon station near me. I used it a few weeks ago when I forgot my card at home. It worked really well for me.", "Local gas station add it. They don’t have Apple Pay reader at the pump. They shan’t you in their app, have your location, you type pump #, then use Apple Pay there and start pumping.\n\nUsed app clip to make it quicker. I tried it once because it was an app clip. But I’m not giving my\nLocation just to pay for gas. I’ll use my card and be done with it.\n\nAlso help has it now so stuff in Apple Maps pushes me to an app clip rather than a web page.", "I think I just watch it in safari, whenever my girlfriend sends me a video from tiktok. I completely forgot about app clips, too.", "Does the audio work for you on them? The tiktok app clip doesn’t have any audio for me on any videos.", "It also explains why the QR code is so dense and complicated. Not only does it support App Clips but it also falls back on standard QR data that also supports Android.", "What does it do? You tap ur phone on the pump and then it lets you apple pay or something?", "Yeah, basically it just opened the part of the Exxon app that let you choose a pump and pay with Apple Pay. It was definitely quicker than downloading the whole app, logging into another account for them specifically, then getting to pay.", "How is that more convenient than just using tap to pay with your apple wallet?", "I’m pretty sure these pumps don’t do just straight up Apple Pay at the pumps. They want you to have to download their specific app and you can use Apple Pay through the app to pay at the pump. It would be amazing to just have Apple Pay there and avoid all the apps but they will never do that."]}, {"title": "What are the privacy implications with App Clips?", "comments": ["Hello, looks like your post is about Support. **Please remember we only allow Software Issues** here at r/iOS. Hardware issues should be posted to r/applehelp or r/iphonehelp.\n\nPlease also check out the [Tech Support FAQ](https://www.reddit.com/r/ios/wiki/faq) If your issue is found there, please delete your post. \n\nIf a user replies to you with an answer that works, **please reply/comment -solved.** This will change the flair of your post and alert other users that your issue has been resolved.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ios) if you have any questions or concerns.*", "From memory, they’re specially formatted parts of the full app, so have the same privacy details.", "Thanks. It’s rare that I run into app clips so maybe I’m not remembering the opt-in aspect incorrectly.", "There is no ‘opt-in’… the app clip will pop up regardless.", "That seems sketchy to me", "Which bit?", "That I can receive a link that looks like a regular URL but when clicked  it redirects me to an App Clip that may have privacy settings I’m not happy with.", "https://support.apple.com/en-us/HT212238\n\n>If you would like to disable App Clips, go to Settings > Screen Time > Content & Privacy Restrictions > Content Restrictions, tap App Clips and select Don’t Allow. When you select Don’t Allow, any App Clips currently on your device will be deleted.", "They don’t look like regular URLs, and it’s the same as if you installed the app.\n\nhttps://developer.apple.com/app-clips/\n\nhttps://support.apple.com/en-us/HT212238", "Awesome. Thanks!"]}, {"title": "iOS App Clips Scanner", "comments": ["I had my first app clip the other day. It was one of the Toast receipts where you can scan it with your phone rather than waiting for the server to take your card and what not. I was THRILLED to see this little animation.", "I still have no idea what app clips are for.", "Ahhh, this is delightful! I’m yet to encounter my first App Clip code in the wild, but when I do, I’ll be sure to scan it just to see this", "Thats cool! I added an App Clip to my game, and it was working great but figuring out how to get it to actually launch was so confusing I just gave up and moved on.", "Watch [WWDC2020](https://tv.apple.com/au/movie/wwdc-2020/umc.cmc.54m67p6y1anwos34dojt57fw7) it’s their official iOS 14 reveal. Basically App Clips are an iOS feature where you could theoretically use little parts of an app on your iPhone. I say theoretically because this hasn’t really had a great launch.", "Thanks, I'll check it out!"]}, {"title": "Apple ARKit 5 — augmented reality for iOS: location anchors, app clips, face tracking, motion capture", "comments": ["more sessions\n\n[Dive into RealityKit 2](https://developer.apple.com/videos/play/wwdc2021/10074/)\n\n[Explore advanced rendering with RealityKit 2](https://developer.apple.com/videos/play/wwdc2021/10075/)\n\n[Create 3D models with Object Capture](https://developer.apple.com/videos/play/wwdc2021/10076/)\n\n[AR Quick Look, meet Object Capture](https://developer.apple.com/videos/play/wwdc2021/10078/)\n\n[Create 3D workflows with USD](https://developer.apple.com/videos/play/wwdc2021/10077/)\n\n[Classify hand poses and actions with Create ML](https://developer.apple.com/videos/play/wwdc2021/10039/)\n\n[Explore Nearby Interaction with third-party accessories](https://developer.apple.com/videos/play/wwdc2021/10165/)\n\n[Design for spatial interaction](https://developer.apple.com/videos/play/wwdc2021/10245/)\n\n[Explore ShazamKit](https://developer.apple.com/videos/play/wwdc2021/10044/)\n\n[Discover built-in sound classification in SoundAnalysis](https://developer.apple.com/videos/play/wwdc2021/10036/)\n\n[Practice audio haptic design](https://developer.apple.com/videos/play/wwdc2021/10278/)\n\n[Immerse your app in spatial audio](https://developer.apple.com/videos/play/wwdc2021/10265/)", "If I’m not wrong all of this was also available in ARKit 4", ">[ARKit 5](https://developer.apple.com/augmented-reality/arkit/) brings Location Anchors to London and more cities across the United States, allowing you to create AR experiences for specific places, like the London Eye, Times Square, and even your own neighborhood. ARKit 5 also features improvements to Motion Tracking and support for Face Tracking in the Ultra Wide camera on iPad Pro (5th generation). And with a new App Clip Code anchor, you can pin virtual content from your App Clip or ARKit app to a printed or digital App Clip Code.", "So mostly improvements from ARKit 4", "ya, i guess 'object capture' was the focus"]}, {"title": "New notification for App Clips? [iOS 15 b2]", "comments": ["**OP:** The title of your post must include the beta version your device is running. If it does not, please delete your post and try again.\n\n**Other users:** Please report this post if it includes a \"Feature\" flair but does not include the beta version running on OP's device in the title of the post.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iOSBeta) if you have any questions or concerns.*", "Man I forgot Clips were a thing. I’ve only seen it once in my life", "It came out at exactly the wrong time, a product who’s main feature primarily relies on physical proximity isn’t going to thrive when it’s released right before a pandemic.", "Not even before, it was released during the pandemic"]}, {"title": "Concept Experience using iOS App Clips + ARKit", "comments": ["There is no way the person who came up with the idea worked in retail. merchandise gets moved all the time. There are certain items where the company pays for an end cap or a display but i have seen store managers rearrange things as long as they fit within the store plan. So the part has to be in that section on that isle but not that row or column. There is a reason those prices are so easy to change.", "Well done!", "Can you use ARKit in an app clip? I haven't seen a list anywhere of which features are and aren't supported in app clips.", "When I worked at a now defunct office supply store people would get mad the number of paper slips for pickup didn’t match the exact number in inventory.  \n\nI mean what", "If they run one of those scanner robots down the aisles at night, they could reindex everything.  \n[https://www.therobotreport.com/bossa-nova-2020-inventory-robot-includes-sharper-vision-for-brick-and-mortar-retailers/](https://www.therobotreport.com/bossa-nova-2020-inventory-robot-includes-sharper-vision-for-brick-and-mortar-retailers/)", "Like so much of the fantasy of what AR could be, its ignoring all the practical real world problems in favour of pie-in-the-sky. Would it be good if this worked? Yes, it would be great. But the obstacles to making it work are enormous and this video only addresses the simplest one, giving the user an interface.", "It’s possible part of the application could recognize the product packaging. But making that work in a cluttered retail display is a long ways off. Or a map of the current layout could be continuously updated by people using the app or employees rearranging and restocking the shelves.", "At Lowe’s and Home Depot, they do already have things broken down by isle and section within that isle. I go to home depot about twice a week and I would say it’s about 85% accurate already. maybe 95%. Wouldn’t take much to polish up that last but"]}, {"title": "List of app clips please", "comments": ["Here are a couple of them in Apple Maps: \nhttps://maps.apple.com/?address=Slottsbacken%201,%20111%2030%20Stockholm,%20Sweden&auid=16262966319962717011&ll=59.327016,18.072424&lsp=9902&q=Stockholm%20Palace&_ext=CiwKBQgEENIBCgQIBRADCgUIBhCaAQoECAoQAQoECFIQBgoECFUQDAoECFkQARIkKY5o6RNank1AMdiD4GR95TFAObMAxXxVtU1AQSh8H1uXPzJA&t=m\n\nhttps://maps.apple.com/?address=Djurg%C3%A5rdssl%C3%A4tten%2049-51,%20115%2021%20Stockholm,%20Sweden&auid=9857364337102546500&ll=59.325796,18.104814&lsp=9902&q=Skansen&_ext=CiwKBQgEENIBCgQIBRADCgUIBhCBAQoECAoQAgoECFIQDAoECFUQCwoECFkQARIkKTtImR5eqU1AMZgQGJBiGTJAOZv23ikuqk1AQRC5z+ClHDJA&t=m\n\nhttps://maps.apple.com/?address=New%20York,%20NY,%20United%20States&auid=3299940859798465496&ll=40.702803,-74.006143&lsp=9902&q=Pier%2011%20/%20Wall%20Street%20Terminal&_ext=CjMKBQgEEOIBCgQIBRADCgUIBhC4AQoECAoQAAoECFIQCgoECFUQEAoECFkQAQoFCKQBEAESJCk8Jpwn6FlEQDFuegbDb4BSwDl5lnvcElpEQEGD3bBtUYBSwA%3D%3D&t=m\n\nhttps://maps.apple.com/?address=11%20W%2053rd%20St,%20New%20York,%20NY%2010019,%20United%20States&auid=7324342225941186006&ll=40.761520,-73.977857&lsp=9902&q=MoMA%20The%20Museum%20of%20Modern%20Art&_ext=CjIKBQgEEOIBCgQIBRADCgQIBhAQCgQIChAACgQIUhAMCgQIVRAMCgQIWRABCgUIpAEQARImKSbPBpvmYERAMfBtndj2flLAOaSkLPcMYkRAQXxsOYg0flLAUAQ%3D&t=m\n\nhttps://maps.apple.com/?address=Oakland,%20CA,%20United%20States&auid=17690621080556991185&ll=37.801200,-122.273310&lsp=9902&q=Broadway%20%26%209th%20St%20Stop&_ext=CicKBAgFEAMKBQgGEOEBCgQIChAACgUIJRC8BQoECCoQAAoFCKMBEAESJCmtad5xiuZCQDGPGaiMf5FewDl1JJf/kOZCQEErvMtFfJFewA%3D%3D&t=r\n\nhttps://maps.apple.com/?address=200%20Larkin%20St,%20San%20Francisco,%20CA%2094102,%20United%20States&auid=12854031259650796816&ll=37.780268,-122.416175&lsp=9902&q=Asian%20Art%20Museum&_ext=CjIKBQgEEOIBCgQIBRADCgQIBhAQCgQIChAACgQIUhAMCgQIVRANCgQIWRABCgUIpAEQARImKck/6etK40JAMQ+Cf0b9ml7AOUcVD0hx5EJAQVkj2w5Dml7AUAM%3D&t=m\n\nhttps://maps.apple.com/?address=55%20Music%20Concourse%20Dr,%20San%20Francisco,%20CA%20%2094118,%20United%20States&auid=14911865229426143713&ll=37.769822,-122.466131&lsp=9902&q=California%20Academy%20of%20Sciences&_ext=Cj8KBQgEEOIBCgQIBRADCgQIBhBzCgQIChAOCgQIEBABCgUILxCAAgoECFIQBQoECFUQDQoECFkQBgoFCKQBEAESJCkDjxQn/uFCQDE/wf4lNZ5ewDmBZDqDJONCQEFVneb0ep1ewA%3D%3D&t=m"]}, {"title": "Any app clips I can try?", "comments": ["https://www.craft.do/s/jjuDLnYjy0igIS found those"]}, {"title": "Xbox App clips not showing up", "comments": []}, {"title": "Are App Clips actually available?", "comments": ["There’s even a subreddit for it.\nCheck:\n\nhttps://www.reddit.com/r/AppClips/", "There was a game that demonstrated app clips as a demo, no install needed. I can’t remember what it was called though!\n\nThe massive benefit of app clips will be for things like parking meters (which are going to take years before their operators update) so that you don’t need individual apps (pre-pandemic I had to have 5 different apps installed just for different parking places)\n\nIt’s similar to everyone who is upset that Spotify isn’t available on the HomePod natively yet even though it was announced to be possible. Need the 3rd party developers to actually create the app clip. The functionality is available and functioning on iOS 14. I believe we will see it more when more people are able to be more mobile given that their use case is perfect for advertising demos / quick trials / lightweight experiences etc.", "Of course they are. I have used some. Unwind - Mind Breathing is one among the many of them. \n\nDon’t you follow videos about betas? Or even videos that showcase changes of all new iOS releases? Cause if you do, so no way you would ever ask such thing. \n\nEveryone who does follow these videos, know that, I think it was iOS 14.3, even implemented support for AppClip via NFC. They are indeed working since the first 14.0 release.  Even Reddit has talked about this indeed. Check it for yourself\n\nhttps://unwind.to\n\nhttps://samagame.com/en/eight-apps-that-already-use-the-ios-14-clips-app-and-that-we-can-download-to-our-iphone/\n\nhttps://www.google.com.br/amp/s/amp.reddit.com/r/iOSBeta/comments/ihk1pk/ios14_db6_unwinds_app_clip_in_action_using_an_nfc/", "I used one at Panera recently", "They’re at my local gas station pumps for payment.", "If you want to try it out now; open Maps and find a Panera. There should be an order food option which will open an app clip."]}, {"title": "App Clips", "comments": ["I live in DC and a lot of app clips for nearby restaurants will show up in my Siri suggestion area", "I’ve seen them at gas stations and some food shops", "I’ve seen them at Mobil gas stations here in California."]}, {"title": "App Clips with Unity", "comments": ["Hey, did you manage to solve the problem or find something useful about the  App Clips?", "This appears to be a question submitted to /r/Unity3D.\n\nIf you are the OP:\n\n* Please remember to change this thread's flair to 'Solved' if your question is answered.\n\n* And please consider referring to Unity's official [tutorials](https://learn.unity.com/tutorials), [user manual](https://docs.unity3d.com/Manual/index.html), and [scripting API](https://docs.unity3d.com/ScriptReference/index.html) for further information.\n\nOtherwise:\n\n* Please remember to follow our [rules and guidelines](https://www.reddit.com/r/Unity3D/wiki/rules).\n\n* Please upvote threads when providing answers or useful information.\n\n* And please do NOT downvote or belittle users seeking help. (You are not making this subreddit any better by doing so. You are only making it worse.)\n\nThank you, human.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Unity3D) if you have any questions or concerns.*", "Bump"]}, {"title": "NFC-based \"Tap-To-Scan\" Flexa Network Functionality (iOS 14 App Clips)", "comments": ["Simple is gooder", "**hrmmm gooder, simple is.** \n\n*-THEYtookOURjobs2020*\n\n***\n\n\n\n^(Commands: 'opt out', 'delete')"]}, {"title": "Twitter users spot App Clips functionality in select restaurants", "comments": ["The toast Apple Pay clip is awesome. Did this at a restaurant about a week ago and it’s so great!"]}, {"title": "Xamarin.iOS App Clips", "comments": ["You just upload video clips and app images to Apple Connect when you upload your app. \n\nThis isn’t Xamarin specific, so feel free to hit up the iOS group of you need more specificity. It’s just part of the app submission documentation effort.", "It's not supported yet and it might not even be theoretically possible due to size constraints. There's an open github issue for it, which includes a workaround, but the workaround is writing the clip code itself in swift (or obj-C if you're a masochist).\n\nhttps://github.com/xamarin/xamarin-macios/issues/8932", "That explains it. I was going down a rabbit hole for App Clips rather than an App Preview. Thanks so much for the clarification. I was dumbfounded how adding a simple video could require what the App Clip was listing."]}, {"title": "Apple ARKit 5 — augmented reality for iOS: location anchors, app clips, face tracking, motion capture", "comments": ["Is that Kip from Napoleon Dynamite?"]}, {"title": "quick edit through the GoPro app, clips were during quarantine 2020", "comments": ["[deleted]", "Submitting footy? Perhaps you'd like to include it in our reddit quarterly edit. To upload, [join the r/Skateboarding discord](https://discord.gg/mrpjgkFRYY) and submit your clips to be included in our 2021 quarterly edit. Tag clip with year and quarter #2021Q1 from now till March 31st to be featured in the edit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/skateboarding) if you have any questions or concerns.*", "Haha thanks looking forward to the summer"]}, {"title": "App clips", "comments": ["I asked this recently too. This was one feature I looked forward too.", "In Victoria (Australia) the state governments contact tracing app uses an app clip, got surprised when it happened the first time! I just scanned the QR code in the venue, the prompt came up to open the app clip, put it my details and then left the app behind. \n\nI found that the app clip remembered my details for future times when I checked in as well which was cool!\n\nThe app appears in the App Library in the “recently added” section.", "Pandemic conditions probably haven’t helped rollout/adoption."]}, {"title": "App clips sightings?", "comments": ["[appclip in taipei](https://share.icloud.com/photos/0ISObzZUTqPdWxtZgFDrPWFvw)", "TikTok in iMessages", "I got a Dunkin’ Donuts app clip in the siri suggestions when i got a coffee there"]}, {"title": "WWDC: What's new for App Clips in ARKit 5", "comments": []}, {"title": "iOS 15: App Clips können als Karte in Webseiten eingebunden werden", "comments": []}, {"title": "AppClips", "comments": ["Appclips"]}, {"title": "Found this website to be a pretty good experience on Safari. Would you prefer these over App Clips?", "comments": ["Kinda neat ! I like how contacts are accessible in the messages [App](https://i.imgur.com/62dfMKN.jpg)"]}, {"title": "Ticketing agency lets fans buy tickets via NFC App Clips", "comments": []}, {"title": "App Clips at Burger King in Taiwan", "comments": []}, {"title": "Handling App Clips URL in React Native", "comments": []}, {"title": "Using App Clips in iOS games", "comments": []}, {"title": "App clip at gas station", "comments": ["Hell, more than 1/2 of the touch-less credit card readers on gas pumps don’t seem to work in my travels which I do for my job.", "Is this legit to pay at the pump? It looks just sketchy af. I saw these at my local station", "Why did I read that sticker as TL;DR instead of TDLR lol 😂", "My local gas station has an actual NFC reader so I always use that.", "Bug vibing tho", "Can a gas pump have any more QR codes? This is crazy.", "I advise everyone to make sure there is an actual machine/part of the card machine that scans Apple Pay at the gas pump instead of using these stickers. I saw this at a Mobil station once and got an error on the screen when trying to scan it. I then noticed there was an Apple Pay reader on the credit/debit reader so I scanned my phone on it and it went through. I later got a notification that my card blocked a fraudulent transaction of $100 from my card at Mobile while the other transaction went through. I was lucky enough that my card service tracked the transaction as fraud.\n\nEdit: I am aware that gas stations can place pre-authorization charges on cards. This instance my card specifically cleared the pre-authorization and actual charge as transactions. Typically the pre-authorizations do not show up under the transactions section of my account. It shows up under authorizations and is eventually removed when the actual charge is cleared. When I called my bank I was told my card declined due to what they thought was a double charge and the $100 being fraudulent. When I checked myself both were under transactions. I am not saying anyone created a fake app clip, that the app clip had glitches, or that Mobil’s system had glitches. Nor am I saying my card info was stolen. There are a lot of factors that can go into what happened. I’m just letting users know so they don’t run into being short money one day due to authorizations being mistakenly cleared as transactions on their account.", "I’d be very wary of using this to pay for fuel in Texas, you’ve no idea how much they’re going to charge you", "What’s the benefit of this when we have Apple Pay? I thought app clips were for like scooter rides and such", "TDLR: too didn’t; long read", "It’s funny for me to see cos as European I pay with Apple Pay everywhere, from morning coffee and groceries to my train tickets. Every single shop has contactless option for years now. \n\nWonder why it’s so behind in America and it’s just becoming a new thing", "I use the Exxon Mobil app to pay at the pump and it works great and I get a discount", "Looks like a Mobil station. FYI there is a Exxon Mobil app that allows you to pay with your phone, from your phone and most Exxon or Mobil stations. It works pretty great.", "Am I the only one concerned about the bug on the wall?", "Interesting. Most contactless gas pump in my area just use Apple Pay or other contactless payment method.", "How can you tell this isn't fake?", "That’s sketchy AF.", "Totally forgot about this feature", "Imagine people start making codes that take the money for themselves and just start sticking them over top.", "What is App Clip?", "[deleted]", "Is this new in America? In Europe we have had contactless Apple Pay / Android Pay at fuel pumps (among shops, bars etc) for like 6+ years..?", "This is a thing xd? Living in Europe sure feels like living in the Middle Ages sometimes", "I saw this the other day at my local 7-11/Mobil station. It felt sketchy.", "That’s Texas for you LOL", "That’s probably real, but looks sketchy af - but who else thought that Texas sticker was a TL;DR haha", "Why downs it just show the Apple Pay sign logo or contactless payment logo instead. This is confusing. For a moment it resembles some sort of laser buss eye stuff.", "Run. That bug will kill u", "Awesome! I just saw my first app clip at a local restaurant last night!", "Out of curiosity how does google pay work in US? I’m sure it works pretty differently than it does here in India.", "Fuck yes. I already have the Exxon Mobil app but it’s exactly the type of app that I only need a clip for and not a whole app. Can’t wait to see this popping up more.", "Tried scanning this and it didn’t work. Then I left the gas station and the clip finally popped up. Lol.", "Cellphone at gas station. The view will be magnificent.", "Over here in germany we still got the „dont use your phone“ sign at our Gas station 📵📵📵", "I saw this at an exxon as well just the other day. I was like oh wow", "Yeah these are at all the gas stations near me, they’re great", "How does this work. Tried so many yimes but such a fuss", "We have them in India and they’re all legit genuine enough because the fuel station folks would like the money and not hand it over to someone else. Also the fact that the name is picked up directly from the bank linked with your phone # verified with valid ID and address proof by the financial service providers and not give out custom name.", "The bug in the corner just like “Hey what ya dooin”", "Anyone else have the TikTok app clip? Its been showing up for me recently", "Actually use this everyday. The blue sticker is the only one that works and is actually the app clip QR code to the Exxon app. The Apple app clip normally provides an error. It will open up the actual Exxon mobile app and ask what pump you are at. You can sign up or pay as a guest using Apple Pay. It’ll authorize and bam pump turns on. If you ever used an app clip it’s a standalone preinstalled version of the official app. It’ll be hard to try to mimic an app clip knowing that Apple probably approves them.", " [kao](https://kao.com)", "I’m at the same gas station right now in Houston", "Infuriating when I seek out a newer-looking gas station only to find they have touch-free readers but they don’t work. \n\nShell is the biggest offender of this in my area.", "Every time I use Apple Pay at the pump mine gets flagged as fraud and my card gets declined.", "I found a gas station with contactless readers, but it seems like they only work with the outdated MSD contactless, not EMV contactless. It was really annoying and I tried two different cards from Apple Pay and both were declined. \n\nI’m so glad Costco accepts EMV contactless at the pump now.", "Using applepay cash vs an applepay linked bank card can cause an error at the pump. \n\nSpeedway owes me 120 dollars lol they keep sending me back and forth, I will never see it again. Two different times I’ve tried to use applepay cash at the pump and speedway drained my balance and then didn’t dispense any gas. Neither Apple or speedway will take accountability.", "The ones at friendly’s gas station have always worked for me. If only the Walmart gas stations, or really just Walmart in general, embraced Apple Pay.", "[deleted]", "I do it all the time. Ever since I had a card skimmed at a gas station, I only go to ones with apps or NFC on the pump.\n\nI usually park by the pump, pay on the app, and by the time I’ve exited my car the pump is authorized and ready to go. Grab, fill, go. Never been questioned!", "yes this is at Exxon, found out just being nosey and scanning it. They really need to put like a Apple logo or something.\n\nedit: at my location they didn’t have that app clip sticker just that blue QR code.", "Just use whatever gas station you’re at’s native app. In this case use the Exxon app. You can pay through the app with Apple Pay and sometimes get discounts on price per gallon and stuff as rewards. Shell has one too.\n\nThis sticker is super sketch. Anyone can put up a sticker.", "Personally, I prefer to use Exxon app.\nSelect pump number and when I installed the app it already asked if I want a paper receipt or email, car wash, etc.\nSo it's very fast and pretty difficult to be defrauded.", "danger anymore..", "I had it at my Exxon Mobil, too. They don’t work.", "##TL;DR \n\n#PROTECT THE PUMP\n\nsounds like something straight out of r/wallstreetbets", "Texans Don’t Like Readin’", "Welcome to the Texas Licensing Department of Regulation!", "Too Didn’t Long Read", "Thank goodness it wasn't just me", "Yes, I don’t trust random QR codes, especially ones tied to money, and gas stations are notoriously bad with skimmers and other fraud. \n\nI use either the gas card (very small credit limit) or Apple Pay at the pump.", "That $100 transaction was just the pre-auth charge from the gas station...", "That almost sounds like a hold by Mobil that was flagged as fraudulent, not something else. I currently have a $100 hold from getting gas at Mobil yesterday", "But… how would it access your credit card data from you having failed to scan an app clip", "Ya the $100 is what I get on my Apple Pay notifications when I get gas from the circle K across from me.", "A fraudulent app clip or QR code absolutely did not steal your credit card information or authorize a fraudulent charge.", "So, like the electricity then?", "Does it not show on the iPhone screen before you confirm?", "What?", "The pump probably doesn't have an NFC reader so this brings up an App Clip of the ExxonMobil app with an Apple Pay button.", "You can buy groceries, coffee, and train tickets with contactless payments in the US too. \n\nThe novel thing about this picture is the App Clip, which is new in iOS 14. I have yet to see one.", "> Wonder why it’s so behind in America and it’s just becoming a new thing\n\nIt's not. 95% of what I buy or pay for is through Apple Pay from my Apple Watch. Although I'm not going to restaurants right now for obvious reasons. But the ones I have gone to now have many more options to pay than they did pre-Covid.", "Largely because during the EMV upgrade / deadline, and rise of Apple Pay in the US, you had a couple parties at odds with each other\n\nApple and a few banks/cc companies partnered to push Apple Pay adoption.\n\nAt the same time you had Walmart and a consortium of retailers pushing their own QR based wallets called CurrentC (Walmart Pay, CVS Pay etc). The idea was to get customers to sign up for their individual wallets and link their banks so they’d bypass the credit card fees from the cc companies/Apple.\n\nThe latter group retroactively disabled contactless on terminals that otherwise support it. And since then some have reversed course but certain retailers/terminals may only support magstripe or chip only.\n\nRealistically you only see a few spots that only do magstripe but in doing so they assume liability if a fraudulent transaction happens.", "As an American I pay for almost everything with ApplePay as well.", "This has been the band-aid when pumps haven't been upgraded. Instead, users use the app (or App Clip) to pay and it \"unlocks\" the pump.", "The App Clip one would bring up a small version of the ExxonMobil app: https://www.exxon.com/en/contactless-payment-faqs\n\nI guess one could submit a fake App Clip to Apple, generate their own sticker, and go around to gas stations, but it seems a bit more work than some of the other scams that get pulled with gas pumps (skimmers, shimmers, etc.)", "Instead you going to the App Store and find app x and download it, you scan the QR code and it fetches just a tiny part of the app that is needed (or so the theory goes)", "App Clips are a new system for delivering small portions of apps that was introduced in iOS 14. The idea is that you scan one of these special QR codes then do something like rent a scooter or pay for food without having to download a complete app. \n\nLater on, if you feel like downloading the full app you have the option to do so. I personally haven’t seen any out in the wild yet, but I’d guess that we will start seeing more as time progresses.", "I didn’t think the using a phone at the pump was a danger anymore..", "Why wouldn’t you?  It’s not like there isn’t a big sparky thing under the hood / bonnet, or a hot pipe running underneath the car.", "Apple Pay is rare at gas pumps but Chevron, which is pictured here I believe, has an App Clip to basically let you pay with your Chevron account with a card you keep on file with them I assume. A lot of big retailers, including the largest grocer, Kroger, do not take Apple Pay, but have “Kroger Pay” which is a barcode in their app you scan where they debit your bank account directly, allowing them to avoid costly credit card fees. Target does something similar with their Debit card, which is a chipped card that debits from your bank account but only works at Target. The incentive is a 5% discount. Also even though it is not technically required anymore, many places that do accept Apple Pay still make you sign. Apple Pay is also near nonexistent in restaurants.", "It really depends where and the kind of businesses. Some gas chains have embraced it quickly, while others have installed NFC readers and haven't enabled them, and some have done nothing (the liability shift requiring EMV at least kept getting pushed back for gas stations).\n\nThe band-aid option has been apps where you pay using the app (Shell, BP, and ExxonMobil do it among others) and the entire transaction is handled on your phone and you just use the pump for pumping gas (you do everything on your phone in the car first, it activates the pump, you pump the gas, and then the receipt is shown/emailed). The apps were done as a way to quickly add Apple Pay/Google Pay support and generate some loyalty without upgrading pumps everywhere.\n\nExxonMobil added App Clips (as pictured above) to make it easier without having to download the app.\n\nFor the most part for me, other than sit-down restaurants, most of my purchases are done with Apple Pay (using plain-old NFC) and there's a handful of gas station chains that have working NFC on the pumps (Speedway, Meijer, Circle K, BP). Meijer (grocery store chain) has had NFC at the pumps their gas stations going as far back as 2014 at least.", "IT IS! literally anyone can make these stuff. stay safe out there folks", "In Canada we have been able to tap our phones at the pump with NFC for years and I have never heard of any catching on fire yet", "And probably owned by Circle-K’s. (Shells that don’t work)", "Yep it’s like don’t tease me with a good time!", "A station by me has touchless readers with \"coming soon\" stickers still on them, but they've been enabled for at least the last 6 months.", "Yah this is a huge issue. I’ve twice been robbed by speedway when trying to use applepay at the pump. Drained my applepay cash balance and didn’t dispense gas. Speedway says call Apple. Apple says call speedway. Great!", "Some gas stations will place a temporary charge on cards to ensure a person can pay. There is a gas station near me that sends a $100 temporary charge to every card (debit and credit) and the $100 usually only stays pending for a few hours but it can be annoying and cause weird issues like what you've mentioned.", "You still have to put your Costco card in the pump. \n\nYou can use Apple Pay but it won’t recognize the Costco Visa card as a Costco card if you have it in Apple Pay, only if you tap it instead of your phone.\n\nWhen you have to have a flowchart of “how to pay contactless” on the top of the pump and two of the three options AREN’T contactless you’ve already failed.", "My Costco won’t accept my card thru Apple Pay, but it works if I hold my card against it. Baby steps, I guess", "Costco still does not accept applepay cash for some stupid reason. Only bank cards linked to Apple Pay.", "That is supposed to be a proprietary “QR code” that Apple provides developers of App clips, which Apple verifies for privacy/security just as with any other app", "Ya, they need to put special strips or something on them to make them safer", "If you make your own, it wouldn’t be hooked in with the pump.", "I do this as well. Paying with the app is simple and it’s been nice with Covid since I don’t have to touch the machine as much.", "I haven't bought gas in years, do a lot of places have this option?", "because putting an apple logo makes it legit lolol", "... there is an Apple logo", "That blue QR code is for Exxon Mobil speed pass for paying inside the app", "Yeah but the Shell one sucks- more than half the time it says “unavailable at this station” even though I went there because the same mobile app said that location had pay & save.", "Exactly. Anyone who uses r/KaliLinux most likely knows how to use a QR generator. Simple as building a redirect GUI for users to enter their payment amount and hit send. For the majority of people the UI wouldn’t even have to look legit. Just the trust that too many have with contactless payment is enough for someone to capitalize on.", "What the hell is a hold and why does a gas station need $100 of my money? How do I avoid literally getting robbed from a gas station becuase I don’t have extra $100 laying around..\n\nHow about explain to me instead of downvoting me? I’ve legit never owned a vehicle and based on The explanations so far, you guys mean “pending charge” which I have heard of, but never ever heard of it being called a hold", "[deleted]", "[deleted]", "[deleted]", "Unfortunately it did not show up on my Apple notifications or transaction history in my wallet. It only showed up as transactions on my actual debit account when holds are typically under the authorization section before it is cleared as a transaction.", "Yep, I can’t believe it’s so highly upvoted.", "This…. I have a $300 electric bill this month…", "Considering it doesn’t know how much fuel you’re about to use… no.\n\nEdit: it says “[amount pending](https://i.imgur.com/TSYPFA6.jpg)”", "These app clip stickers are on Mobil stations here in CA. Thing is, they’re not hooked up to any actual apps. You wave your phone over it and get an error.", "If you're lucky you can do all of that, but if you're like the majority of people in the US it's a hit or miss with NFC payments and some places want you to use their app to pay instead.", "Yeah, but in Europe NFC is literally EVERYWHERE. every single store that accepts cards has one. Even in the countryside.", "If you want me to sign up for something like that make it worth the trouble! I’ve had Target’s debit card for a while now but only because it saves 5%. I wish they’d make that NFC instead of their stupid QR-like thing.", "This is considered secure?", "[deleted]", "Why does it need to be “Apple Pay” specific? I can use my phone or watch to pay anywhere that takes tap.... which in Canada, is basically everywhere.", "If a random person made this, would they not need to make a sketchy app to go with it and get it approved by App Store? And then when you scan it, wouldn’t it show on your iPhone and ask you to confirm?", "Call credit card company", "That’s interesting, because it should show up as a discover debit card and I thought they accepted all debit cards. I know they only accept Visa for CC though.", "nah, let them get a ridge wallet for their iphones.", "But I don’t see how it will control it. I can make one that doesn’t have anything to do with Apple. For a short time, I can make a legit sticker and replace the existing one, though that would only be temporary and leaves a clear incriminating trail. But I can see ways where it would still make a pretty penny.\n\nEdit: I know what an App Clip is. My point is making a QR code that looks and acts in a similar way as far as the average user.", "That's the point. Make my own, when user scans it, deduct money from his account and don't give him gas.", "Doesn’t spread on surfaces.", "It's becoming more and more available the last few years.", "It all depends on the direction of the leaf. \n\n/s", "Weird never had issues. That’s the one I use the most since T-mobile gives me 10¢/gal off every week.", "It's really not that easy and it's not a normal QR code in that way.", "> What the hell is a hold\n\nMany banks and credit unions do a hold on money. The amount varies but it's anywhere between $60 and 100 usually. This usually only happens if you select debit though.\n\n> How do I avoid literally getting robbed from a gas station becuase I don’t have extra $100 laying around..\n\nA hold is a hold. It's not a charge. It'll eventually go away in a day or two. Robbery would imply you do not get it back and still are charged the amount of gas. That's not what is happening.\n\n> How do I avoid \n\nSelect credit. And if you go over, expect fees from your bank. It won't be a fun day for you if you're trying to cheat the bank.", "You select $100 at the pump. Your car only takes $60. Your credit card immediately after the transaction says you spent an authorized $100 at the gas station, but the payment hasn’t been posted yet. After a day or two, the charge will disappear and you will see the $60 charge posted instead.  \n  \nA hold, also called a pre-authorization charge, is a charge that lets you spend anywhere within and up to a certain limit. It can be hard to predict how much fuel your tank will need without knowing its specific capacity, the exact distance you’ve travelled since your last refill, and finally what your fuel economy has been lately in order to figure out how much gas you’ll exactly need. So instead you can pre-authorize a maximum amount you’re willing to pay to fill up your tank.", "I’m pretty sure You get a pre auth / hold the moment you stick your physical card in the machine to start the pumping.", "It says „error when trying to scan it” i think you need to insall an app clip in order to pay using it", "Yes but your phone doesn’t give out credit card data to app clips. The only way to pay with your phone is apple pay. The fraudelent transaction must have a diffrent source because if you were to pay for something using your phone it would give you the standard Apple Pay UI and I think you’d definitely notice it.", "Call your bank. I had this same problem when I went on a road trip. There were weird $100 blocked charges from gas stations. Turns out, they were being flagged as fraud and denied because the bank for some reason thought my card was stolen. I guess going to gas stations across the country, like you would on a road trip, can flag your account", "Weird/creepy. I wonder if it’s malicious they even know the thing about making some gas stations charge $100 as preauth.", "Ours averages $300-$400", "Have you never used pay at the pump?\nIt preauthorizes a set amount and then only charges you what you use.", "I’m curious what the “clip” is going to be here. Will it provide some sort of beneficial utility, or is it just a cheap way of adding a payment method without upgrading the pump reader to one with NFC?", "And? The point of this being posted is the Clip, not because NFC payments", "Generally yes but there will always be bad apps and some may slip through apples app approval process. Always helpful to be just a bit skeptical what one download and use.", "This is literally as secure as you downloading the entire app and using it because that's pretty much what an App Clip is. You're basically downloading a piece of functionality from the app\n\nThink of it like skipping steps. Let's say at your local shop you always went inside and ordered their daily specialty drink. Then one day they create an app that made it easier for you to order drinks and on the homepage of the app they always included the specialty drink of the day. You download the app and you've been using it for a while but everything else they offer is a waste to you because you don't make custom drinks, you don't care for their bakery, you don't care for their community tab... etc etc\n\nSo Apple introduces App Clips and the local shop says you know what? How about we make a shortcut for our app. They pull out the process of ordering a specialty drink and put the entire process into an App Clip. So now you, and all new customers, can just scan the code and do what you've been doing since day one\n\nThat's basically it. The App Clip isn't a *new* app. It's part of the old app but it's a very specific process from it so it's literally as secure as the full blown app.\n\nNow, where you might get in trouble is if you have no idea what the original app looks like. So with Exxon for example... if you dont know that their app is called \"Exxon\" and you think it's \"MyExxon\" then you may be in trouble. Hopefully that gets caught in the review process but that's not always going to be the case. But it's worth mentioning that App Clips *should* use Apple Pay and to my knowledge you *have* to confirm the payment so if it looks sketch then just say no", "No. Mobile phones don’t cause “static electricity” to build up. There is no way a mobile phone signal can light gas fumes. The only “static electricity” might come from your clothes rubbing the car seats and even that is not enough, or have you seen gas stations randomly explode?", "A hot pipe can 100% ignite petrol. The chances of that happening are a lot higher than your phone being the issue when it comes to gas ignition", "It’s not, by Apple Pay I mean contactless. We’re only now getting contactless cards and terminals. Since Apple Pay became mainstream here about the same time as tap, no one really uses tap cards. Everyone just says “Apple Pay”. Even if someone’s card supports tap 9/10 people are just going to use chip. It’s weird.", "In this case, the credit card company is Apple, since it’s the Apple Cash card.", "it's an app clip, it has to be tied to an app on the App Store - it's not just a QR code and nfc on an iPhone does nothing until activated.\n\n&#x200B;\n\nin which case, you could put a QR code or nfc reader anywhere at any place and trick people - apple clips specifically aren't QR codes though.", "You’re not supposed to be able to make one yourself. Only Apps with app clips will have their own registered codes, if the code isn’t registered (tied to an app clip), the iPhone won’t recognize it", "I’m just guessing here, but wouldn’t you need to be in the app for the app clip. Your fake QR code wouldn’t work in the app. Sure you can put a QR code to some website or something but then the person has to enter card information and shit.", "Its content is cryptographically signed with a key Apple controls, and the iPhone won’t open one they didn’t sign themselves. You have to pay Apple and have your app approved in order to get one signed.   It’s mostly an effort to lock payments into the Apple ecosystem.", "His isn’t exactly true.  \nIt can be spread by touching a fomate. It is not very likely though.\n\nSo, continue washing your hands after touching things, continue not touching your face, but don’t stress about catching COVID because you looked at those jeans at the store.", "Then why wash our hands?\n\n\nEdit: I think you’re wrong, but I’m always open to learning. Can you provide a credible source that says Covid doesn’t spread on surfaces?", "Ah ok I never had a car but I’m used to us being broke and using cash, and only throwing like $20 on the pump. I don’t think I’ve ever seen anyone put $100 on a pump", "To clear things up, what I meant was experiencing holds being cleared as a transaction along with the actual transaction. The point is, both the pre-authorized and paid transaction showed up as transactions rather than the hold being under authorizations. With my bank, the amount I actually pay for at the gas station gets charged practically immediately while the hold remains under authorizations until it is cleared. However, this hold does not affect my balance since the actual transaction cleared. As I said, maybe it varies from station to station as well as card issuer to card issuer but I’ve been to other gas stations including other Mobils with the same card and never experienced this before.", "[deleted]", "Yes, yes they can. Up to date banks and credit unions use location data to determine if the transaction is possibly fraud-related. If you live in Texas and have a charge in Canada for gas -- odds are it's fraud and not legit. Some of the less modern ones go off of zipcode which can make things.. flakey.\n\nPut travel alerts on your cards for the days you plan on traveling. It'll save you a lot of grief.", "I’ve heard mixed things about the hold being based on your card issuer, bank, gas station, location (if you are pumping somewhere not local to you), etc. I believe by law gas stations can place holds from $1 to $150 but it’s due to the cost of gas per gallon which can range from $3+ nowadays and the possibility of customers not having enough money in their account when they do pump. You can avoid the hold by going in store and paying with your debit card by pin since you are stating exactly how much gas you are paying for as the pumps are able to prevent you from pumping any more than that.  I can usually use my card just fine even with a hold as long as I was charged for the actual transaction on my bank account. My bank clears the hold and the difference is available in my account within a few hours. But after it got declined I called my bank and they said they flagged it as fraud because it was one large transaction charged after another. I have a local credit union though so I’m not sure how long the process takes for other banks.", "I have, but that’s not what you asked. You said it shows on the screen before payment, but it doesn’t because it doesn’t know how gas you’ll use. It charges 1¢ and then bills the rest after.", "My assumption is that it is a smaller version of the Exxon/Mobil pay app they already have. So basically a way to allow you to use either your credit card or Apple Pay through their app. Think: Starbucks app. So basically your latter postulation. \n\nFor people that don’t know, App Clips are apps that run without having to install the full app. They’re  small and lightweight.\n\nSeems like the biggest reason companies like Starbucks and Mobil are building custom apps for pay rather than just using Apple Pay is not (solely) because they don’t want to upgrade their pay terminals. It’s because they want in-app point systems. I.e. “you just earned 50 points, 250 points more until you get $1 off!”", "Well I’m just saying I’ve seen a lot of Americans saying not many places have contactless, therefore Apple Pay. You were taking about that on your comment", "https://www.rd.com/article/never-use-phone-pumping-gas/\n\nAs I said it hasn’t happened yet but “could”", "Not wired at all.\n\nYou usually do not know where the “receiver” is on the terminal so you have to wave your card like silly. \n\nOn the other hand. The chip always work.", "Ah I see. Well next time only use Apple Pay or regular credit card. Cash card is basically like a visa gift card. I had the same issue you did but with regular apple pay and I had to call the credit card company to solve it", "No Apple Cash is governed by a bank too if you dig into the options... Discover", "I get that it isn’t a normal link. And I know Apple’s stringent process to get one. \n\nMy concern isn’t breaking Apple’s chain. I know that isn’t trivial. My concern is if people get used to scanning a code to pay, then somebody will make a QR code that routes to a website which is built to somewhat look like Apple’s process.\n\nHow would Apple block that? The one thing I can think of is if the phone can detect the layout of the sticker, and then block all QR codes from going to a URL.", "I get that. My concern is people scanning what they think is an App Clip when in fact it is a QR code.", "No.  Scanning the code causes the app clip to be downloaded.", "I know all this. My concern is a generic QR code that looks and acts like Apple.", "It is so unlikely that I’m not sure they’ve confirmed it ever happened. Fomates “live” for a long time on surfaces but it takes crazy amounts of “just-right” scenarios to get the active fomate into your system in a way for it to infect you. Obviously viral load is much more important and what-not. Washing your hands is for bacterial infections and the rare blood-borne infection that you may only encounter in a hospital. The ‘Rona is airborne and inhaling it is the vector for infection. And you need more than a couple of particles from a surface.", "The number one way to protect yourself from pathogens in general is to wash your hands...even if it’s not COVID-19. Please just wash your hands when you’ve been touching things in public. The average lifespan has drastically increased since hand-washing was promoted in the 1850s. According to a study published on the CDC “It is estimated that washing hands with soap and water could reduce diarrheal disease-associated deaths by up to 50%” and that is just looking at diarrheal diseases. Hand washing is the easiest and still, most critical way to reduce the spread of resistant bacteria in hospitals. I could honestly go on forever, and do encourage you to look up all the ways hand hygiene has saved lives! Be safe out there guys!", "So they don’t smell like gasoline", "Fauci said you don’t need to sanitize your groceries because you have a near zero chance of getting Covid from surfaces. I’m on mobile but I’m sure you can find that quote pretty easily.", "Covid is an airborne and requires a viral load higher than what surface transfer can provide to infect someone.", "Good question.", "There were few studies about it last time I checked, the primary way it spreads is by air and it’s [highly unlikely to significantly spread](https://www.webmd.com/lung/news/20200903/coronavirus-on-surfaces-whats-the-real-risk) through surfaces. \n\nThat being said there are plenty of other germs to avoid, washing/sanitizing your hands goes way beyond COVID(which I’m sure you already know).", "The only people paying $100 at a pump are the ones with pickups that take 30+ gallons of gas/diesel, and truckers/RVers.", "Dude are you stupid, before you tap there’s a button on the screen how much u wanna pre auth for, I can’t believe some people are so dumb and then still try to defend their stupidness", "You can’t. Pay. With your iPhone. By scanning something.\n\nIt’s not possible.\n\nYou need to download the app clip and in the app clip you’d get a popup asking you to authenticate to pay.\n\nYou’d need to either double press the side button or put your finger on the touch ID and you’d get a huge blue checkmark afterwards.", "Yeah, I learned that the hard way, when I was already halfway across the country", "Apple Pay does not share your card info, so how exactly are they billing “the rest later”?", "[This article](https://www.digitaltransactions.net/exxonmobil-deploys-qr-codes-and-nfc-tags-for-streamlined-mobile-payment-at-the-pump/) offers an explanation. My interpretation: they’re using it to advertise their app and encourage people to sign up for their rewards program.\n\nIf you don’t want to be advertised at, just use the NFC reader\n\n>\tConsumers who want to pay with a contactless-enabled credit or debit card tap the card against the standard NFC reader on the pump.", "I clarified that contactless payments have been in America for years are are by no means “new” as suggested. And pointed out that the point of this post is to show an Apple Clip in the wild, which is new everywhere. \n\nI made no comparison between the number of NFC readers in America and Europe.", "It hasn’t happened yet because it can’t. The electromagnetic radiation (the signal) the phone emits induces a current on a wire (that’s how antennas work) but a current doesn’t ignite anything on its own. If there is a spark it comes from something else entirely. In a regular urban environment there is so much em-radiation that if this was true the gas station would be exploding constantly.", "Where the logo is is where you’re supposed to tap it, but I agree the unreliability of the terminals contributes to this.", "Apple Credit and Apple Pay Cash are not the same thing", "It depends on how well app clips catch on. App clips themselves pop up on the phone, tell you the full apps name and what the app clip is for etc. it looks very different from what a QR code would have you do (use the camera, go to a website, confirm etc). but I guess in a heinous world, someone could devise a website to look like a native iOS pop up with a fake homescreen in the website itself, but iOS does a good job or at least letting you see that you’re on a website and not using something native to the os itself", "Ahh ok. I guess you could create a website that requests a payment and paste a QR code to that website in there, one can simply hope people recognize that it isn’t a legitimate site", "Ah well still Althea app would need to be approved", "For QR codes, you’d have to get people used to opening the camera.\n\nbecause as far as iPhones are concerned, it’s almost like (or actually is) a NFC tag or similar with info about the app. You don’t open the camera - you just hold your phone on it.", "Cool, I’ll take my advice from trusted sources like the CDC, the WHO, and doctors, not some rando on the internets.", "And if you can’t take your mask off, you gotta punch in your lockscreen code.", "I am not sure. All I know is that I get a temporary charge, than the full amount about a minute or so after I finish pumping.\n\nOn some of the newer ones it does say “pending”, so I wonder if there’s a feature built in for this scenario.", "Sorry I had posted then edited my above response while you were replying.\n\nFwiw though, they had their shitty rewards program before they went NFC. So at least part of it was trying to get a contactless payment system out faster that they could upgrade their POS terminals.", "We’ve had tap in Canada for years and tap is incredibly reliable. I go months without pulling out my wallet.", "I agree. It does it very well. The scenario I’m worried about wouldn’t fool a savvy user, even the slightest. I’m worried about that guy that responded to Bill Gates’ email that where he wanted to give him $100 million.", "That is exactly my concern. Apple has locked down NFC so it should be fairly safe.\nBut then why is there a QR code-esque pattern? Does that do anything?", "Yeah they both say that surfaces aren’t the “common way” the virus spreads. The fomite stuff is from very early on in the pandemic.", "That is a preauthorization. Gas pumps have worked this way for ages, long before Apple Pay. You pre authorize with debit or credit, usually you can select an amount but if you tap a card it selects an automatic amount that is enough for most cars.  Usually $100 or $150.   Then you fill up and it charges what you used, releasing the preauth.  \n\nThis does not save or share your card info and it does not enable the store (or sketchy person placing a fake tag) to gather your card info or charge you again later.    It’s just a “check” so to speak that you have enough to cover your transaction so you don’t just pump and drive away without paying or risk your card being declined.", "Your guess was spot on then!", "As for why it looks like that, no clue\nBut pointing my phone at the picture with the camera open does nothing. Not even a pop-up.", "Correct common is the key word there….\n\nTo bad you have it set in your mind that it’s impossible to catch. To bad simply washing your hands appears to difficult for you.\n\nhttps://www.cdc.gov/coronavirus/2019-ncov/global-covid-19/handwashing.html\n\nhttps://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/prevention.html\n\nhttps://www.unicef.org/coronavirus/everything-you-need-know-about-washing-your-hands-protect-against-coronavirus-covid-19", "I’m not confused about that. Someone said they didn’t know how much it was going to charge, you said “Doesn’t it show on the phone?” I said no, because it doesn’t know how much fuel you’re going to use.", "Thanks. That takes care of more concern.", "I’m not arguing or being pedantic. You are being very defensive like someone on the internet is trying to change your mind. All I’m trying to get across is that the actual science is saying that fomite transmission is virtually impossible with this particular virus. Health organizations have to have wide ranging guidelines of course and have to err on the side of caution. But if you read what infectious disease experts are saying, it’s all about aerosols with this virus. The fomite fear is from when they were able to show that the particles were able to stay “alive” for a very long time. That hasn’t changed but it’s very difficult to get the virus into your lungs from inhaling small amounts of fomites that were stirred up from a surface. I never said I don’t want to wash my hands lol. It’s just important to know how stuff works, that’s all.", "But it would show you how much it’s preauthorizing."]}, {"title": "iOS Built-in Shazam music recognition is now an App Clip", "comments": ["As a veteran iPhone user and Apple fanboy, app clips are still confusing to me.", "i was at a restaurant and got a notification that their menu is an app clip. Was much better than using their website", "Lol I completely forgot about app clips.", "I hope this gains traction and Apple can take it further than Android did, on Android they have “instant apps” that are basically App Clips but I’ve only seen it work ONCE (I think it was the Vimeo website) and it’s basically never advertised. Hopefully with Apple marketing Android can improve on it.", "[deleted]", "[deleted]", "I didn’t actually know Shazam is now in the control centre. Will save me lots of fumbling with Siri when needed. There really should be a master change log", "I've still never encountered app clips.", "How does that work? Don’t app clips require a QR code, NFC or URL?\n\nI guess the Siri command sends a URL to the iPhone to open the app clip?", "This reminds me of using my first app clip at a mobile gas station, super cool and convenient, though I ended up downloading the app.", "I don’t know about other AppClips but Shazam, after integrating it into the control centre, I’ve totally uninstalled it and use the control centre button to recognise any unknown music. Apart from that I don’t use it at all.", "Can’t you just ask Siri what song is playing? Always works for me.", "p,aaaz,a,ass,as,a,@z,,a,aza,a,ass,a,za,a,azz,,aaazaaaaaza,,,zaaa,as,aza,az,,,,,,*,*////⁰", "App Clips <> Clips App\n\nBut really, I am none the wiser.", "Still hate it that it opens the url in safari, and I gotta click to have it open up in Music.\n\nWorse, there’s a 50:50 chance Shazam won’t recognise my sub, and pitch me the plans forcing me to do it all over again.\n\n\nApple, skip the middle man. Have Shazam open the song directly in Music app for crying out loud.", "Does it store Shazam history yet tho?", "It’s a small part of an app. They’re required to be under I think 2mb so you can download them easily and they’re meant to be used for a specific task without downloading the entire app. For instance here in Victoria they’re used for contact tracing. We just scan the QR code, the app clip opens and we put in our details. They can also be used for paying. For instance at a fuel station there might be a QR code on the pump. There are many different uses", "It might help to think of it in terms of how it's meant to be used. \n\nSuppose you want to pay for parking somewhere and the way you pay is through an app. They probably have an app that will let you pay for parking but that same app probably does a lot of other things. It probably has a map of the parking lot, contact information, details about the area, etc. You probably don't want to waste your time and data downloading their whole app with all that unnecessary stuff just for this one off payment you need to make. \n\nSo app clips are supposed to be a thing where that company can make a tiny version of their app. It won't require much data to download and it only does the one thing you need it to (i.e. process a parking payment). Also, once you're done, you don't have to find that app in your library and delete it. \n\nSo it's basically trying to make those kind of situations more convenient and more efficient.", "I haven’t seen a single place or situation that this kind of thing would apply\n\nedit: i haven’t *been* in any situation that this would apply, places where i live have been slow to adopt this", "I think the idea is to be small parts of an app so you don’t have to download the whole app.\n\nEx: You’re in Starbucks, you can tap an NFC tag at your table and order from your phone rather than download the whole Starbucks app. Or you want to use one of those rent-a-bike things you see in cities, you can scan QR code and do it from your phone rather than use a frustrating kiosk\n\nOr at least that’s how I imagine it, I have yet to see or use one, and I’m doubtful I ever will\n\nAfter looking into it, you can use an App Clip to make mobile orders to Panera (at least from Apple Maps). Seems like something that would be really useful for the Apple Maps Yelp reviews so I’m not prompted to download the app every time I forget and try to read more reviews", "Basically they are quick demos of an app.\n\nYou know how some stores put QR code’s on the walls that takes you to the App Store to download their app?\n\nWell with app clips, when you scan said QR code, it will open a mini version of the app instead (assuming the store’s app supports app clips)\n\nSo let’s say they have a QR code at Starbucks.\n\nInstead of downloading their app, making an account, etc… you can scan the QR code and do your order instantly on the phone without making an account.", "I've been all iPhone since 2008 and elbow deep in Apple news and coverage yet somehow first heard of App Clips yesterday.", "As far as I know it is like those browser extensions. No need the a whole app and doesn’t consume much space. Just to perform a simple task.\n\n May be I am wrong, and like fellow redditors to correct me.", "i think the pandemic has really hindered their popularity/roll out. once the economy starts opening up again, hopefully companies opt to use them for things like menus, ordering food/drink, contact tracing etc.", "I don't install Shazam, but I have it on my control center, the name is music recognition.", "You can only see the app clip if you don't have Shazam installed, but you won't have the benefits of the full app, like shazam history, and you can't sync shazamed songs to Apple Music or Spotify.", "Just ask Siri what the song is. Always works for me", "You haven’t needed to install Shazam for years now, you just ask Siri to identify a song.", "You don’t need it. Siri has it", "I tried use one after they came out but never really saw them implemented. I wish restaurants used them for online ordering as websites can be strange sometimes but I don’t want all the apps installed.", "with Shazam in the control centre, it will also recognise audio your actual phone is playing too, for example a video with music off some social media site", "Fumbling about?\nYou just say the word “Shazam” to Siri. Just one word. That’s it. I’m not sure how that could be made any easier for you.", "I was just in Melbourne a few weeks ago and I was very impressed with the app clips for contact tracing. It was nice not having to download an app or use a web form like in NSW.", "10mb, but yes! They have certain triggers including NFC, QR, Special AppClip Code, and more. I guess Apple can now do it on Control Center Toggle press.", "Does an App Clip show under your purchases in the App Store?", "That’s seems awfully inconvenient. Have you seen how the NZ model works? You just scan and it’s done. It’s also totally privacy preserving. Your details are never shared unless you opt to do so (once you had a positive Covid test).", "Meanwhile the SA version opens a dumb website or an even dumber app 🙃", "I still don’t get how to use the app clip version for contact tracing… it never works and I just end up having to enter the app every time", "Thanks for the concise explanation!", "My hotel in Vegas used one to show me a map to my room from the front desk", "You could use it to quickly pay for parking somewhere if you're on vacation, you could skip the line at a restaurant by ordering from your phone, you could use it at an airport to get airline info if you don't travel much, etc.", "I’ve seen them used in restaurants for instant phone-versions of menus and bill payment. (while most places I’ve been to have a QR code on the table that loads a website of the menu)", "Parking meters", "Walmart pay lol,\nStarbucks pay,\n(Whatever the brand name) pay,\nBike rental,\nParking, \nEtc.\n\nWhy download the full app when your probably only going to use it once?\n\nApp clip is a temporary app basically.\n\nProbably like the difference between a story and a post.", "If you’re renting scooters in a city, it can download part off the app after you Scan singing on the scooter which well allow you to rent it", "I’ve seen a couple places in my city use them.", "Me, today, from this thread", "I have it too! But I had to install the app because I couldn't manage to find the place where the recozined songs get saved after I ditch the notification... Do you know where they are?", "a while back i tried the control center recognition for a song and it didn’t work. Installed Shazam and using the app itself worked perfectly the first time. not sure if that’s a coincidence or maybe the app’s better but i’ll be keeping it just in case lol", "[deleted]", "While I really can’t specify an exact time, I can definitely recall moments where I needed to Shazam a song but couldn’t/didn’t want to call Siri or use my voice. It is made “easier“, as the OP said, with it under the CC as a button.\n\nEdit: one time was probably during a movie", "I have Siri set to type, not talk. So I have to unlock (no Siri when phone is locked), invoke Siri then type. This is much easier now", "QLD is only just joining the game. Only recently did they roll out their contact tracing app which is super easy to use. Until then? A hodge podge of random web form systems.", "I mean here in NSW I like it, I already have my digital license on the app so always have the app installed, scan the QR code, and it auto fills and I just click check in? Takes like 5 seconds.", "I mean you are downloading an app, just a very small one for our standards", "And they’re better than loading a webpage, because they have access to more of your phones abilities than a website, like a typical app had access to. And you don’t have to ‘install’ and uninstall it.", "No, it’s doesn’t. It does however show in your App Library for I think 30 days or until you delete it", "That’s the same way the Victorian version works. You can choose to save your details for next time. On top of that if you have the service Victoria app installed it’ll open in that", "Do you have an iPhone running iOS 14 or later?", "That’s a cool idea", "You can do all that with a website, but yes it's just a more native experience.", "Wouldn’t all those apps require your payment information? Seems inconvenient to need to enter your info every time you shop at Walmart or whatever. Still don’t understand why America’s payment system is so segmented on phones, can use any type of NFC pay everywhere here.", "Yes there’s many ways an app clip could be useful, but the main thing is making be technology available and then developers will fund new ways to use it over time. Kind of like Apple Pay, at first it’s like, what’s the big deal? It’s not that useful because no ones using it, but as it remains supported year after year, the increasing implementation of it starts to make it more attractive.", "I don’t know if this is a recent change, but Apple Music now automatically adds songs you shazam’ed to a playlist called “My Shazam Tracks”", "You can find those in the iTunes app. You find list behind the (list) button in the top-right corner and then under the tab „Siri“", "They went to the *iTunes Store* app on iOS which never made sense to me either. Presumably so you can buy the track, but I'm an apple music sub. Within iTunes Store app its under the top right Wishlist menu, on the Siri tab. Yeah.", "I don't know either. Usually after I searched the song, I try to find it on Spotify.", "Well that’s your problem. Haha", "If only any government in Australia could’ve had the competence to build a simple webform and database, for all businesses to use, from the moment they mandated it, rather than allow a few dozen private entities to steal every Australian’s PII.", "Same here, having the app makes it very easy. But considering I was only in Melbourne for a few days, not having to download another app and still having my details autofilled was very handy.", "That's interesting, thanks.", "It’s not privacy preserving. As you mentioned if you don’t have the app it’ll store the details, presumably, on some government server.", "Currently on 14.5.1", "And people were doing it with a concierge before they had websites.", "But an app clip has access to the gyroscope etc, so more abilities and faster than a website.", "I haven’t used an app clip yet, but I’m pretty sure you can use ApplePay. So no need to input a payment method", "You can also use NFC payments anywhere. Things like WalMart pay don't require to use them at Walmart. It's like Apple pay vs Google Pay. They all use the same underlying tech to actually process the payments.", "I believe it gives you the option to download the full app later on if you want to. The idea is that if lets say your visiting the US or another country and only use it once. Then you don’t have to keep it and it removes the hassle of deleting it.", "Yes until you update iOS and for some reason it breaks and you have to re-sync it all. :/ Annoying that this works consistently on Android moving songs to Spotify(!!) but not iOS Shazam moving songs to Apple Music.", "This must be new because previously they only went to iTunes Store app under the Siri tab on Wishlist.\n\nedit: just looked and I don't have this playlist on mine", "Oh yeah definitely, NSW should consider doing the same for people who don’t have the app etc", "No, no. It’s optional to save your details for next time. But on top of that, it’s gonna be on some government server anyway. That’s the point. You give them your first name, phone number and where you were at a specific time. All that’s going on a government server when you use contact tracing anyway.", "Try scanning [this](https://www.google.com/search?q=service+victoria+contact+tracing+QR+code&hl=en&prmd=sinv&source=lnms&tbm=isch&sa=X&ved=2ahUKEwi40puGttPwAhWk7XMBHZpSB5QQ_AUoAnoECAIQAg&biw=375&bih=635&dpr=3#imgrc=lu9O-awrQaM0nM) (don’t actually fill it out it’s a random one I found on google) it works on my end", "Sadly, your first sentence is incorrect. NFC payments aren’t everywhere, like Home Depot.", "It has the pop up, but the only option is to open the app. That’s where I get confused as to how it actually works", "Sadly they aren’t available everywhere in any country. I’m responding to the idea that in America, things like Walmart Pay is a thing that you have to use in order to shop at Walmart and that the payment system is fractured up in this way.\n\nIn most countries there are places that don’t accept NFC payments.", "You just tap open! At that point it’s already downloaded to your iPhone", "…. I thought there was a different feature lol. This is what I have been doing the whole time, but I always thought app clips were a different thing I was missing. Ah well. Thanks anyway lmao", "All good!"]}, {"title": "[Fred Meyers and maybe Kroger US] All Legos 20% off plus extra 20% off with digital app clipped coupon.", "comments": ["I got the Medieval Castle 31120 for only $63.99. Unfortunatly they only had 1 in stock so I can't build all 3 variations at once.", "Where does it say that all LEGO is 20% originally", "My local Kroger only had a few small discounts :(", "Better than Black Friday, thank you!\nThough I've barely recovered from the last one a couple weeks ago.\n\nIs this one time use coupon?", "Thanks OP! I got a pretty huge haul", "Where is Fred Meyer located", "Thank you, OP! I got the Pirate Ship 3 in 1, and the Speed Champions F8 and Jesko.\nMy store was out of the Medieval Castle 3 in 1.", "Made an account but everything good looks to be \"item unavailable\"", "75059 \n70728\n10270\n10217\n75244\n75288\n75257\n75257\n75256\n75256\n75157\n42125\n42096\n75969\n75969\n75954\n7605\n4840\n75272\n75272\n75293\n75291\n75948\n75980\n75278\n75278\n7834\n7914\n76078\n75947\n75318\n75249\n71719\n75968\n21319\n75917\n42107\n75249\n21054\n75968\n75284\n75254\n42079\n71746\n42122\n75286\n75301\n75940\n75286\n75291\n75255\n75255\n21042\n21042\n76165\n75277\n21046\n21046\n75274\n76081\n21125\n10265\n75273\n10271\n7669\n75273\n4738\n10275\n10269\n75941\n75174\n79108\n42093\n70903\n75283\n75242\n21045\n76102\n75281\n75281\n75270\n75280\n75299\n75967\n75250\n42104\n76896\n75966\n75966\n76895\n75246\n76157\n42121\n21320\n21163\n7142\n10258\n10262\n75298\n75969\n75297\n75300\n42122\n75967\n75298\n75298\n7419\n75299\n75270\n75270\n75269\n21051\n75281\n75266\n75267\n71043\n42082\n75969\n21325\n76107", "First world problems", "[31120-1: Medieval Castle](https://brickset.com/sets/31120-1) [[Photo]](https://images.brickset.com/sets/images/31120-1.jpg)", "Their ad, the aisle, their website and my receipt. https://www.fredmeyer.com/pb/lego-/building-sets-blocks/2500500002?fulfillment=all", "Same at my kroger", "Is the QR code specific to local stores?", "Confirmed", "Yeah. It said one per household and expires the 23rd I think.", "What did you pick up?", "Pacific Northwest", "Is it all LEGO or just select LEGO?", "Yeah same here.  Only a few discounts.", "75315 10282 41252 71738 75272 75301 31119 31120 75302 42112 https://i.imgur.com/cPsOiXn.jpg\n\nEdit: come on Lego bot, where are you?", "All.", "You guys get a local Kroger?", "Are you me?? Haha my Freddy’s haul was just about the same dollars wise, picked up the castle 31120, another dragon to go with it 31102, Hogsmeade 76388 to go in the winter village that we’re starting this year, 76175 spider-lair because it looks ridiculous, and Minecraft 21176 to go with the kids redstone set from last year. Very happy with the savings we got for sets I’ve been wanting to pull the trigger on!", "Thank you!", "Weird, the bot responded but it’s not visible.\n\nhttps://reddit.com/r/legodeal/comments/qwzr8f/_/hlekczh/?context=1", "[31120-1: Medieval Castle](https://brickset.com/sets/31120-1) [[Photo]](https://images.brickset.com/sets/images/31120-1.jpg)\r\n\r\n[31102-1: Fire Dragon](https://brickset.com/sets/31102-1) [[Photo]](https://images.brickset.com/sets/images/31102-1.jpg)\r\n\r\n[76388-1: Hogsmeade Village Visit](https://brickset.com/sets/76388-1) [[Photo]](https://images.brickset.com/sets/images/76388-1.jpg)\r\n\r\n[76175-1: Attack on the Spider Lair](https://brickset.com/sets/76175-1) [[Photo]](https://images.brickset.com/sets/images/76175-1.jpg)\r\n\r\n[21176-1: The Jungle Abomination](https://brickset.com/sets/21176-1) [[Photo]](https://images.brickset.com/sets/images/21176-1.jpg)", "Excellent choices! It was hard to stop. My cart was a little embarrassing at checkout"]}, {"title": "Another WhatsApp clip for yiz.", "comments": ["I know this has been said a hundred times but it genuinely bamboozles me that the DUP have done so much to assure a united Ireland", "They wanted Brexit they got Brexit, any unionists wanted to destroy the Good Friday Agreement and the only sensible way of the British to leave the customs union is to put a British border down the Irish Sea, in many respects it's great to see the slow decline of this old failed Empire and the Unionists and loyalists coming to terms with the fact that not only did THEY screw the Union but also that no one in England actually cares about them or NI", "1.\tVote for Brexit\n2.\t Trust Boris Johnson & the Tory Party\n\nThere are your mistakes. Anyone with a brain could’ve seen this coming 5 years ago. \n\nI’m a Unionist who voted against Brexit and my conscience is clear.", "The most telling part of this whole video is the first sentence. The guy who voted leave and now sees the devastating consequences of Brexit would potentially entertain the notion of voting leave again, if given the oppertunity.", "Those face eating leopards are at it again I see.", "They vote for it own it . Now complaint about it. Typical God Squad. \nEveryone warned you whats happened its DUP own stupidity no one else to blame. Hahaha", "Voting for Brexit and then blaming the Protocol for the consequences is like driving your car into a wall and blaming the airbag for your broken nose.", "Sad I can only upvote this once.", "Blame the DUP, that’s what you get for investing trust in the Tories. No matter what community you’re a part of, blame the DUP and Tories. Or are we just going to forget the shady billion pounds Theresa paid to stay in power?", "This is what happens when you vote for something that had absolutely no direction or plan to begin with other than 'we want to leave the EU'.", "A rightfully angry and vocal minority. The majority of Northern Ireland voted to remain in Europe. The DUP represents 36% of the electorate. Last poll said they had 19% of the country’s support. They are the only Brexit supporting party in Northern Ireland. \n\nSo while their voice should be heard it’s shouldn’t be considered as the democratic majority. It’s just one small voice in a much bigger set of opinions.", "DUP \"Your United Ireland Party\"", "Wtf is the story with Unionists/Loyalists and their upwards inflections at the end of sentences? Wee Jamie there demonstrating this complete mystery.", "Oh no! If only millions of people had been screaming at you that exactly this was about to happen and showered you in verifiable evidence. SUCH a shame! \n\nSadly my schadenfreude is tinged with the sadness that these morons have dragged us all down with them.", "Very easy to be critical of Unionists with the current status quo. I'd prefer to reach out and ask them to look at the facts of whats occured and ask them what future they want when faced with a union that does not recognise or want them. They've been mislead and betrayed for years. Nows not the time for Nationalists to rub it in. Time for some honest self reflection.", "It's.like getting a nest of tables from IKEA and cracking on without reading the instructions and fucking it up so much it looks like a bunch of nettles and expecting it not to sting you.", "Keep up the excellent work Johnson. Keep throwing those bigoted thick Irish Dept of British Loyalists under the bus. Again and again and again. They deserve every tyre thread.", "If only someone could have foreseen this!", "I'm amazed that anyone in Northern Ireland could think that a tory government, led by anyone, could possibly give a shit about Northern Ireland. Ireland was just another colony to the English elite. Theyve never viewed Irish people, protestant northerners or catholic southerners, as their fellow countrymen. And the average english common man probably has no idea what the fuck Northern Ireland is or how its different to Ireland.", "[deleted]", "Where do you even start with a comment on this?\n\nI'm a nationalist that until recently believed in the Union.  I also believe you can be Irish, British & Northern Irish all at the same time. Having lived elsewhere in the UK you realise most people don't understand the situation or don't care. \n\nThe DUP thought that leaving Europe would create greater separation between NI & ROI, at worst regulatory and at best the introduction of some form of physical Border. The EU has been a huge influence on peace here both in terms of funding and by acting as another link that tied the North & South together. The DUP were a central part of the leave campaigns, allowing funding rules to be bypassed.  They spent more on one leave ad in a Newspaper no one in NI reads than they do in a year of regular ad buys here. \n\nBy propping up TM's government they thought they could push this agenda without consequence  despite NI voting in favour of remain. \n\nBJ threw them under the bus and they've now got a situation where we've moved closer to ROI.", "u/savevideo", "I hope that when history books are being written about the break up of the United Kingdom these clown's pop into everyones minds shouting \"we are the people\", shove it up ya, ya's troglodytes!", "Anybody want to give me a shareable link?", "There's definitely a very specific type of editing that goes into making WhatsApp videos. You can spot them a mile away.", "I suddenly want an Adam Curtis doc solely on this.", "Bangor says no? I thought bangor was a neutral couldnt give a flying fuk kinda seaside town place 😂 \nUnited ireland yooooo. \nBoris is a traitor? Nah not unless you actually live in London.", "typical unionists they take credit for nothing", "On those “all bets are off” daubs - is that supposed to be a Celtic cross?", "'yiz' speak English mate.", "I don’t believe Brexit would have passed at all if remainers had been so uppity, condescending and arrogant. Same with Trump. I think a lot voted out of spite and well, it’s their world now and we all have to live in it. Maybe don’t tell people they’re stupid in future. Tends to make peoples conviction deepen IMO.\n\nNow watch below as my point is reinforced.", "A lot of fenians here.", "u/savevideo", "r/justiceserved", "Lol classic", "Guy at the start was my LLW teacher he was a nutcase", "Sinn Fein has done so much to prevent it too with their terrorist worshiping shite . You think moderate unionists want anything to do with that then you have another thing coming.", "It doesn't matter how many times London chucks this place under the bus, unionists just refuse to accept that they are the only ones that care about *the union*", ">no one in England actually cares about them or NI\n\nThis. I've lived in England for the past 4, nearly 5 years having been at uni for 4 and working full time for almost 1. Not once has a single person actually known that northern Ireland is 'separate' to Ireland. They think that it's just the same as north of England or south of England. I'm not Protestant or Catholic, I'm not British or Irish. I just like being Northern Irish, I love this wee country and all its weird people, no countries people are more sound. I hate being called British because the English just leave a sour taste behind no matter where they go and I hate being called Irish because I don't want to claim a different culture and N.I. tayto is clearly more superior. On the island of Britain there is only English politics, Wales doesn't exist it's just the west of England and Scotland is too far away to care, they're beyond the pale. Not a single person in England even gives a passing thought to the people of Northern Ireland.", "Put this way, Boris Johnson creating the post of [Minister for the Union](https://en.wikipedia.org/wiki/Minister_for_the_Union) setting up a [Unionist Unit](https://www.thetimes.co.uk/article/gove-picks-team-to-turn-tide-of-scottish-nationalism-q2srdvhxm) isn’t because they’re worried about the possibility of Northern Ireland leaving the Union. \n\nI think the reality is, if NI had a vote on its future within the union, you wouldn’t see the Tories put up much of a fight to convince you to stay with “the family”", "If you didn't know better you would think that the Brits manufactured Brexit to get rid of the North", "Correction, I hear that no one in England cares about Northern Ireland/Unionism and that is not true, I do and so do a large part of my social circle", "It defies my thinking how anyone could ever have believed anything coming out of bojos mouth. I just don't get it.", ">The guy who voted leave and now sees the devastating consequences of Brexit would potentially entertain the notion of voting leave again, if given the oppertunity.\n\nExactly. I presume he's some sort of Jamie Bryson 2.0 with extra drama and less irony. He still might vote for this disaster which threatens his \"culture\" despite explaining the lies and duplicity and disastrous consequences of doing so the first time. \n\nThey can't acknowledge that they fucked up. Not even a little bit.", "The Schadenfreude is the only thing getting me through", "*Surely they won't eat my face!*", "Perfect", "The kapow just made it for me.", "Very good point, there is obviously fear among the now minority reminders as we head towards reunification of Ireland. It's important that people are reassured their voices and concerns will be listened too. But the NI protocol is here to stay and the best way forward for NI is deeper integration with the EU and Ireland which will ultimately lead to a better quality of life for everyone on the Island as an all Ireland economy can be beneficial for all.", "Excellent point well made", "> They are the only Brexit supporting party in Northern Ireland.\n\nWhile I agree with your point, during the referendum the DUP were not the only party supporting Brexit.", "I actually thought the first guy was doing a caricature for a comedy sketch", "[deleted]", "Hardly unique to Unionists/Loyalists", "Yep Australians have the same raised inflection, its just part of our accents.  Apologies for being working class person from east belfast ffs. Also not a loyalist or a unionist so isnt just them.", "Pulling a face like you're shitting out a lego set is also very fashionable with them.", "An their \"h\"s", "Just a regional Ulster (9 counties) thing isn't it?", "Honest reflection isn't something the DUP can do", "Lol good luck reaching out, you'll just be told you lost and to get over it.", "Those ira terrorists deserve even worse. I would also say the same about their supporters but they are not even worth being called sub human.", "Show me where they touched you.", "In any other country the DUP would get voted into oblivion for what they have managed to do. Watch that not happen in the next election.", "Very brave to admit being an FBPEr seeing as they're a massive part of the reason there's a Tory government with such a big majority", "###[View link](https://redditsave.com/info?url=/r/northernireland/comments/lixwrn/another_whatsapp_clip_for_yiz/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/northernireland/comments/lixwrn/another_whatsapp_clip_for_yiz/)", "I don't use Twitter or any of that bollocks. Sorry.", "It's a target symbol. Much like you'd see on ATAT graffiti (All taigs are targets)", "Why is that?", "The only arrogant party when it came to Brexit in Northern Ireland was the DUP, they thought they could have their cake and eat it.\n\nWas there some condescension of Brexiteers in GB? Sure.\n\nBut overwhelmingly the case to remain here was based on the substantive issues.", "If the basis of your vote on life altering events is based on your perception of the uppityness of the opposition then you may likely be wasting your vote.", "Total abandoning of responsibility because the section of society that revels in calling anyone who disagrees with them \"snowflakes\" were so easily triggered by any criticism they preferred to tank the economy and shatter their precious union rather than address the criticism?\n\nThat's the most snowflake thing I've ever heard.", "You mean Cameron? The guy who bitched about the EU for a full 6 years before appointing himself the lead voice on Remain? He never represented me, and 75% of his own followers smacked his smug, hollow jaw. He wasn't credible, was he? The bloke's a thieving cunt whose bed was feathered by stealing from UK schools and hospitals via his father's slick Panamanian wheeze for England's rich. Stupid breeds stupid though.", "You're a hurt sad bitter little person. It must really sting to see your demigods fuck up so badly.", "I dunno why the mods here don't have automod automatically filter sectarian language and manually approve it where context necessitates", "Fuck off then if you don’t like it", "[deleted]", "Considering the demographic shift you'd either best get used to it or best get fucking.\n\nI'm guessing the latter doesn't happen often for you though so I advise the former.", "###[View link](https://redditsave.com/info?url=/r/northernireland/comments/lixwrn/another_whatsapp_clip_for_yiz/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/northernireland/comments/lixwrn/another_whatsapp_clip_for_yiz/)", "Try come up with one argument that isn't a themmins one please", "I was a Unionist and most of my family are Unionist but I am open to start thinking about what a United Ireland could look like and what a future as part of the UK would look like. Has nothing to do with Sinn Fein, just because I am open to the idea of researching the impact of a united Ireland doesn't mean I support Sinn Fein. Just as when I leaned more towards the union I didn't support DUP.", "If you're moderate then we're really fucked", "They care more about implementing a hard border in Ireland than any union. No hard border means their reason for existence is disappearing. The sooner they leave Ireland in peace the better. They’ll try to leave Ireland in pieces but will fail, dismally.", "[deleted]", "None of my English mates knew Northern Ireland existed till I met them. As you said, they just took it as the northern part of Ireland", ">They think that it's just the same as north of England or south of England.\n\nDepending on where you are, the North and South of England may as well be completely different countries.", "Again and again and again this argument, as if it's in any way relevant. Nobody is unionist for the love of the English. Fucking what?", "I'd say he's worried about publicly stating that Brexit is bad because his own crowd will eat him alive.\n\nTepidly stating that \"It might not be the best\" is as far as he can go while still remaining in his crowd of gammon.", "I think that's Moore Holmes, rare name even rarer person. Excused away the East Belfast show of strength as some community support event. They weren't a crowd of masked men, but rather they were all being COVID compliant.\n\nAlso, I had no idea Jamie was that squeaky.", "It's practically pornography for me at this stage.\n\nNever thought I'd say that about anything that has Arlene and Sammy's faces plastered so heavily across it.", "It sustains me.", "Leopard: *nom*", "[deleted]", "Yep! Really did not think that first fella could possibly be serious", "I'm working class Belfast and i don't sound like a lobsters latched to my bollocks, at least not monday-friday 🤣", "The H pronunciation isn't a new trend. It has been retained since they arrived here due to the separate school systems.", "Ye wha?", "You're \"touched\" in the head...", "[deleted]", "No worries. Wonder if the bots still work?", "I voted remain.", "And he stuck his cock in a hogs mouth", "Well said and fair play to you for your open mindedness.", "A United ireland is a terrible idea. The country will be torn apart. Making the troubles look like a bitch fit.", "Something that's so engrained in our lives when we're growing up on this island and how important it is to get it right etc. People would murder you in N.I. for misidentifying them as Irish or British but then you go over to Britain and you realise how silly it all is and how no one could give a fuck. Although the English still seem to think the Irish are barbarians, as anytime someone wants to give me a sly dig they'll remind me how I must be an alcoholic or a leprechaun or that I beat my wife or they'll somehow manage to work the IRA in there because they know it some how links to Ireland in a bad way but they're just not quite sure how...", "It's amazing, it's almost as if we don't matter to them... Also, my gf lives in England (originally Polish but moved here around 6) she never knew that Scotland was a different country until she was age 14. I knew then that I should just forget about explaining the whole island of Ireland situation.", "Don't worry, I heard that HS2 is gonna link London to the power house of the north. Every will be fine and dandy again, with endless summers and clear blue skies.", "The world has never been more connected, and people have never wanted to distinguish themselves from everyone else more than they do now because of that I think. Its happening everywhere. Borders being built and tightened. Us and them.", "Yeah, mostly for the hate of the Irish, which is way worse.", ">I'd say he's worried about publicly stating that Brexit is bad because his own crowd will eat him alive.\n\nIt's mind boggling. Even in a reality where he acknowledges that it has been a disaster, that they have been lied to, and this isn't what they wanted he/they still can't admit the folly of their ways or the wrong-think of the project generally.\n\nUntil there's an admission of guilt and culpability from NI Brexiteers including but not limited to the DUP, TUV and numerous Loyalist groups they deserve utter contempt and derision at every opportunity until they either own it, or the stink associated with it clings to them so badly that they are utterly synonymous with failure and inextricably linked with disastrously bad judgement .", "None of the major ones, but People Before Profit, TUV, and of course the DUP were all pro Brexit.\n  \nThe other two seem to slip under the radar a bit more when this comes up.", "[deleted]", "I love your misplaced optimism", "Where'd SF come from, it was about DUP lol", "Let's read \"you\" in general terms then and not specific to you. Voting on substantive issues based on personality and emotion is one of the reasons we got Brexit and trump. Not sure how it can be fixed though.", "It's just what's better in the long run for my son to at least even consider the options. It helps no-one when we don't look at all prospects.", "Hush now Sammy Wilson, you don’t even believe in dinosaurs.", ">The country will be torn apart.\n\nAs opposed to now where it exists in peaceful tranquility.\n\nIreland is already torn apart. Northern Ireland is an unnatural formation.", "Are you that stupid all the time, or do you save it up for the weekend?", "You either know some stupid people or are talking absolute bollocks", "Lol. HS2 has about as much chance of reaching Manchester as a champagne cork being popped in a London office - popped by one of Boris' personal friends, once they heard he's given them a blank cheque for it and a deadline of \"I dunno, some time before the ice caps melt\".", "Must have missed that memo. Having lived in London with various Irish people for 5 years, I haven't encountered a great deal of hatred, read:none.\n\nNot to fell your ignorant impressions, but I've also met basically no-one unaware NI is part of the UK. I don't know what morons all these posters are talking to.\n\nAll of which is completely immaterial. I don't decide my politics based on the education level of strangers, and neither should you.", "[deleted]", "[deleted]", "I love you both", "If you criticize the DUP without criticizing SF how will anyone know how cEnTrIsT you are?", "Yin and yang.. although they provide no balance or harmony", "Ireland is an over priced dump. No proper health care and homelessness is through the roof. But they always seem to have money for their greyhound blood sport", "Hahah I was at uni and worked at maccies so I'll leave you to decide. Most people I know are all under 25 so they were all too young or not even born when the good Friday agreement was passed. N.I. never would've been talked about when these people were growing up like.", "He's not really.\n\nI've lived with the same people for three years and have helped them understand the situation in the North.  They now understand it.\n\nBut before me, and when I meet people from their course, they don't have a baldy.  Even a housemate who wants to join the British Army after graduating doesn't seem to have a clue.  Sad, really.", "Apologies, I can see how my comment could be read out of context in this section of the thread. I don't mean that unionism itself is anti-Irish, I meant that politcial unionism in NI specifically is now entirely based on insecurity, hatred and being anti-Irish. They are clinging to an archaic version of what they think is British, which is actually completely out of step with modern day British life and values. In fact they are anti-peace, anti-compromise, anti-progress. It's part of why the UK govt want to distance themself from this place. It is because they have nothing to offer the people of NI that they will die out. They only thing they are for is themselves.\n\nI speak as someone who has just recently moved home to NI after 11 years living in England, so I know how both informed and ill-informed the general public are there. I choose my own political inclinations too. Everyone's experience is different! Peace", "UUP also now supports Brexit. Though they campaigned to remain in the EU during the referendum.", "[deleted]", "Shall we shag now or shag later baby", "Northern Ireland is a subsidised failed state that only exists because no UK administration wants to be seen as the instigators of a renewed campaign of violence in Northern Ireland.", "homelessness it through the roof, care to elaborate on this?", "Haha fair one.\n\nIt could be a generational thing, but I’m only 36 and my knowledge of Northern Ireland isn’t from the media or people taking about it but a general interest in the world around me....and I’m not university educated nor is my social circle, but we all know what the situation is in Northern Ireland", "If true that is very sad, but I think it says more about the ‘youth’ of today than British people’s appreciation of Northern Ireland", "Bingo.", "[deleted]", "I agree, of all the things to go after the people in this clip for (and there is plenty ammo) their accent should be at the bottom of the list.", "Not classist as i'm working class also.\n\nI'm being glib because these knuckle draggers played a HUGELY SIGNIFICANT part in where we find ourselves due to their tradition of \"No\" at every turn (in tribute to the partys founder perhaps?)\n\nNarrowing options until the only ones left didn't satisfy them either.\n\nThey are a joke.", "Ireland is a second world country. They couldn't afford Northern Ireland", "Not really, it's just sweeping generlised bullshit. I could say the antithesis re:irish republicans, and you'd rightly call me a prejudiced idiot.\n\nAnyone who thinks unionism in general, is rooted in the hate of the Irish, is completely ignoring the vast majority of unionists on this island who harbor no such sentiment.\n\nI'm sorry daddy taught you otherwise.", "UUP struggle to be anything other than DUPLite now a days. Its why liberal Unionists are going Alliance, the UUP offer them nothing.", "The brits can't either. We put 3 billion into the union annually. But Britain has to spend 7 billion to keep\nus afloat annually. If Boris had a bus that said the UK gives £350 million a week to NI, we'd all be buying southern tayto by now and paying for it with a larger social benefit cheque. I'm not saying ireland is perfect,  far from it, they're neck deep in church scandals and need to sort their shit out as well, but the UK regards us as a tick on the side that needs to be removed, but won't because they're worried we'll burst all over them.", "Lol, always nice to see the classics getting brought out.\n\nIt must hurt the whiplash from believing the DUP controlled May's Tory party and you were getting a hard border to now where Boris did what Tories always do and sold you down the river for their own gain.\n\nThere'll be statues raised for Arlene and Sammy across the whole island for what they've done to help bring about unification.", "https://www.gfmag.com/global-data/economic-data/worlds-richest-and-poorest-countries aye, dead on mate.", "He didn't say unionism in general though, did he? He said political unionism in Northern Ireland. Given that the DUP are the biggest political party in Northern Ireland and certainly the biggest unionist political party, who's behaviour is demonstably shamefully anti-Irish, I think he's spot on in many regards. \nPersonally I'm on the fence about whether being part of the Union or the Republic would be better, so kindly piss off with your \"daddy taught you otherwise\" condescension.", "[deleted]", "Yeeeeeeeeeeeeeeeeeeeeeooooooooooo", ">  political unionism in Northern Ireland\n\nThis is the general unionism I was referring to.\n\n>Personally I'm on the fence about whether being part of the Union or the Republic would be better\n\nAre you just dull then?\n\nAt least the leave campaign had an ongoing platform of misinformation. Republicans just choose to be wrong.", "SDLP isnt what they used to be but they do better than the UUP do at any rate. \n\nThey won two MP's in 2019 with the two largest majorities of that election for Northern Ireland's seats. And also held onto their twelve MLA's in 2017 where as the UUP lost six."]}, {"title": "Have any of you seen and used an App Clip organically?", "comments": ["Yup. Few of them for check in and food order in CBD Melbourne, AU", "Used one at a gas station, it was pretty cool", "A restaurant I went to had a QR code for their menu and it opened an app clip to display their menu which was pretty cool.", "Siri suggested an app clip for me at Freddy’s to order through Yelp.", "[deleted]", "There was one to pay for parking. Honk Mobile.", "Yep, our government covid QR code check in is an app clip. In Melbourne, Auz", "No, never. I’ve never even seen one.", "Like others have said they’ve been adopted by the Victorian government in Australia which a lot of restaurants are using for COVID check-ins.\n\nAlso here’s an example of a game demo using one, if you go to this page and tap the Play bar at the top: https://firigames.com/phoenix2", "My brother sent me an etsy link and I could buy the item through an app clip. It also had functionality to view the item in AR on my wall (the item was a painting).", "I’m not sure we’ve been out enough since App Clips were a thing to utilize them.", "I haven’t used app clips through the store/restaurant feature, but it has come up in other situations which I thought was convenient. The first was actually a demo for a game, it let me play a round as an app clip. The second was when someone shared a Tik Tok with me in iMessage; it let me watch that one Tik Tok as an app clip, instead of taking me to Tik Toks website through safari (I don’t have the Tik Tok app downloaded).", "I saw an app clip on an Exxon pump and got super excited because it was my first time seeing one. I tried scanning it, but the scanning app just said “No usable data found” when I scanned it.", "Someone sent me a TikTok recently and it opened the video via the TikTok app clip which was nice (because I don’t want TikTok).", "TikTok and Parcel both use App Clips", "Haven't run across a situation to use one but my company was looking to create one. Apparently they are pretty limited though and you have to jump through some hoops so nothing has materialized yet.", "There is a portable charger rental service (only available in Asia) that have app clips, which you only have to sign in with apple and pay with Apple Pay, no need to create a new account and have the app on your phone.", "Exxon moblie it was fast if you already got the app install", "I did at a Mobil about 2 weeks ago. Wasn’t bad at all", "We have a battery pack rental service here, and I was really surprised to see an App Clip card pop up after scanning a QR code. Though that seems to be the extent of it. imo it’s just because stores would rather have you to install the full app instead.", "I have no idea how to use. What are some tips?", "I barely go out in the age of covid and even when I do to pick up food or something, I usually just order from an existing app or from the website for pickup.", "My local smoothie place used an App Clip, but thats all I have seen.", "I feel like App Clips have been hampered by COVID. I’ve been to maybe 5% of the places I’d normally go to within the last year.", "Yeah, I haven't seen one in person either. I'm currently developing one though, will push it out this weekend if possible.", "I’ve yet to see one.", "Also the Service Victoria covid location tracking has an App Clip.", "Yeah the MCG check in uses them. Pretty sweet!", "My usual gas station has had them on all the pumps since the fall, but they aren’t actually setup. Scanning with NFC or scanning the circle code thing doesn’t actually find anything.", "This seems great. What is the experience like for customers on android?", "I like the coolnes of it but for a menu, what’s the difference with a regular QR that you point the camera to it and opens the web page of it?.\nIf it would let you order from there or call the waiter or ask for the bill that would be super cool then.", "Was it Applebee’s?", "Totally this. Didn’t come across them ever, added the Siri Suggestions widget to a stack just the other day and now I’ve come across several.", "Yeah, and it just opens yelp, which I already had installed. So I’m not really clear on the point", "Which iPhone?", "Did you have bad service? When I tried an app clip on my XS it loaded instantly", "It doesn’t show here (iOS 14.4) I even disabled content blockers\n\nhttps://i.imgur.com/0udIkEN.jpg", "yeah thought the same thing.", "This is what I’ve heard; the limitations and approval process have kind of held it back for niche applications. Maybe remains to be seen how much people care about using one of those versus a we code to website (which can use Apple Pay already), or even just a simple workflow built iOS app.", "https://youtu.be/sh9cQ3iIpIk", "They are often like a sticker with a special outlined app icon, that you can scan with your iPhone camera app, and it opens a “mini app” to give you a richer experience than like a webpage, but not have to download a full size App Store app.  \nA good use of it I’ve read about is for gas pump’s mobile pay, or for mobile car parking payment. Let’s you pay “in app”, while not requiring you to always have the Parking app be installed on your phone.", "I agree in part, but I also think it’d be a great use case for take out mobile ordering and mobile menus. Granted, as a user, I’d prefer the existing QR code to webpage for menus, so it’s hard to say if it’s be a good option.", "same thing here", "I had this experience. Was so excited to finally try one and was just let down.", "Not sure, it probably just opens their site with a pdf menu like you see in most other places.", "It depends on the digital infrastructure of the restaurant. Some indie cafe just points to a Dropbox PDF link, some bigger restaurant allow you to order and pay via the app directly though some kind of restaurant management system.\n\nIt all depends on what kind of system the restaurant use.", "It loaded a lot faster it seemed but the experience was basically the same. I’m sure it has more features the restaurant isn’t taking advantage of.", "It was a local Korean bbq restaurant. The app was called Spot Menus I believe.", "it's so that people who don't have yelp installed (most people) don't have to download the app to order.", "This is the exact experience I had that reminded me app clips exist; and same, like I already had Yelp so of course it opened immediately. Interesting.", "Smart App Banner is not supported in Private Browsing. \n\nCan you please exit Private Browsing and try again?", "Weird. Mine took a moment to show up but it’s still there, I’m on 14.4.1", "Thanks! This is neat! This is how I envisioned it being used.", "Wouldn't that require them to actually have an app for their restaurant? Most of the places I go to save for one of the local breweries don't have apps so App Clips don't make a whole lot of sense when they can do the same thing for cheaper with QR codes.", "Me too! I was in a hurry I wanted to use a specific card for gas. The App Clip didn’t have all the settings so I just opened up the full app I had already installed.", "This is the correct answer! I wonder why Apple has set that restriction. I only use Private Browsing. https://i.imgur.com/cmtHuAV.jpg", "Hmm, good point. I would like to understand that, whether one needs to have a complete app in order to have an app clip; I thought they were agnostic", "Showing the Smart App Banner requires reaching out to Apple servers with the webpage URL and information about the app clip associated with the webpage.\n\nIn Private Browsing, Safari minimizes the amount of data sent to both search providers and Apple. As a result, Smart App Banner is not supported in Private Browsing.", "I'm not 100% sure. The way I understood them was that you needed a complete app in order to have an app clip. But I'm not a developer, so I never took the time to really figure it out."]}, {"title": "New app clip integration in bus stops", "comments": ["There’s also a Tickets option for some transit systems, like the ferry in NYC:\n\nhttps://i.imgur.com/sLgwRqj.jpg", "Screenshot: https://maps.apple.com/place?auid=8348990865092443009\n\nnever seen this “availability” button before so I clicked it and it surprisingly opened an app clip, and one from an indie developer (?)", "Nicely done ☑️", "Nicely done ☑️", "Do you mean you _neither_?"]}, {"title": "Made my first app clip for my first app! Try it out at getfind.app", "comments": ["This would be great for WordSearches.\n\nEdit: Also, downloaded, this is just dope in general as well!", "# [getfind.app](https://getfind.app/)\n\nPosted this a couple hours ago but I forgot to remove the audio from the video 😬. Anyway, Find is an app that lets you find text in books, worksheets, nutrition labels, anywhere where there's text! It's 100% offline, free, and has extended VoiceOver support. Next week is its 1st anniversary, so I thought it was the right time to make an App Clip.", "That’s such a cool idea", "Great app and nice work with the App Clip. How was your experience? I'm about to start mine, but didn't have great experience with other new apple technology like iMessage Apps, it was super unstable and documentation missing or incorrect.", "Wow this is literally a Cmd+F for paper books 🙌🏻", "Wow nice app! How long did this project take you? And how many years of experience do you have ?", "Man this app is really cool  and the app clip too!", "Did you remove the app clip now?", "Thanks! Really appreciate it :D", "**hrmmm great for wordsearches, this would be.** \n\n*-Bastianator*\n\n***\n\n\n\n^(Commands: 'opt out', 'delete')", "Thanks. I don't have any iMessage extension experience or whatever either. This was my first time adding a new target too. But anyway, it's not too bad. When you do File -> New -> Target -> App Clip, Xcode generates all the boilerplate code for you. It's in the exact same layout as a normal Xcode project.\n\nThe hard part is once you are done with the App clip. I had trouble figuring out how to associate my domain with it. I'll probably write a blog post about this sometime... but try following this:\n\n\n# [Instructions](https://github.com/aheze/AppClipQuickStart)\n\nIf you have any questions just leave another comment or DM me.", "Yep! Hope it's helpful.", "Thanks! So back at the start of 2019, I decided I wanted to make an app. I bought the Angela Yu Udemy course and followed it until summer, so about 6 months. I only got to around halfway, but the other half was mostly on how to market/design your app. Right then I started working on Find. As a complete noob, I had to nuke the project after a couple months and start from scratch (everything went completely wrong, there was no code organization, no GitHub...). Eventually, I finished in April 2020 and launched it. \n\nAfter that I started working on open-source and other small projects. Find remained in a very beta-looking state until December 2020, when I got interested in it again. I released a complete redesign, v1.2, this February. Since then, I've been working on feature requests and bug fixes.\n\nSo I guess it took a total of 1 and a half years, from 0 coding experience to launch. Which means I have around 2 and a half years of experience.", "Thanks!", "Thanks for the response! This app would of took me like 10 years to make", "Did you take codedesign course ? Or only Angella 😍", "This is so great, thanks for sharing your journey!!", "Only angela. Design+Code? I've heard of it and the website looks very cool, but it was expensive.", "Yea 😣, thank you", "The Angela course is really good... you shouldn't need the Design+Code too. Although my designs used to be completely terrible so I can't say anything. But after looking at other people's apps, it got better."]}, {"title": "Zocdoc App Clip now showing in placecards for doctors", "comments": ["15.1?", "I'm on 15.1, yeah, but I'm not sure if this is exclusive to that or not. Could be server-side.", "I looked up the listing you posted on 15.0 and it’s not there.\n\nEdit: The Appclip isn’t there I mean"]}, {"title": "On the inside packaging for the pride watchband there’s an App Clip QR code.", "comments": ["And where does it take you when you click on a View?", "Do you mind sharing the App Clip QR code?", "That’s really innovative, maybe more bands will utilize it?", "Into the Apple Watch app letting you choose which pride face you want to use.", "So….you don’t REALLY need the app clip since you already have the watch app", "Nobody said you *need* it. \nIt’s just useful for anyone who doesn’t know a matching watch face exists.", "As if nobody looks at the Watch app ever?", "I don’t know anyone who goes there regularly, looking for newly released watch faces. \nApple Watch is marketed towards less “techie” customers and, for the most part, is a set it & leave it kind of product.", "New watch faces are released with updates only. So, if you’ve done the update, you’ll see the new watch faces. I just think Apple is trying to make app clips a thing that won’t actually ever serve a purpose.", "If you’re not aware that there’s a new face, you won’t go looking for it. \nMost people have automatic updates on, so they may not even be aware of an update, even less so of what it has changed/added.", "The watch give you a notification that it has been updated. You can’t be unaware of an update.", "That’s true, *unaware* may be the wrong word.\n\nMost “casual” users won’t be expecting an update and it won’t cross their mind until it’s already happened. At which point, they just tap “okay” or whatever and move on. \n\nThey don’t necessarily know it means there are new faces, which means they won’t go looking for them on the Watch app. \n\n\nLong story short, just because you say Clips aren’t useful, doesn’t mean they aren’t."]}, {"title": "Ticketek adds an App Clip for scan and go event tickets", "comments": ["I still have yet to encounter any of these app clips…", "Does it work with the watch?", "I saw one for a gas station and tried to use it instead of going inside to pay but it never worked and I ended up having to inside anyways.", "I saw one, at a gas station. Mobil I believe.\n\nI put my phone up to it and the NFC triggered the app clip on the bottom of my phone. There was an option to pay for gas, but tapping it didn’t do anything. I tried half a dozen times but I couldn’t get past the initial pop-up for the app clip.\n\nEither it wasn’t working, or I wasn’t doing it right. And if I wasn’t doing it right, then it failed anyway because it shouldn’t be that hard to use.", "Yep, still waiting to encounter them at least once. I imagine them really great, if they ever get implemented.", "I think the Service Vic app for Covid QR scanning used it, I think…", "Just found my first one. Paying at a restaurant with Toast Tab"]}, {"title": "Has anyone been able to get the NFC tag at ExxonMobil to work and bring up the App Clip for Apple Pay?", "comments": ["Yes but it took me a while to figure out that you have to place your phone higher than expected. The nfc tag had to be almost at the center of the phone. Which is weird because normally nfc tags get detected just by placing the top part of the phone on it. Not sure if it is due to the surface that the tag is sticked on.", "Every gas up I do this and it works every time haha", "What phone do you have. I realized today that if you have a 10 or below you have to hit “scan nfc tag”", "Do you unlock your phone first? And what part of your phone do you hold up to it?", "iPhone 12 Pro", "Where do you hit scan NFC tag on the X though? That was my last phone.", "I have the app downloaded but I tap and hold my phone on the clip", "Yeah so you just need to hold it above the tag with the screen on. Place the notch on the tag and hold. Shouldn’t take longer then 15 secs.", "There is a control center button you can enable if its not there", "Thanks! Maybe I wasn’t holding it long enough."]}, {"title": "EV Charger payment and availability trough App Clip visible in Apple Maps", "comments": ["I don’t get an appclip I just get a [prompt to download the full app](https://i.imgur.com/8mWjhSU.jpg).", "You have to click on availability, there it will prompt you to start App Clip!", "Oh that makes sense, I’m not getting that button"]}, {"title": "Apple Support App Gains Updated Coverage Details, Reservation Reminders and New App Clip", "comments": ["These are nice changes. One thing that still really frustrates me about this app though is it links repair info to specific devices instead of your Apple ID in general. \n\nI recently sent my Mac in for repair, and for extra security I logged it out of iCloud and wiped the drive before shipping it. Once it was logged out, it no longer showed up on the device list in the app, and the app was unable to show me anything about the repair status.\n\nIt would be great if there was just an “active repairs” tab or something that lists things linked to your account, even if the device isn’t logged into iCloud.", "Damn, Juli owns a lot of Apple devices", ">\tsomething that lists things linked to your account, even if the device isn’t logged into iCloud.\n\nMaybe I’m misunderstanding but if you logged out of iCloud, it’s not linked to your account *because you logged out*.\n\nAs an example let’s say you sell the laptop bc it’s got a broken screen. The new owner then goes to Apple to pay to fix the screen. Wouldn’t you see their repair status in your proposed scenario? \n\nIf you’ve just disabled Find My but are still logged in, this makes sense to be able to see, but once you log out, Apple shouldn’t assume it’s still your laptop.", "The repairs are linked to an Apple ID. If I sold the computer and then someone else requested service from Apple, they would give their email address/Apple ID and the repair would be linked to them, so I wouldn't be able to see it.\n\nWhile the device was away for repair, even though the app was unable to display the info as the device was off iCloud, I could log into the support website to see updates, and it used my Apple ID to log in.\n\nSo the functionality is there on the backend, it's just not possible in the app.", "Product registration details =/= Apple ID. Apple collects name, phone, email, and mailing address for repairs and registration which is related to the serial number, not an Apple ID. \n\nSigning out of iCloud and wiping the data off a device is the go-to method for relinquishing control/possession and preventing any sort of identifying information from being traced back to you via a hardware identifier (serial number, etc). \n\nHowever it would make sense to have a repair tracking formula like “serial + repair ID + Apple ID = repair tracking in Apple Support App” which would be only available while the repair is in progress. \n\napple.com/feedback I guess 🤷‍♂️", "Yes, that’s what I’m saying. That’s what’s available on the site - after it was wiped and out of iCloud it still could be looked up by signing in with my Apple ID on the support website. \n\nI mean, obviously the repair can’t just be based on what account the product is linked to, if that were the case then if you sent in something logged out of iCloud they wouldn’t know who to send it back to!\n\nAll I’m saying is it’s weird the website has this exact functionality and the app does not. If the repair is linked to an email that is an Apple ID, I should be able to access those details regardless of the iCloud status of the device itself."]}, {"title": "How do I program a physical NFC tag for AppClip?", "comments": ["Last time I worked with NFC I had to give my tags to the android dev doing the same work on my team to update them, as the Apple APIs didn’t support it.  (This was awhile ago and maybe changed.)", "Typically a good place to start (even though it’s HIG), it may link to where you need to go: https://developer.apple.com/design/human-interface-guidelines/app-clips/overview/app-clip-codes/", "There's a few apps on the App Store that can write the tags. I've just tested with \"NFC Tools\" with a Mifare Ultralight tag and it worked fine.", "Fantastic- thanks so much!"]}, {"title": "App clip and instant app from a react native app", "comments": ["I was able to make an appclip. it was pretty easy. I used this [https://nazrdogan.medium.com/create-app-clips-for-ios-14-in-react-native-abfade233fea](https://nazrdogan.medium.com/create-app-clips-for-ios-14-in-react-native-abfade233fea).\n\nA tip you won't find on the post. Create a new project just for the appclip. If you want to add a target to an existing project you will face problems when deploying the app to the store due to the max size of app. The aappclip may include a lot of native libraries you may not use in the appclip.", "I was able to implement them, you can try them by scanning the QR code from [menoo.eu](https://menoo.eu) (it's a digital menu for restaurants), the app is build in react-native and implements both an app clip and instant app.", "Thanks for this tip, really helpful!  \nI was looking to find out if you need to create a separate app for the app clip, cause this information is not available anywhere.   \n\n\nBut does this app will also appear on the app store? Like a separate app?", "Hmm thanks that’s a bummer... there’a no way to add it to an existing project?", "I tried to follow that tutorial link but to an existing project. I'm stuck now on the part where I need to add in the ViewController.m on the import part: `'React/RCTBundleURLProvider.h' file not found`\n\nAny idea on this? Did I miss a step u/odrakcir?", "Yeah but how did you do it?", "No, app clips does not appear on the app store. Only the main/parent app will be listed.", "it is possible. I was able to; but again, you may find problems when trying to upload the build to TF. AppClips cannot exceed 10MB so, if u adding to an existing project, your clip may have linked libraries that may not be used. I'd say go ahead and try. Perhaps your project doesn't have too many deps si it may work.", "lol, it looks like you forgot I'm also a developer, meaning, I forgot about this 10months ago. I'm sorry, I can't help you ATM.", "Anything regarding Android Instant app, have you tried/have seen anything about it?", "I wasn't able to play with it. I just saw an abandoned question on S.O but that was pretty much it."]}, {"title": "App clip code scanner (iOS)", "comments": ["Please tell me more about app clips. I do have iOS 14; just can’t find any app clips.", "We are on the same boat sadly, the clip was from the apple developer website. It had no data in it.", "I honestly wish these codes weren’t so rare.", "Agreed, there is a ton of potential. I guess companies dont want to put the effort into developing them."]}, {"title": "Make Async GET REST API calls in SwiftUI for Apple TV, Watch, Mac, iPhone, App Clip", "comments": []}, {"title": "App Clip stickers show up at Circle K gas station", "comments": ["That looks like the ExxonMobil solution for pumps (and the blue pump leads me to believe it's Mobil). I wonder if this was a Circle K (convenience store) and Mobil (gas pump) combo. All of the Circle K-only stations around me have installed NFC readers on the pumps and they're enabled.", "Can confirm, that is Exxon doing that. Uni Mart by me that has Exxon also has the app clips as well."]}]