[{"title": "Instant Apps Keeps wanting to update", "comments": ["Hi, please be informed that these updates are pushed by Google itself. In addition, please let us know the current version of the Google Instant App installed on your machine.", "The same thing occurs to me. It's the same version that Google keeps pushing out as an update. It is there every day as well.\n\nIt seems to be related to the version of Google Play that is installed in BS. The only fix I was able to discover was to download the latest version of Google Play from APK Pure and then force-stop and disable Google Play and install the updated version using the APK function in BS.\n\nFor some reason, Google Play doesn't update the version used in BS, so \"Seems\" to cause that same update to keep installing because that feature doesn't seem to be functional in the version of Google Play installed on BS.\n\nI \"think\" it might also be related to BS X and the cloud feature. Google Instant Play is basically the same thing.", "Hi there,\n\n**Google Play services for Instant Apps**\n\n**version 6.7-release-389738031**\n\nI realise that Google pushes the updates, but I thought maybe there is a bug in Bluestacks that prevents it correctly writing to the end of the file.\n\nSo, it keeps assuming it hasn't updated?\n\nIts doing it on all my instances.\n\nSorry, I don't know how it all works :-)\n\nI've sent in a support email to see if it can be worked out via that method.\n\nThanks for your reply :-)", "Thank you for sharing the details with us. We also attempted to update the Google Instant Apps on our end, and after the update, the same version number was observed as yours. \n\nIf you receive an update again, make sure that you have noted the version number both before and after the update. This will help isolate, whether the app is actually getting updated for you or not.\n\nGoogle may be pushing these frequent updates from their end if both version numbers are different."]}, {"title": "Instant Apps", "comments": ["There are unfortunately very few of them. Google seems to have largely forgotten about them, which is unfortunate. They're a really awesome feature, and I wish more people would make them.", "Vimeo uses it.\n\nThe experience is just terrible (as users don't know about it, don't understand that closing the app means it's gone, etc). I still wanted to use it and had an obscure recycler view layout issue.\n\nDon't do it.", "Never seen/experienced an instant app, let alone set up on one I developed. I don't think they have any advantage over a website. Just make a website.", "I think Yahoo Finance might have one - there used to be a list of instant apps somewhere. The level of support/documentation has been about the same since they were first released, but I think you can have 10MB apks instead of just 4 MB now. I too like the idea. Removes a bunch of friction from getting an app experience"]}, {"title": "Why You Need To Stop Using Instant Apps On Your Android Phone", "comments": ["Here's how I know I'm old: I have no idea what an \"instant\" app is.", "Never encountered an instant app though. Every time I use a website that has an app on the Play Store, they just prompt me to download the full version.", "“Nobody uses instant apps or even knows they’ve existed for 6 years, but here’s an article about why you shouldn’t use them anyway.”", "Why would I not download an app I want to use. \nWhat's storage meant for?", "all I need is solitaire to play when having a shit and im good.", "I know this exists and was announced quite a few years ago, but I've never actually seen an instant app in the wild.", "i’m young and have also never heard of an instant app. i even study computer science", "It’s cool, they’ve explained it in the very first sentence of the article.", "I had to check the article to be sure, but it seemed familiar. But then i kept following Google IO news for some years, before it became clear that they were starving AOSP in favor of their closed up apps.", "Their reasoning being \"a hacker might do something bad with them one day\" is pretty vague and stupid too.", "You didn't read the article", "Vimeo is the one gets me every time. I rarely use it. When I do I am always surprised by the instant app notification", "Also in IT, never heard of the term instant app, I feel I know the concept without a proper name.", "Just graduated college and studied CS and I've never heard of it either", "so you're not young\n\nactually I also study and I do know, maybe it's because samsung heavily advertises jt", "I agree.  I read the article... I'm just saying the headline makes me feel old.", "Happy cake day!  \nTo me, Netflix is still that company that sends you DVDs in the mail.  \nIn fact, Netflix still maintains this service, and their DVD catalog has probably ten times more content than their online offering.  I've been a Netflixer longer than many redditors.", "[deleted]", "Tell me about it. Streaming apps?! In my day we downloaded them and we liked it! (╯°□°）╯︵ ┻━┻", "Not only is it useless. It is mindless. The person writing it has no knowledge of the history of web apps and shortcuts. Android and IOS have had this since early times.", "You don't even know what the article is referring to.", "[deleted]", "I read the first few paragraphs and got a pretty good idea of what they are", "No it doesn't. It explains it perfectly.", "no it doesn't you can't even say what its talking about.", "It's quite literally the first two paragraphs:\n\n\"Did you know it's possible to use Android apps on your smartphone without actually installing them? Google calls them instant apps, a neat innovation originally introduced at Google I/O in 2016.\n\nNow referred to as \"Google Play Instant\" (via Android Developers), instant apps conveniently show content within the app's native environment without a full install, via Google sort of \"streaming\" its user interface and content to your device. You'll most often see a prompt to use an instant app when you're searching for content or shopping through Google search. Instead of reading that content in the website's standard native view, Google will offer to take you directly into the app and show it there, almost as slick as if you'd fully downloaded it.\"", "Thx I just didnt want to have to read the article and was looking for a summary. But that is some good info about streaming apps I will definitely check it out."]}, {"title": "Are Instant Apps dead?", "comments": ["They were never alive.\n\nAtlassians Jira looks like released an Instant App recently, but imho they work only for content focused platforms anyway.", "LOL Instant Apps...", "Just like slices, they are.", " Never encountered instant app. Even feature rich super apps just bundle the whole thing into single install.", "The only instant app I regularly encounter in the wild is Yahoo Finance. It doesn't have full functionality (e.g stock comments) so I always switch back to the standard website instead.", "Senior Android Developer for the company I work for here.\n\nWe never implemented instant apps and had 0 plans to. Our app would not modularize nicely since it is mostly just a content app and certain portions of our app are heavily dependent on other portions. The way instant apps and feature modules in general need to be written doesn't fit with a lot of our requirements or what our clients want.\n\nAlso, I never really saw the point of instant apps in the first place.", "I saw one instant app in the wild but I deadass cannot remember it. But instant games are alive at least.", "It's probably worth mentioning that there is a difference between an instant app and the try now button in the play store. The try now has a 10mb limit and instant apps have a 4mb limit. The try now button also really seemed to be marketed for games to dip your toe and not download all 100mb+ to try a game. \n\nCan't say I've worked at a company that released an instant app because it would require significant modularization to enable an instant app. I did build a simple instant app myself to display content, but it was a green field and simple project to play with the concept. I do think there are some good use cases for them which require payment processing with Google pay and users don't want to download your whole app forever. \n\nThe only instant app I have seen in the wild was Jira, jet, and parking. I could see restaurants being useful perhaps, but haven't seen one. It does seem like I have seen more iOS app clips, but even those are few and far between because a lot of big companies need to tear apart their app to be ready for a project in this space.", "Ian Lake mentioned in the [Nav talk here](https://www.youtube.com/watch?v=4srssoBo0HU) around 23 mins that dynamic feature modules is the new kid on the block now", "Instant app is a failure", "[deleted]", "My mom has sent me news links in the past (both Yahoo and CNN) and both opened Instant Apps. I was pretty impressed at how seamless it was, but they are quite rare.", "If you use the Google Play Games app, there are lots of instant games available. I guess they aren't getting any attention in Google Play though, since instant apps don't count towards installs, which likely affects users' first impression on the game/app's popularity.", ">They were never alive.\n\nThis. The day they were announced, the general reception to that was \"...so a website, but with less functionality\".\n\nInstant Apps was a solution to a problem that didn't exist.", "I like the idea of slices, I find them cute.", "Hey, at least there are APIs for instant apps and some apps worked on that and released as instant apps.", "Stack Overflow had one when the feature was new, but it disappeared really quickly", "The point is to replace the annoying \"download our app\" banners on websites with just opening the app. Let's say you search for houses to buy in some city, tap the result for some real estate aggregator and you land in their nice app instead of having to deal with a mobile website.\n\nOr single-use apps: you scan the QR code at the parking meter and can pay for your parking in the app. You are done, app is gone.\n\nBut of course in practice almost nobody uses it.", "Where did you find the limit of 4mb vs 10mb? Do you mean with above 4mb doesn't activate the fast automatic download after tapping on link properly setup with the manifest? \n\nDidn't they change it to 15mb years ago? E. G. https://developer.android.com/topic/google-play-instant/guides/reduce-module-size#:~:text=You%20can%20also%20release%20an,enforce%20th\n\nIn my company, we have and it never really worked by opening the link, but just try now on the play store and we had no way to understand why.", "What? Those solve an entirely unrelated problem. But I guess that's Google for you.", "Is it worth to have an instant app (traffic wise)?", "And they killed their native app right, which I thought was pretty good", "The interesting thing is that if the app need to expand the feature into another/3rd party app service then the app just open mobile web to that service inside the app. I have seen this in wechat and other super app where it integrates other app by using webview it makes more sense than using instant app.", "This is not a criticism to instant apps but a genuine query; why would one prefer to develop an instant app instead of a mobile website?", "Up next: Jetpack Preinstall™ - preinstall feature modules via Play Services right out of the factory", "[deleted]", "The limit is 15MB so I'm surprised. I have a pretty complex app (30+ screens) on the store and it's only 7MB total. I never tried instant apps though."]}, {"title": "⚡ Indyglo's Featured Instant Apps! ⚡", "comments": []}, {"title": "Step by Step: Chart Viewer in #ArcGIS Instant Apps", "comments": []}, {"title": "Any opinions on Instant Apps in currentYear?", "comments": ["Google hasn't really seemed to push them, they are a very cool but niche product idea. The use case for them can be difficult for companies to justify and the only helpful one I have found is to pay for parking. \n\nI will say you don't really need a tutorial for instant apps in compose because that's just the view implementation, the only relevant tutorial one would need is how to set up the instant app module with the activity. From there using views or compose in that activity is straight forward.  \n\nOne other thing I have heard of companies that have a proper website which implement an instant app, is you start to see dropoff from your website because people are getting loaded into your instant app which can drop your tank in search results. Hopefully Google has fixed that by now..\n\nSo if you can find a good use case, go for it. Just know there are engineering challenges to modularize your app to fit within the 4mb size which might be easier with app bundles now.", "A solution looking for a problem. as an Android user, I tried to use them and found it pointless. it's pretty easy as it is to just normally install and delete an app if you don't like it. \n\nwhat we as mobile app developers are really competing with is responsive mobile websites that do 90% of what users want if they don't want to install an app.\n\nso in conclusion, I'd say don't bother implementing", "I implemented it like 3 years ago for a small game, but only had headaches with it, and the UX seemed bad (apart from the instant installation) so I built it out.", "Not worth it imo. Headache.", "We don't have any use case for it (with B2B). As a user, I've only seen it with CBC and it was buggy and I couldn't find a way to turn it off easily. I imagine it would frustrate most users.", "Yeah, I won't go into much detail as to not dox myself hah, but my current company has an actually good use case for this, and has implemented it already on iOS with app clips.\n\nThanks for the comment!", "I think it's full of use cases.\n\nJust some i can think of at the top of my mind:\n\n- ordering at a restaurant by scanning a qrcode on the table and ordering directly from the instant app which also know the table you are in\n- getting schedule information at a train or bus station in realtime\n- booking a meeting room\n- pay X (vending machine, gas station, whatever)\n\nGoogle just didn't properly pushed on it, users don't know the feature exists. If they knew they'd use it. And it's way too poorly documented / kinda hard to implement.\n\nThere's a use case that is proof this idea works. China WeChat basically is a platform to build instant apps and it is used everywhere in china.", "Fair enough! I can see how they'd be too much work for not a lot of payoff for most end-user apps indeed.", "Aw man now I'm curious. Can you give vague details of the use case? I always thought the reason instant apps didn't get super popular was cause they filled an unneeded niche.", "An exemple that works well (and the only instant app I've seen in the wild lol) is Vimeo.  Exoplayer works much better than any web player and the transition is seamless and as fast as it would take the website to launch.  No one wants to bother with downloading an app for a video platform they only use occasionally, and it's the perfect solution.\n\nBlows my mind that the rare times I take the bus, I have to download then delete a 80mo app.", "I just think that for the cases when the user needs to do something fast, without installing an app, a regular PWA/website is a much simpler solution, both for developers and users.\n\nIt really has to be a \\_very\\_ specific problem that PWA can't handle.\n\nAlso on Android the app size isn't usually a problem, unlike on iOS", "Has to do with demoing server driven UI in a quicker way.", "that has lot of limitation and a lesser user experience.\n\nFor example if you want to connect to a specific WiFi to put on the order for the kitchen it's way harder to do with a web app"]}, {"title": "12 Best $50 Loan Instant Apps", "comments": []}, {"title": "Best $100 Loan Instant Apps", "comments": []}, {"title": "Instant Apps", "comments": ["I've been seeing the same thing in both Bluestacks 4 & 5 (I have both installed) Instant Apps wants to be updated daily for the past month or so.", "Hi! Can you please provide a screenshot so that they may help in understanding your issue?\r  \n\r  \nAny additional information that can guide us to reproduce the issue would also be appreciated. These details can be when it happens for you exactly or what actions you take that may lead to the issue occurring.", "Well, I restarted Bluestacks to show you the image, and now it downloaded, but it was stuck endlessly earlier, and it's the 2nd time in 3 weeks.  \nhttps://imgur.com/a/1I39Uwq", "Can you please try clearing your cache and data to see if that resolves the issue? You can do that from My Games > System Apps > Android Settings > Apps > Google Play Store/ Play Services > Storage > Clear Data", "Thank you for the quick response.  Trying that now.", "You're quite welcome. Please keep us updated if this resolved the issue for you.", "It's hard to say for sure, since it was happening intermittently.    \nI'm still seeing Instant Apps constantly wanting to be updated.  It updated early this morning, and again this afternoon, but at least the update is completing without issue, so maybe it is solved?", "Oh okay, can you try uninstalling the app and see if that helps? \n\nYou can let us know if the issue persists or if you have any further inquiries.", "There is no option to uninstall it, though I was able to uninstall all updates to it.  I see in the Play Store it hasn't been updated in quite some time, so it definitely shouldn't be constantly updating.  Someone else complained of the same problem, so it may not have anything to do with BlueStacks.", "u/stuartpierce u/NoMither You can refer to this [article](https://support.google.com/googleplay/answer/7240211?hl=en) to turn Google Play Instant off. \n\nPlease let us know if you have any further queries or concerns.", "The article says you can turn it off Instant Apps with Tap Settings and then General and then Google Play Instant, but I don't see that setting in BlueStacks.  It's back to wanting to update constantly and failing.  \nNo such problem with my phone.  \nThis is a fairly recent issue.  Have been using BlueStacks for years, and this is only in the last few weeks."]}, {"title": "Can't disable Opening Links / Instant apps", "comments": []}, {"title": "Instant Apps keep being disabled | Samsung Galaxy S21", "comments": []}, {"title": "Instant Apps", "comments": []}, {"title": "Instant Apps", "comments": []}, {"title": "Instant Apps", "comments": []}, {"title": "New instant app who doesn’t have twig?", "comments": ["What's the referal code, I'm at the page where it wants me to enter it", "[deleted]", "is it canadian?", "It should pop up automatically what page are you on?", "Jshaw26", "Thanks just let me know! Someone told me you get $2 as well the app has been sorda slow with updating the balance on the Home Screen today so once you get all signed up let me know", "I’m not sure but worth a shot to try", "Done! the j has to be capitalized or it says it doesn't match, might want to post that. Let me know if there is anything I have to do to get the referal bonus", "whats it called?", "I got $2! Okay so go to where it says payments and click pay and see if you have anything there since the Home Screen is lagging that’s the only way I’ve found to find my balance", "I was just told once your referral cashes out for the first time you get an extra $3 so I guess $5 in total per referral I haven’t had anyone do that yet so if you are able to cash out let me know so I can check and see if I got $3", "Twig my link and code is above", "It's still verifying my identity, nothing showing up yet"]}, {"title": "New instant app who doesn’t have twig? Comes with a virtual card you can use on cashapp", "comments": ["Can you share link in comments? Ill test with you as well.", "I dont have it, what's the sign up bonus?", "I would also recommend editing and marking out account number", "I’m still testing it out sadly I’ve just had people signup and not tell me anything so I’m not sure honestly", "Can u tell me this app, I can test with you.", "Yes it’s called twig my link is above and so is the code Jshaw26 with a capital J", "Just signed up under you, have you received your bonus?"]}, {"title": "Do published web apps (maps published using the 'instant app' feature) stay online after my free student trial ends, or does it get deleted?", "comments": ["Saw this question this morning and thought someone with more knowledge on it might jump on before me buuut....\n\nUnfortunately I do not believe so. If possible, download them OR purchase a Personal Use license and use Assistant to transfer the data, maps and apps before they disapparate\n\nEsri understandably wouldn't want to host content for freebies", "Ditto.  I don't know about that student free trial or what happens at the end, but let's say worst case it gets locked, or maybe vanishes in a poof of mapping glory, I agree with u/my-gis-alt that if you get yourself a new personal use account would work, then use the [ArcOnline assistant tool](https://assistant.esri-ps.com) to transfer all of your content from your student account to this new one.  That license does cost $100 a year though, but you do get a license of ArcPro.\n\nAnother idea is to get yourself a free developer account ([developers.arcgis.com](https://developers.arcgis.com)), and then use the Assistant web app tool to transfer your content into there.  It's free, but doesn't include Arcpro, just Arconline.", "I believe esri leaves the data up for a period of time - few months maybe. Then it’s purged.", "points for that username!", "Happy cake day"]}]