[{"title": "Has anyone ever used App clips?", "comments": ["It’s becoming more common at restaurants and bars now (in mid to large cities) to have Toast or a similar system that prints a QR code on your receipt. You scan, pulls up the app clip for Toast (or other) and you Apple Pay your bill and leave. I’m seeing it used more and more frequently especially over the past year.", "If you ever go to the Champs Elysées, enter the Lacoste Arena shop, and tap the NFC tag of a pair of shoes on display, you’ll be able to use an App Clip to get your size delivered to you for an express tryout.\n\n(I was commissioned by Lacoste to develop this. Very tricky to stay in the 10Mb limit.)", "A lot of the gas stations around me have app clips. You tap the clip, select the pump’s number, and use Apple Pay. It’s honestly really convenient and I use it almost every time. I kinda think App clips will be like Apple Pay, a slow roll out at first but over time they’ll become more prevalent.", "I use them all the time for shazam \n\nI put the shazam “recognize music” toggle in my control center and when I click on the result, it comes up in an app clip. \n\npretty neat. no need to have the app installed", "Tiktok uses them when someone sends you a video and you don’t have the app.", "Here’s an app clip demo of a game: https://firigames.com/phoenix2", "For a non-US response, they were used in Victoria during COVID when check-ins using the Service Victoria app were mandatory. It's been a while, but if I'm remembering right if you were from overseas or interstate (or didn't have the app installed), the QR code would download an app clip for Service Victoria and you'd check in with that. I only used it once at the Melbourne airport, but I thought it was probably the best use-case for app clips and I'm actually sort of surprised that the other states didn't do the same thing.", "The only time I remember they exist is when these questions are posted to r/Apple", "I used it to pay for parking in San Diego. Was cool, the app was then listed in my library as an “App Clip” with the option to download the full app for more changes.", "I used one at a restaurant in Czechia that let me order and pay from the app.", "I dont have TikTok installed on my phone, any time someone sends me one via iMessage i view it via an app clip\n\nIt’s pretty good\n\nIt strikes me that App Clips will make a lot more sense in an AR future", "Used an App Clip to pay for parking. It was so easy!", "I was able to use it for an e-scooter rental once. But then I saw that it left an icon in my recently downloaded folder (and therefore presumably was sitting on my phone permanently?). That goes against my idea of the purpose of app clips. Haven’t really had a chance to use again anyway, but I’d probably avoid generally.", "I have used them for parking and paying at a restaurant. Just today I went to a restaurant where they give you a bill with a QR code on it that opens up an App Clip to Toast that allowed me to pay via Apple Pay and close the tab.\n\nHonestly though I’m not sure if this couldn’t be done on a web page. There is another restaurant that I go to that also integrates with Toast but they just open up a web page there and it works just as fine.\n\nIncidentally I have been thinking of building an app clip app for a nonprofit / living museum / wooden boat place. It would be useful because the visitor probably doesn’t want to go install an app, and the app clip would allow you to scan / take a picture of an object and it would tell you what it is, something that a web page cannot do.", "i only used app clips once. when you share a parcel tracking link from the parcel app, say via iMessage, then when the other person clicks on the link it opens the tracking info in a parcel app clip. pretty neat, actually.", "First time, I got a burger and a beer at a bar, and when the check came, it had a QR code on it. I scanned it and an app clip came up that let me pay the bill via Apple Pay. Very cool.", "They are used in Australia’s main Covid location tracing app and has been a huge success.", "Completely forgot it was a thing until this post", "I’ve used them at a bunch of restaurants since the start of COVID, a QR on the bill would pop it up so you could pay and leave. Also, every time friends send me TikToks in iMessage I can open them as an AppClip instead of installing TikTok.", "I did", "I have used it to pay for parking before. Scan a QR code which opens an App Clip to pay for parking. Pretty nifty honestly.", "Only once on a British parking machine!", "Yes, but literally one app has it that I use. There is an app in Czech Republic for paying in restaurants with just a QR code (really cool, no need to call the waited and wait for the bill), and that app has an App Clip", "The only app clip I've ever used was one for public parking at Niagara on the Lake. It was fine.", "Yeah the parking in the next town over from me uses it.", "I really like the idea and concept of app clips however I just don’t use them.", "yes, maybe twice. i forgot why i stopped using it the first time so used it again to remember. i don’t want to use it a third time to remember, and uninstalled it.", "I end up using it all the time at restaurants that give you a QR code for your bill. Scan, Clip opens, Apple Pay...done.", "A bunch of restaurants near me use app clips to pay your bill.", "As a developer I was really excited about this when they announced it but just doesn’t feel like it’s taken off enough to warrant development.\n\nThere were also some limitations which I wanted for my app, e.g. to be able to send a file along with the app clip so the receiver could use the file. I guess you could do that with a server but it would be too much effort for very little reward.", "App clips certainly didn’t work out, like they wished. Kinda unrelated but, what about the app clips? Does someone ever use it? Might be a cursed naming lol", "I used once for Shazam", "Dunkin Donuts.", "I hired an e-scooter using one in Berlin last month. I refuse to download any single-use app so it was appreciated. Incidentally, does anyone know if a record of previously used App Clips is stored on your account?", "I've used it once or twice to pay for parking or pay for my meal at a restaurant, but it hasn't quite caught on in the Rocky Mountain Front Range where I live.", "Use one to pay for food at a restaurant once and the waitress chased us down the street because she thought we dine-n-dashed", "I bought the Backbone game controller and it uses an App Clip for the initial setup", "Tried the App Clip version of Shazam recently on my iPad. Pretty good for what it does, although I don’t know if that syncs with my iPhone and the latest version of Shazam.", "Yes", "I used App Clip on a self-serviced power bank rental here in Hong Kong.", "First and only time I’ve used an app clip was Toast at a bar. It was the fastest, easiest way I’ve ever paid in public. Would love to see that at every restaurant.", ">  You scan, pulls up the app clip for Toast (or other) and you Apple Pay your bill and leave. \n\nI'm trying to figure out if this better than just paying with your phone by tapping the payment device?", "15Mb now on iOS 16. I was commissioned to look at this, but as the requirement involved using a third party library with a size of 20+Mb the project didn't get off the ground.", "This is amazing way of using this ! Wish more companies would do that!", "OMG i didn’t know we had them here in France.", "This is awesome. Other than the size limit, what’s it like developing an app clip vs a regular iOS app?", ">\tI kinda think App clips will be like Apple Pay, a slow roll out at first but over time they’ll become more prevalent.\n\nApp Clips require a lot more work from the merchant/service provider, so I doubt it. \n\nIf you want to accept contactless as a seller, all you have to do is update your terminal (unsure of the terminology) or get a model that supports it. App Clips require dev hours, if you even have an app in the first place.\n\nI really doubt it will ever be as common as contactless payments.", ">\tI kinda think App clips will be like Apple Pay, a slow roll out at first but over time they’ll become more prevalent.\n\nI believe App Clips will increasingly be used by Apple Search to serve apps to users, totally circumventing the App Store. \n\nThe process of going to the App Store, browsing the catalogue and waiting for it to install will seem rather archaic in comparison to Search + App Clips.", "I could never get the Mobil app clips to interact at all- I finally gave up and just downloaded the app.", "I don’t drive often but could see this being very useful.", "Where are you located?", "Dude, I had no idea you could add a Shazam button to Control Center. Thank you!", "Best implementation of it imo - perfectly suits the needs of the software.", "Yeah I second this usage", "Isn’t it quicker to ask Siri what song is playing? Doesn’t she use Shazam too?", "Yep, been loving this feature for awhile!", "Tbf that one’s built in natively so it almost doesn’t count", "Not an app clip, but great nonetheless!", "I just get booted to safari for TikToks people send me", "Interesting. I wish Reddit did this too. Sometimes I send Reddit stuff to my wife who doesn’t use it. Probably a good way to get people interested in using the app.", "Are you in the US? I just tried this and it said it’s “not available in your country or region” (I’m in US)", "It’s really random though, like it only does it for certain contacts for me. Really weird", "[deleted]", "Amazing, I just played it through, no need to install. Perfect.", "That’s a perfect implementation of an app Clío, congratulations for the game and the clip itself!!\n\nOne question on the clip, what limitations you had in terms of size and similar?", "This game is actually fun", "Huh why don’t I see it anywhere\n\nhttps://i.imgur.com/vhstNM3.jpg\n\nSafari. Not InPrivate. iOS 16 iPhone 13 Pro max.", "It was really slick and worked so well. I was so annoyed visiting every other state and needing to download their apps.", "same, mission beach public parking", "I was about to say. I remember seeing an app clip when I paid for parking in Downtown SD!", "They are removed automatically after 30 days.", "How?", "Why not just do standard wireless pay?", "[deleted]", "I don’t know if it’s 15Mb for iOS 16+ but still 10Mb for iOS 15-, or 15Mb for everyone since 16 came out.\n\nAs the requirement is enforced by App Store Connect at verification time, I would think it’s the former, but if you have a definitive stance on this I’d take it.\n\n(And yeah libraries are huge. As always.)", "It’s tricky, as size limits aren’t the only restriction.\n\nFirst you have to have an associated domain and a correct plan for all your universal links. You have to make sure the main app also handles them correctly.\n\nThen you have to work out all the invocations (nfc, qr). I found out that printing some QRs and laminating the sheet with corresponding NFC tags along helped immensely.\n\nThen my app clip can be updated/woken up by push notifications. And the main app has the same functionality. So for testing, having two devices side by side helps very much : one with the app clip, one with the main app.\n\nPlanning, planning, planning and rigorous planning are the key. Oh and did I mention planning too?", "Oh yeah I don’t think it will be as big as Apple Pay, but I do think it will become more prevalent then it is now", "I’m in Australia and I would love to see this come down under. We don’t even have pay-at-the-pump for some reason— I’ve only seen it once. It seems like this method (even without App Clips) would require less investment upfront from the stations.\n\nIt’s funny; we have had contactless payment for a long time so Apple/Google payments were a simple software change for the most part. PatP has never taken off, though. Anyone with young children knows what a hassle it is to always need to go into the station, and I would be so thrilled to catch up to the US in this regard.", "Requires Dev hours but very few. Very easy to launch. We were able to get it out in a couple days with one dev.", "I think you’re right. I got served an ad for McD when I was parked in the same parking lot recently.", "Same!!!", "I think our gas stations use Exxon Mobil", "no, the control center button is just one swipe away, and you can still continue to use your phone while it is listening to the music. siri does use shazam, but i‘d only use that over the control center button when i don’t have my phone in my hands anyway.", "Nah, it’s quicker via Control Center", "I just use Siri because I don’t want waste space on my control centre", "it is an app clip though?\n\nhttps://i.imgur.com/dlEv1bf.jpg", "Same, I wonder what we’re doing wrong", "You actually have to tap the Open button, if you tap anywhere outside of that it opens as a link in Safari.", "Ah I’m in the same situation, I wish they could do that.", "A Reddit app clip would be awesome, and way better than the site", ">Under 10mb too\n\nYes that’s the point of app clips…", "I already found it and sharing in case someone curious, 10mb up to iOS15 and 15mb for iOS 16", "[deleted]", "7 days", "Go to their site, it will prompt you to download the app clip when you start an order.", "What do you mean, like Apple Pay? If the server had a portable cc device that I could tap, that would have been faster, but, toast is just a QR code on my bill. Server drops it off, and it was paid in like 10 seconds. Then I just walked out with no need to bother a busy server.", "Ah, that makes sense. Sounds well nifty, hope I can try it out soon-ish.\n\nCheers for the explanation!", "And then there are the edge cases: you ask for shoes in the App Clip, then while you wait for them, you decide to install the main app from the App Store; so when you launch it it has to pick up right where you left your order.", "Oh yeah, that might be true. It seems like they’re a lot more popular in the US than in Europe, as I’ve never seen one in the wild (only on websites/apps, even then it’s only international ones). \n\nOn the other hand, some European merchants already had contactless payment systems up and running really early on. I’d say that 90% of the terminals you’d see in an urban area in 2018 did accept tap to pay. I wonder why it’s so different with App Clips. \n\nObviously they don’t serve the same purpose so it’s not really a good comparison, but still.", "Yeah, tell that to the 50 year old woman that runs a family restaurant or the small business owner that can barely afford a website. I’m sure it’s real easy for them", "It’s also useful if you want to know what song is playing but don’t want everyone around you to hear you.", "Apple owns Shazam", "Oh I guess it is an app clip if Shazam isn’t installed", "Where did you find that in your settings? I can’t seem to find the app clip anywhere in my storage or even through a search in settings. I just see my documents & data for my now-uninstalled Shazam app.", "You have to click open or the app icon", "It depends on what the sender clicks on the Tik Tok share sheet. If they click on the messages icon it does one thing, if they click “share via… messages” it does another thing. I don’t have Tik Tok so I can’t remember which is which.", "Not trying to be awkward but looking at a link in messages and there isn’t an open button. \n\nhttps://i.imgur.com/LVUHWRr.jpg", "I’ve got adblockers Blocked it. Turned it off and refresh and it pops up.", "Settings app says 30. https://i.imgur.com/7upaLUA.jpg", "Very interesting. So do you HAVE to have an full app alongside the App Clip? In other words, I can’t just develop a standalone app clip?", "Why would a restaurant or small business have an app?\n\nMany restaurants around me already use app clips, it’s the one use case I do see and love. It’s because they use toast to run their POS systems, and toast provides it to them. It’s amazing. Makes checkout so easy.\n\nNo small restaurant has their own app, they use third party providers", "Correct. At least anecdotally, Siri has not been as accurate at recognizing songs for me as simply using the Shazam button in CC or opening the Shazam app for me, for whatever reason.", "Yes it is if you don’t have it installed, great for the occasional time you want to Shazam something but don’t need the full app", "settings -> general -> iPhone storage\n\nthen i searched “shazam”\n\nI believe app clips automatically delete once you don’t use them in X amount of days. (I believe 30 or so days?)", "I use that, my wife sends me TikToks and I open them through the clip. No need to install bloatware that will leave me staring at the phone for hours.", "Thanks for the tip, so annoying when apps do this", "Huh, weird. Is the other person on Android? (Or if it’s a group chat, is anyone in it on Android?) AFAIK it only works for iMessages.", "Oh! You are right", "AFAIK App Clip is like a \"preview\" app for a main one, so yea you need to have a full app then build App Clip around it.", "Shazam I feel has gotten worse in recent years, like not enough songs are logged? I often have to open the Google app and ask it to ID the song", "Huh. How weird. I tried searching for it exactly as you said and it only shows data for the offloaded app. And yet I’m still able to use the control center function for Shazam just fine. I’m super stumped what’s happening now", "And you're saying that while on reddit? Lol", "Nope. iMessage to iMessage", "TikTok is extremely inconsistent on iMessage.\n\nHere are three types of links for some reason\n\nhttps://i.imgur.com/DqY8Q6c.jpg", "It’s an appex (App Extension) so yeah it needs a mother app. Once you download and install the mother app, the App Clip won’t ever launch again.\n\nApp Store Connect \"extracts\" the App Clip and serves it when the user opens an URL linked to your App Clip (the association is declared in ASC). When you install the full app, it doesn’t come with the App Clip embedded.\n\nFunctionally wise, it should be a subset of the main app, but technically it can be a totally independant product (though I doubt Apple will validate this)", "try holding on the shazam toggle in control center and click on a recently shazamed song. that should open up the shazam app clip\n\nnow see if it pops up in iphone storage.", "Reddit is easier to control. On Apollo for Reddit I can set it to separate browsing by pages, I can limit myself to 2 or 3 pages per browsing and it’s easier to stop. \n\nTikTok and scroll down-like apps are tough to quit. You just scroll down and can keep scrolling until you run your finger to the bone. It’s a personal choice for everyone of course, and no judging. I like seeing videos my wife sends me once in a while. She knows when to stop too (most of the time).", "[deleted]", "Yep, that did it! Apparently that’s my first time ever actually clicking on a result from the list. I thought the app clip was just the Shazam button itself identifying the song.", "I think they are talking about the Open in Safari button, which is NOT an App Clip"]}, {"title": "Has anyone actually seen app clips out in the wild?", "comments": ["No they’re widely ignored here in California at least. The only App Clips I’ve ever used came from links in iMessage (TikToks etc), not QR codes out in the world as originally intended. Seems like restaurants, parking meters, electric car chargers etc just don’t want to do it. Maybe too expensive to maintain compared to just doing things the normal way especially since they aren’t compatible with android.", "I don’t have TikTok installed but a couple friends do. If they share videos to me via iMessage I can open it in an app clip.\n\nI have also ran into it once or twice at restaurants using Toast or Tock to or order and pay a tab from a QR code.", "Paid my bill after eating at a restaurant using app clips printed on the receipt. Clever idea, no waiting around for leave receipt-give card-take card-return card ritual. Just pay and go. Nice.", "I used one to pay for parking a couple months ago. I really liked it because it loaded up, I paid in just a few seconds, and never thought about it again.", "The only time I’ve seen them is on Mobil gas pumps in Western New York to pay at the pump.", "I’ve used them to rent a Bird scooter. I’m in the US though.", "I bet they end up fueling AR goggle experiences so users don’t have to download apps from a store while walking around.", "Here in new rochelle New York i use them all the time. Parking, food, groceries", "To my surprise, the Victorian state government (here in Australia) actually implemented app clips very effectively for our COVID tracking location check-in app. Scan QR, open app clip, check in. Super efficient.", "I’m in Canada, and I used an App Clip for the first time when I paid for parking just this April using Honk. I used one for the second time when my mom of all people shared a restaurant reservation with me via OpenTable. I actually really enjoyed the experiences and I wish more apps could do this for those apps you don’t really want installed all the time like a random parking app or dinner reservation app.", "I just recently saw one to pay a check from a QR code with Toast. Besides that I have never seen one", "Never seen one here in the Netherlands.", "What are app clips", "Some restaurants I’ve been at use them to pay bills.", "twice, to pay for parking and at a gas station", "Yes.\n\nThe Neuron Scooters here in Darwin utilise them for payment.\n\nDon’t have the app, have used the scooters a few times over the last year.", "Any restaurant using the Toast POS system does app clips… I just scan the code in my receipt, use Apple Pay, and walk out. It’s awesome.", "App clips don’t make sense to implement. While it’s a cool idea it took so many years just to get people to understand QR codes. When adding app clips into the mix it just makes something that is supposed to be easy more complicated.\n\nI can see why no company has chose to implement them (the physical stickers you scan/tap). You basically need 3 different QR codes on your marketing material. One for iOS, Android and to your website because no all phone support App clips/Android Instant apps.\n\nMakes no sense when a single QR code can take you to the website and you can do everything there like making a mobile order or paying for your bill.", "Subscribed", "Searched for a local restaurant in Apple Maps. Found it and saw an “Order” button which brought up that restaurant’s page in Yelp. I ended up not ordering cause it was right around the corner and I could drive their faster than using Yelp. But I noticed afterward that there was an app icon in my App Library with the name of the restaurant and the Yelp logo. Tapping it take me directly to that restaurant’s page in Yelp. First and only time I’ve seen an App Clip since the feature was announced.", "Dunkin’ app clip shows in Siri suggestions when near one.", "A couple of pubs in the UK use them for at table ordering, I think the main app is called OrderPay", "I haven’t seen one in the wild but McMaster Carr’s app clip is exceptional as one might expect. Their website design is second to none as is.", "I actually saw one at a car park in the UK a few months back. Was very surprised as it was just like, a council ran car park", "I’ve used them twice, once for parking and once for a restaurant. Both in the US, the parking may have been in a bigger city (can’t remember) but the restaurant was just in a suburban area. I wish they were more common because it was so easy!", "-Mobil gas station QR code\n\n-Location based app clip at Panera\n\n-Receipt QR code for resteraunt", "I saw one at a restaurant to pay. It was cool, but it didn’t work. \n\nHaven’t seen one anywhere else", "Shazam from Control Center, if you want to do anything with the song you ID’d it downloads the Shazam App Clip", "I had one pop up once for a museum I was visiting in New York", "Toast does it in restaurants to order and pay. Works great.", "Yeah, A lot of restaurants here support the Yelp one for ordering takeout, and I see them at Exxon stations (which I usually try to use because of rewards discounts)", "Grocery carts in sams club have a QR code for their scan and go app clip", "I saw one at a gas station the other day here in california.", "Seen here in Gothenburg, Sweden. On the tram. It was quite useful but I was surprised when it popped up. Was a tram schedule when waiting for the next one.", "Our state’s Covid check-in service was handled through App Clips, and it honesty worked a treat", "Literally never", "I’ve seen and used several at “Mobil” gas stations to pay.", "I've used app clips in Salt Lake City to rent a little electric scooter... And in california to pay for parking meters... I'd say they're working as intended but not widely used yet.", "I’ve seen them pop up a ton in the Bay Area, especially for restaurants.", "I’ve seen app clips come up for a few restaurants. Couldn’t name em, and I also already had the full app installed so I didn’t use it. \n\nThey came up in spotlight when I was standing in the restaurant.\n\nThis is in Minnesota", "I used it to pay for parking", "OpenTable uses them. Someone just sent me an invitation to a reservation. I forget what I tapped, but an app clip came up. On the top it had a banner reading “View the full experience, get the app”).", "App clip involves making a somewhat native app. Services like parking and restaurants prefer to use web based solutions.", "The tiktok app clip didn’t seem to work right for me. It wouldn’t render around the notch and the UI felt broken - was that fixed?", "Really? When I went to SF I got tons of notifications for app clips near me. \n\nHere in Toronto they just don’t exist at all.", "This is a great use of clips", "It’s kind of insane that in the US you give you card to someone to take. That’s outdated and scary. Your card never leaves your possession in Canada. Actually my cards never even leave my wallet because everything supports wireless payments here.", "Sounds really good", "This is the only circumstance that I’ve encountered it in as well.", "Yes, I used an app clip to pay for parking in another province last year. First time I saw one in the wild.", "That’s the exact use case I was looking forward to using, but like OP I’ve never seen it anywhere in the UK yet.", "Same, only place I’ve seen them", "wow that's really interesting. i guess they rolled out in big us cities first and are very slowly moving elsewhere, but businesses are really slow to adopt", "Yeah, a few days ago my dad was trying to pay for parking and it sucked. I think he literally had to download an entire app on data. the whole thing took like 10 minutes", "Small, bare bones version of the app.", "Look at the WWDC 2020 event", "yeah that's what I was thinking in terms of adoption", "If I could make a web based app clip I def would.\n\nBut on a negative note, if it was that easy, it would encourage spam in public places.", "Seems to work for me (12 mini)", "Maybe they have them in the city but in the suburbs nope.", "I think US is the only country that does that", "Crazy blanket statement. Was at a bar in Canada, took my card. Was at a bar in America, didn’t take my card. \n\nThus, it’s kind of insane that in Canada you give you card to someone to take. That’s outdated and scary. Your card never leaves your possession in America. Actually my cards never even leave my wallet because everything supports wireless payments here.", "interesting- literally none of that over here lol", "A app clip still needs a AppStore approved app as a “root”. I think that makes the bar quite high spam-wise. There’s easier way to spam frankly.", "Just tested again in a long time - they didn’t have audio and the videos were indeed cut off, this time on the sides though 🤔 11 Pro Max here.", "Only time I’ve had a bar in Canada take my card was for a “tab”.", "God, I’d love that in the UK. It’d be a damn sight better than having multiple parking apps installed, most of which I’ll only ever use once."]}, {"title": "[Android App] Clips are sped up, audio plays at 100% speed.", "comments": ["What a weird glitch. Have you tried uninstalling Twitch > reboot phone > reinstall Twitch?\n\nAlso make sure that your phone is updated.", "I have the same issue. Been going on for quite some time and really annoying. Work around used to work by simply closing the open video and reopening but that stopped working about 2 months ago.\n\nHowever I did find another workaround in a specific situation: If you're like me and opening Twitch clips from inside a Reddit and they auto open in the Twitch app then play sped up then you should try to use the \"Open in Browser\" option instead. \n\nIt should still make Twitch app open straight away after the browser hands off the link (you don't even see the browser at all) due to URL association with the Twitch app. But it does prevent the speed up. No further clue why, seems to be something to do with the link handling. I played around with a lot of workflows related to opening the clips and found this was the only way that prevented the sped up playback.\n\nHave Googled and stumbled upon bugs and feedback threads dtaing back to 2017 for sped up playback issues on Android. Seems like we're stuck with it 🤷🏻‍♂️", "Same issue here, have been having it for months :( the only way I now deal with it is my opening up actual stream/vod (if available). Really sucks :/", "After reinstalling, I thought it was fixed but at the third clip, the issue came back.", "I just downloaded a third party app and uninstalled the official twitch app to somehow avoid this issue. The downside is the clips now open in my browser first then I'd have to select open in app to load it to the new app. But I'd take that over spoiling the highlight clips.", "Fair. Which app you using?", "TwitchMod"]}, {"title": "When searching on Amazon mobile app, clips of seller’s video playing instead of main image", "comments": ["**To all participants** \n\nCAUTION: ecommerce forums are constantly targeted by spammers and scammers. Common ruses include the pick-your-pocket-while-being-super-helpful guru type scammer, use of multiple accounts to decieve, and the \"my friend can help\" switcharoo. Do not respond to DM / PM / message requests, even if it seems helpful or free. Do not click links to sites people offer for their own services, apps, videos, etc. especially document, download, and unclear links. Report any scam attempts in private messages.\n\n**To those here to lead generate / promote** \n\n(often VAs, consultants, app devs, freight forwarders, and others whose target market are the participants of this sub). Attempts to use the sub to drive traffic to something of yours, or otherwise promote, hype, or lead generate anywhere outside the Community Promotion Post will result in an irrevocable ban. ***Do not use this post to promote, hype yourself, offer services, or ask anyone here to PM / DM / contact you***\n\n---\n\n*FAQ topic posts - [Beginner help](https://www.reddit.com/r/AmazonSeller/search?q=title%3A%28beginner+OR+newcomer+OR+noob%29&restrict_sr=on&sort=new&t=all) / [Arbitrage or Walmart](https://www.reddit.com/r/AmazonSeller/search?q=title%3A%28arbitrage+OR+walmart%29&restrict_sr=on&sort=new&t=all) / [Suspended account](https://www.reddit.com/r/AmazonSeller/search/?q=title%3A%22suspended%22&sort=new&restrict_sr=on&t=all) / [Fees](https://www.reddit.com/r/AmazonSeller/search/?q=title%3A%22fees%22&sort=new&restrict_sr=on&t=all)  / [Product codes](https://www.reddit.com/r/AmazonSeller/search?q=title%3A%28codes+OR+barcodes+OR+UPC+OR+EAN+OR+ISBM+OR+ASIN+OR+FNSKU%29&restrict_sr=on&sort=new&t=all) / [Brand concerns](https://www.reddit.com/r/AmazonSeller/search/?q=title%3A%22brand%22&sort=new&restrict_sr=on&t=all) / [Freight](https://www.reddit.com/r/AmazonSeller/search?q=title%3A%22freight%22&restrict_sr=on&sort=new&t=all) / [Guides, courses, and tutorials](https://www.reddit.com/r/AmazonSeller/search?q=title%3A%28course+OR+tutorial+OR+guide%29&restrict_sr=on&sort=new&t=all)*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmazonSeller) if you have any questions or concerns.*", "It might possible your video format is not mobile friendly that's why it is not showing in mobile version when you scroll down", " I've seen this a few times over the last few months. Amazon has been harping a lot about videos - both for seo and page use. I think they are beta testing showing the video in search results in small samples."]}, {"title": "App Clips when", "comments": ["App Clips are extremely underrated. I scan a QR code at the bottom of the receipt, it downloads it seamlessly, I pay, and I never think about it again."]}, {"title": "Advert in stack. How to remove permanently? (Turned off all app clips and still there)", "comments": ["Did you long press on the widget and under “edit stack” uncheck the “suggested widget” ?", "SOLUTION ABOVE\nI did not - thanks", "You can also just disable this particular widget from being suggested without disabling suggestions altogether, in case you prefer to keep them enabled."]}, {"title": "Has anyone actually used App Clips?", "comments": ["[deleted]", "This one gas station near me has little NFC targets on their pumps that open an app clip so you can pay with your phone.", "I have a couple for some restaurants that I ordered from but that’s basically it.", "Shazam when I use the baked-in music recognition", "I sent a parcel to my sister which I tracked with the Parcel app. When I shared it with her in iMessage it was sent as an App Clip. Worked flawlessly", "when people send tiktoks, sometimes it’ll do an app clip instead of opening in safari", "I paid for parking when I went skiing a couple weeks ago on an app clip. I just pointed the camera at the QR code, the app came up and I used Apple Pay. It was pretty seamless. Unfortunately parking was $20 so it wasn’t painless.", "I have, and I’m in England too. Small town (population 30k). \n\nA new place is opening up down the road, too early to tell what it is yet. A week or two back I saw a QR code type thing in the window, scanned it, and unexpectedly got an app clip of their menu.\n\nIt was in the app switcher like a normal app, but no home screen icon for it. I don’t know how (or if) I can open it again other than scrolling back through app switcher. Kinda lost interest once I realised it was a menu for a place that wasn’t going to be open for at least a few weeks.", "You sound like me. I asked a few weeks ago too, because it was the feature I really wanted to take off(and I’m not sure why). I’ve used clips a couple times but never anything meaningful like payments etc. \n\nI used it to order Panera when I was in Georgia a couple years ago but even then, the clip didn’t show the whole menu and that was one of the first apps to support it. \n\nI want it to take off eventually.", "I used it for a Byrd scooter ride. But that’s the only time.", "I went to a restaurant/bar with outdoor seating. Each table had an App Clip on it. I scanned it and was able to order and pay for my food right there without downloading anything else. It was pretty slick.", "I think the pandemic could be one of many factors why App Clips hasn't grown much.", "Have used it at a few parking lots with QR code options at pay stations. Scan, app clip opens, allows you to select time, enter car information, pay with apple pay.. super quick and simple.", "I paid for parking with an app clip once", "Exxon mobile gas. I used it a couple times but it was so slow to activate. So I downloaded the Exxon app. I can thank app clips for showing me the app tho. I’ve actually earned quite a bit in rewards Exxon and using Apple Pay.", "Yes!!! It’s great. Got an app clip while eating sushi. :))) hope app clips and google web apps (if they work similar on android. I think that’s the name of it?) get widely adopted.", "whats appclips? is it like the instant apps on android?", "In Victoria, Australia the entire QR Code Check-In infrastructure essentially runs through a scannable appclip", "I personally don't but many people here do to easily pay for gas, restaurant bills, etc.", "Nope, I've never seen or used one before.", "I actually just paid for parking with one. I think it’s the first time I’ve used one since they were announced", "unpopular opinion but sometimes i just don't get what's the point of App Clips when the same function can literally be replicated by a PWA(Progressive Web App)", "I used them for about 8 months for my state's QR check in system before deciding I should probably actually download it lol.", "Yea. I think for some parking app, I forget which city.", "I’ve always seen this as a pretty useless/niche feature until 2 days ago. \n\nA friend of mine shared a TikTok video via iMessage and I was using my iPad. The thing is I don’t have the app installed so its App Clip just popped up when I opened the link. I was absolutely delighted and surprised of how fast and convenient that was. No Safari, no extra tab over there that you’ll have to close afterwards, no clunky  website.\n\nIt’s the kind of thing you definitely won’t be using on a regular basis (took me 18 months lol) but that is really nice to have.", "Only App Clip I’ve seen in the wild was for Mobil gas stations.\n\nTapped my phone on it to bring up the app clip but it was glitched or something… would not let me use Apple Pay to pay for gas. Would do the circle spinny thing and then just go back to the beginning as if nothing happened.\n\nEnded up just downloading the full app and paying there. Other than that, I haven’t seen any clips though I’m not impressed with my first and only impression.", "I tend to buy gas with them.", "I’ve used one for an app called UnrollMe to help tidy up my email. But that’s it.", "Exxon gas station had an app clip for Google Wallet, I believe. Worked nicely to activate the pump when I left home without my wallet on accident.", "Shazaming songs from the control center uses an app clip if you don’t have the app installed", "I think Etsy uses them quite a bit when sharing items. Seems like most apps don’t have much of a use case.", "Paid for gas at a Wawa with my phone at the pump…it used an app clip.  Using one of their specialty app clip QR codes. Pretty seamless and used Apple Pay.", "Lol I forgot this feature even exists. It looked really cool but I’ve never seen it in action. Granted, covid has made me go out much less so I have less opportunity to run into what seem like more common uses for it. But yeah, never once used it.", "I use it alot at restaurants with QR code menus so I dont have to download a whole app in a restaurant to see the menu!", "I almost used one for the first time today. [Motorway](https://motorway.co.uk/) offered an App Clip to help take photos. Does anyone know if they show in your Purchased list on the App Store? Or just under Settings?", "I’m a relatively recent iPhone user and actually am learning about this feature for the first time. Android has a similar feature and it too isn’t utilized much. Only thing I ever used it for was Vimeo before I just downloaded the app.", "Yes. Home Depot curbside pickup uses them", "Exxon7/eleven use them at the pump here", "Have paid for parking lots, gas at Mobil or Exxon, restaurant bills, TikTok links, and one of the scooter companies", "All the scooters in my area have started to use them and I love it. There’s like 6 different ones and I don’t need to keep any of their apps on my phone, just scan and ride", "App Clips are annoying because they stick around in your App Library and you have to manually remove them.", "A few QR menus in restaurants and also when you use the QR scanner from the Control Center.", "Yeah for Covid-19 contact tracing when I was vistiting a different state.", "Restaurant bill and TikTok (because I refuse to download the app but still want to watch videos people send me)", "I use the Shazam app clip from the control center when I want to see information on what I just Shazamed or past songs.", "Did not encounter or even heard anything about them available. \n\nI am from Ukraine and since launch was in Spain and Germany.", "Went to Macys the other day, and I used App Clips on my phone to get a price scanner. I thought it was pretty neat.", "All the time — to order food and pay at restaurants. Combined with Apple Pay, it makes the process super simple!!\n\nNow if they could do this to parking meters….", "only time i ever seen it was identifying a song. shazam.", "App clip? I use wallet, what is app clip?", "Once. At a gas pump. Worked great", "Enable the Siri Suggestions widget and check it at a restaurant chain.", "Any more places in UK use appclips?", "No.", "Shazam installed as an app clip when I ran it from Control Center. I wish it was more places", "There’s a parking lot company downtown that uses App Clips to take payments and whatnot without an attendant, pretty handy and quick. \n\nI also got suggestions for App Clips from Siri for things like a local ice cream shop, etc. I wish more would support it, it was super handy", "The Victorian government uses app clips for checking in to businesses for COVID contact tracing if you‘re from interstate and don’t have the Services Victoria app.", "I didn't even know they existed yet", "Went to a dockside restaurant in the everglades and the menu and the bill were app clips", "Shazam sort of has an app clip but it’s annoying", "Once. I was at a gas station. I already had the full app installed.", "Here in Dubai we can use them to pay for public parking. It’s made the process much easier because you don’t have to worry about putting change into a parking meter anymore.", "Paying bills at restaurants and Shazam music recognition.", "Go to [https://firigames.com/phoenix2](https://firigames.com/phoenix2) on your iPhone & you can play a demo using an App Clip", "Man I forgot App clips were a thing, not once have I used that since it’s reveal", "I don’t have TikTok downloaded on my phone. My my wife sends me TikToks all the time. It opens in an app clip. From messages.", "TikTok. I did not have the app, someone sent me something via iMessage, and an App Clip installed to watch it.", "Never noticed one anywhere yet...", "Nope, but I barely go out and do things so I just haven’t come across it yet.", "Ive seen it at my local city when parking at one of the spots where you have to pay either by coins or by sending an SMS with your cars plate to a certain number. \n\nNow they have app clips downloading the payment tool and supporting Apple Pay.", "i use them to pay for parking around where i live and that's about it lol", "I don’t even know what that is xD", "Me, pooping at home: WTF is AppClip?", "Apple Support tried to show me a clip. and it failed to load. App Clips are a fiasco, I guess.", "Is it in the App store? Can't find.", "I used it once for a museum lol", "I used it in Copenhague, inside a Flying Tiger store, where the virtual cart was available via App Clip by scanning the App Clip code, or simply a website for other shopper who scanned by QR Code. It was quite nice and simple !", "Only in an Apple Store", "Yes, only a couple times.  RFID/NFC at some gas pumps.", "I use it at mobil gas stations so I dont have to use my card", "I have never seen them used in person yet. (Ireland)", "Once for Shazam", "They’re on gas pumps now, used it a couple times", "Back before I downloaded tik tok, my friends would always send me stuff and it would come as an app clip. Super nice feature", "I’ve used it at some restaurants and to pay for gas", "I used it a few times at restaurants when visiting friends in LA, never here in Ohio though.", "In Australia, we use it for covid check-ins basically everywhere and every store we enter. Neat feature I guess, works fast and well.", "i may have. but i can’t recall anything", "Gas Stations have them in my area.\n\nPretty convenient", "Yea I have a couple times. Mostly for paying this bill or that. I got a location based app clip for a restaurant menu while I was close.", "I pay for my parking with app clips", "When you use the Shazam button in the Control Center it will open the App Clip when you press the notification. Also used it once for Dunkin Donuts.", "I've used it when parking out of state, it was very convenient that I didn't need to download an app that I'd likely never use again. Additionally, it had the option for me to utilize Apple Pay, which made it that much sweeter.", "Use them at the gas station where there’s no rfid device", "I need the Midwest to catch up!!! I hate watching my card get walked away to a dark place around the corner. I mean, I’m sure they don’t want my identity but if they take my last $20.00 I won’t get it back from the bank for a full week!!!", "I’ve only ever seen/used one at a gas station. They’re not really around here either, or else I e just not noticed them.", "i use it at my gas station. pretty convenient", "Just for tik tok because I refuse to put that Chinese Winnie the Pooh spyware shit on my phone", "Yeah, I see QR codes on gas pumps for pay with your phone that download a clip. I don’t use them though I just use Apple Pay.", "There’s a restaurant I like that uses it to pay and I’ve had good experiences using it", "I have seen App Clip QR codes at Macy’s—haven’t tried it however. It says that it lets you look up prices without having to download the full app.", "I’ve been to two restaurants with this option and it was such a pleasant surprise. Very easy way to pay and then leave. I wish more places did it, but they probably aren’t even aware of the option", "This sounds like a dream application for clips. Really hope it becomes standard.", "I would love this! Why can’t every restaurant have this yesterday?", "I don’t get the point compared to a webpage that includes Apple Pay.", "dunkin’ donuts is using it.\n\n\ni was on a trip out west and my chip was having trouble reading at a gas station. i got prompted for an app clip for the gas station to pay with apple pay. i still don’t fully get how it was prompted, but i’m glad it worked. i was on fumes (the attendant later told me that chip reader was broken on that pump).", "Boston, where Toast is based, has a lot of restaurants with the same experience. It’s fantastic.", "Same, my local pancake place uses an app that lets me do this, it’s amazing.", "Same, only time I’ve used an AppClip. It was for Toast. Worked perfectly. I was very impressed. Underrated feature imo.", "this sounds really great, but what feature benefit does this have over a simple, platform-agnostic webpage?", "Contactless payment with extra steps", "Used them at an Exxon gas station not too long ago.", "Toast has something similar. Instead of \"AppClip\" you pay through Toast on your phone. This brewery I went to in Milwaukee had it. The restaurant had their menu on it, your table has a specific QR code and you order your food through it and it gets delivered to your table. To pay you just close out on your phone, if you don't \"pay\" it charges you after 24hrs", "Not in America but in my country of residence, you can easily scan a QR code at pretty much everywhere to pay for your goods. Is it still worth it to use this app Clío thingy? If so, why?", "Came here to say Toast is the only time I’ve encountered them, but it was a super seamless and pleasant experience I wish I saw more often.", "I tried them at a gas station, but I had to go through all the steps of creating an account with some ~~no-name~~ unfamiliar-to-me payment processor and so I ended up walking inside and paying with a credit card.", ">Then I left without needing to wait for the waitress\n\nThis sounds like it could lead to a bad situation to me, but I'm glad it worked for you lol", "This and pay for parking are my fav implementations", "Same here. I've only ever seen the App Clip QR codes at the local Exxon station. It was NFC, just QR, but worked great. Scanned it, App Clip downloaded instantly, entered pump number, and paid with Apple Pay. Didn't need to cumbersomely register for any accounts. I really do wish this becomes more adopted by merchants.", "Oh that’s cool. Don’t need to touch the gas station buttons at least", "Same", "[deleted]", "At first it worked without the app but a couple of updates ago it made me download the app iirc", "That’s such a great use case!", "That feature was ok, but it only worked in imessage for me and most of the time even that doesn’t work", "i use this all of the time! i really like it.", "Scroll over to your App Library and scroll to the bottom. Any app clips that you’ve used are stored down there, [like this](https://i.imgur.com/NPyHjBr.jpg).", "Yeah. Same thing", "Yeah, it’s really great!", "They will be deleted automatically after 30 days of non-use", "*or don’t have the Services Victoria app.", "Can you use tik tok usually as a clip, or do they force you to download the app.", "That's what I was hoping they were for, along with other places where they make you download ANOTHER app. No one wants to download an app for only a few days and then never use it again, like at amusement parks, restaurants, shopping, etc.", "https://support.apple.com/guide/iphone/use-app-clips-iphb3a73ec53/ios", "May I know which museum? :)", "and you don't have to worry about someone carrying away your credit card away from you.  At this point with identity fraud running rampant, I don't ever want to hand anyone my credit card and it go out of my sight.", "believe this was the primary intended use case !", "Isn’t it just easier to pay using normal physical Apple Pay?", "If you aren't on the platform, you'd have to pay for all new POS and train your entire staff on the new platform, and features like QR code payment are usually additional monthly costs a restaurant wouldn't want to incur. Resturant POS is a mess", "Faster. Feels very native to iOS. I’d say it’s all feels rather than any technical advantage.", "Toast is the only app clip", "Hope this answers your question : https://imgur.com/a/ekjyjfG\n\niPhone 13 Mini that I bought two days ago running the latest iOS update. It took me a second to click on the notification once it appears on screen, that’s why there’s a little delay.", "Interesting. I just tried it and it works without the app installed. That’s weird", "So much better than just sending a tracking number like I used to", "sometimes it’s just quicker to open the link in safari rather than waiting for the app clip to load, it’s nice for when i don’t want to be bombarded with “DOWNLOAD TIKTOK”", "They also show up in the “Recently Added” section at the top right of the App Library screen.", "That’s the stupidest thing I’ve ever heard. It should be like 8 hours MAX.", "Thank you!", "It was some place in the middle of Sofia, capital of Bulgaria I don’t remember the name of it", "Is this still a thing? In (most of) Europe they bring the wireless terminal to you and you pay with contactless.", "It’s so bizarre to me that even Ukraine is ahead of the US in this regard. Every place (cafés, restaurants, shops etc) have wireless terminals they bring to you and you can pay with apple/google pay.", "At your table? Seems like they would need to bring a register system over for that.", "Companies like Toast are growing crazy fast my having a great user experience.", "POS meaning?", "Where I’m from there’s a bunch of restaurants that do this with a webpage instead of appclips and it works super fast. Just scan the QR at the table and you’re instantly at your bill. It’s also compatible with any android device which is a bug plus.", "[deleted]", "I think I worded it wrong at first. At the start it worked without anything installed, but for a 14.something update it made me either get the App Clip or the app itself so I got the app\n\nUpdate: Just deleted the app, it still works. I guess I pressed the notification and then it made me download the app. Stupid me", "Yeah, i just downloaded the app then so i dont keep getting redirects.", "Yes, the first time I saw the wireless terminals was when I went to Europe a few years ago.  I don't know/understand why the US doesn't implement this feature on a broader scale.  I think I've only gone to 1 or 2 restaurants where you can pay with credit card at the table.  Until it's more widely done, I just pay with cash at restaurants.  My husband and I had an incident some years back where it took the waitress over 30 minutes to return our credit card.  Very soon thereafter, we started getting a lot of fraudulent charges on that card.  I even commented to my husband while we were waiting for her to return the credit card, I was worried she was writing our credit card information down because it should not have taken that long to return it.  Ever since then, I have only ever paid in cash because I refuse to go through the hassle again of allowing someone to take my credit card out of my sight.", "In the UK everywhere does this. I went fishing recently by a remote lake and a bailiff rolled up on a quad and pulled a wireless terminal from his wax jacket, saying he didn’t take cash - paid with my Apple Watch and carried on fishing", "Most places in the US take your card. Some are finally starting to bring a reader to you. This is just a US thing, even Canada brings you the thing.", "It’s not standard yet. Expanding, but unfortunately not commonplace in the US.", "USA banking infrastructure isn’t centralized like in the EU. It’s great over here in Amsterdam", "I think in Ukraine it is required by law that the card owner has to be present during any transaction with the card. At least that’s what I heard. That’s why you are usually asked to walk with the waiter to the terminal if they do not have a wireless one.", "They do that in the UK, or London at least.  They come over with a small, handheld card reader. Super convenient.", "Lots of chains have little devices with a screen and card reader that live at each table now. Chilis, Red Robin and Olive Garden use the same \"Ziosk\" system. Your bill appears on the screen, you can choose to split it, select the tip and you go through the whole process yourself.", "To be fair, they do that everywhere outside of the US - even Canada.", "[deleted]", "It's American restaurant shorthand for the machine/screen that waitresses use to punch an order in to in large restaurants, while Marco is right it stands for \"Point of Sale\" but usually ppl say POS machine to get the context across. The POS machine usually generates a chit (a small piece of paper with a list of dishes in the order) and the cooks reheat which food based on what that chit says, in such restaurants. The point of this is to allow for clear communication of orders above the din of large commercial kitchens.", "Hahah ! If you indeed have an iPhone 7 congrats for being much more sustainable than some people on this sub. But yes, after 5 years it be time", "Glad I could be of service, although I have done much !", "Moved to Copenhagen from the States.  If the place doesn’t have a card processing system, you can just pay them with MobilePay, a system everyone here uses.  The only reason you need cash here is to go to Christiania.", "Yah I wish America had the wireless terminal too. I think I’ve only been to one place with it. And when I go to Vancouver, which is like a 3 hour drive, it’s quite common over there as well.", "An Apple credit card has no number printed on it, greatly reducing the ability to scam someone.", "Incidentally, some places use an iPad connected to a card reader to take payments. Why would you need to take a register around in 2022?!", "They don’t do that everywhere?", "This is pretty standard across whole of Europe, has been for best part of a decade.", "Nearly all major restaurant chains have these at every table in the us, you can call server, order and pay bill https://s.abcnews.com/images/Business/HT_applebee_preston_ml_131203_4x3_608.jpghttps://i.imgur.com/G8T33S2.jpg", "I have an iphone 6s, and it's running quite well, but i may upgrade in the next couple months", "I feel like it’s easier to bring a handheld card reader that supports NFC, chip reading, and swiping than an iPad", "It’s a lot more common in Europe than it is in the US for some reason.", "Yep, here in the us they don’t.  Except at Apple stores oddly.  There they have scanners attached to iPhones and will handle many of the transactions right on the floor rather than going to a cashier.", "Eating at chain restaurants, especially in the Applebees tier, is not very popular - especially with the (very large) demo of people who would be on Reddit", "Oh cool.  I’ve only seen them at airports.", "When they use the iPad to sort tables, take orders etc, they’re carrying it anyway and the card reader can live in their pocket. \n\nNo one swipes cards in the UK and assume most people here will use Apple Pay 🤷", "Cool I don’t eat at Applebees. And most people here do eat at chain restaurants. I dono what demographic you think Reddit is lol. It’s probably mainly underage anyway they don’t eat anywhere their parents aren’t taking them", "No one swipes cards here either. But it’s just easier to bring a card reader when the customers ask to Bring the check."]}, {"title": "Mobile App Clips (iOS)", "comments": ["Yes you can. \n\nTap into the camera live view. Top right calendar button. Top right three-dot button. There you will see Alerts which will show all alerts for that camera.", "Thanks! Very helpful for Alerts driven clips. \nIs there a way to view clips regardless of alert? For example if you continuous record and want to view the last hour but there are no alerts for that hour.", "Got it! Thanks, I didn't see the Clips/Alerts filter option."]}, {"title": "Welcome to iOS App Clips.", "comments": []}, {"title": "Blink App Clips Not Working On Chromebook?", "comments": ["This is what I found by searching Goggle. It doesn’t appear that the have a working app for you. Could be wrong.  Maybe someone has more info. \n\nhttps://support.blinkforhome.com/en_US/before-you-begin/current-blink-app-versions", "I can't view the clips either, I get a blank blue-screen. The work-around is if I click on the blue screen, the 'download' icon appears, and once downloaded I can view it. But this is not ideal. No issues on my mobile phone. I don't need to view clips on my Chromebook so it's not a big deal for me, I suggest you go to the blink app page on the Playstore and leave a review or contact the developer [android@blinkforhome.com](mailto:android@blinkforhome.com) to report the bug", "If it was working before and now it's not, my educated guess would be there was some sort of an update to your Chromebook that broke the app. You most likely will have to wait until the support requests start flooding in before the developer realizes there's an issue and updates the app with a fix. I'd suggest filing a support request with the app developer. The more people that do the sooner they will realize there's an issue and get it resolved.", "Blink just released the app for Chromebook I think back in July, so that link might not have been updated yet", "Thanks probably true. Blink hasn’t spent any money on the updates. They just put it all into advertising."]}, {"title": "Are you App Clips stored on the App Store or on your own server?", "comments": ["App Clips are distributed through the App Store (as part of their parent app). You need your own URL to invoke downloading from your website and this only works through Safari. There are other ways to download an App Clip (e.g. QR code) and you might not need your own URL for that, but I'm not sure."]}, {"title": "Ps App Clips Infinite Loading", "comments": ["The same thing is happening to me. Maby there is something going on that we don't know off."]}, {"title": "App clips", "comments": ["First off, you need to be somewhere where an App Clip is supported.\n\nTo use said App Clip, either A) tap iPhone to the App Clip-branded NFC sticker or B) scan the unique App Clip-branded circular code with your camera.\n\nA third means of using App Clips is via Spotlight. If you’re say, near a Panera, Spotlight can recommend the App Clip."]}, {"title": "Has Anyone Used App Clips for Acquisition?", "comments": []}, {"title": "Have you heard of Apple's App Clip technology making AR experiences seamless and instantly accessible?", "comments": ["I’m not the technical guy, so always love seeing and learning more - thanks!\n\nHow is this different from more general WebAR, which (to my layman understanding) already allows app-free experiences via a QR code or clicking on a link, and works for Android not just iOS?", "The only seamless way is not requiring any installation at all. All apps seem to be already installed, and they stream on demand. Maybe by clicking in camera view. Also this kind of AR is very limited."]}, {"title": "Fans if of iPhone app CLIPS: please help.", "comments": []}, {"title": "Have you heard of Apple’s App Clip technology?", "comments": []}, {"title": "For those who want to download the new watchface Metropolitan just frame the app clip and with the iPhone camera", "comments": ["Huh?", "But try to read\n\nhttps://i.imgur.com/jWyOFDX.jpg", "You do realize a watch that doesn’t have this face already cannot download it this way right?    All that gets downloaded are colour choices and complications."]}, {"title": "Japanese illustration app Clip Studio Paint has scrapped the rollout of its new AI image generator feature following the backlash from users.", "comments": []}, {"title": "Have you heard of Apple’s App Clip technology making AR experiences seamless and instantly accessible for iOS users?", "comments": ["Yes, there was some discussion on this when the technology was first introduced.\n\nIt’s died down now, probably waiting for appropriate hardware to be announced that can support this better."]}, {"title": "Should I be able to launch TestFlight app clip from invocation url?", "comments": ["..and its now started working.. I guess there is just a delay for something to update somewhere..", "gah - it was only working because I had a local experience set up on my test device. Without that - it still doesn't work.."]}, {"title": "App Clip examples", "comments": ["I have never encountered an App Clip in the wild.", "There's a restaurant in NYC I go to somewhat often that has QR codes at each seat, so you can order food/drinks whenever you want from your phone. First time I saw it thought the QR code just brought to you a website to show you the menu or something, but it was actually an app clip for whatever POS system that restaurant uses - I'm trying to think back to the name of it but can't recall which platform it was. But it was super cool, it downloaded the app clip in like 1 second and we used it to order all night. Then a day later it just vanished from my phone on it's own.", "I don't know if this still works but I've seen takes on the same idea: [https://www.macrumors.com/2020/09/26/phoenix-game-demo-app-clips/](https://www.macrumors.com/2020/09/26/phoenix-game-demo-app-clips/)\n\n&#x200B;\n\nSqueeze a video game level into an App Clip and make it available for free play that way.", "When you’re near the cathedral of Florence, Siri will suggest you an app clip to buy tickets for the cathedral and dome. I think that is pretty neat.", "Toast’s checkout system at restaurants is great. QR code on the receipt, app clip launches, Apple Pay to checkout", "There’s one for Shazam that gets triggered if you ask siri for a song", "Yelp uses app clips. They fire from Apple Maps pretty consistently", "I’m actually working on one. I’ll have usage data by the end of the year.", "During the peak of the pandemic, they were used for Victoria’s contact tracing system.\n\nhttps://www.reddit.com/r/iphone/comments/kbf01m/1st_app_clip_utility_app_in_the_wild/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "I’ve used exactly one of them. It was neat, but I definitely expected them to be more widely used.", "Me either!! 🙃 It's a shame though, it's the deluxe version of scanning a QR code and opening a crappy web page. I don't understand... at its introduction I immediately saw its tremendous potential but for some reason nobody's actually implementing it.", "TikTok uses them (sometimes) when a friend sends me a link to one since I don’t have the app. Haven’t seen it in a while though, most just take me to the web", "Diamond Parking has it", "You know your mind is broken when you always read POS as piece of shit 🥲", "Apple owns Shazam. Is this a feature that anyone can make?", "One reason: You put in the effort to build something that works perfectly for everyone on iPhones, but leaves out everyone else. \n\nA crappy web page covers most people at least.", "To be fair, most POS systems are P's of S.", "haha, I got a broken mind then, what else did he mean? 😅", "Sure but still, as a user I'd be delighted by the better experience and I'd install the full app immediately if the app clip impressed me. My only guess is Apple probably restricts the shit out of it killing it DOA", "Point of sale 😂"]}, {"title": "is this the subreddit for the app clip art if so question", "comments": []}, {"title": "First PO-app clip", "comments": ["Nice!", "Gross video.", "Sounds awesome! How did you get multiple measures? I can only get a single measure (16 steps) before it just repeats the same pattern.", "Thanks!"]}, {"title": "App Clip Code generator command line tool?", "comments": ["Found it by searching « clip » on the downloads listing", "Are you on a paid developer account? I can see it with the link on that page.\n\nUploaded here anyway: https://we.tl/t-Ab02mGz5Yv", "Thanks!", "Do Apple share a hash to their binaries? Otherwise I don’t think re uploading binaries to other websites is a good idea and it shouldn’t be encouraged/accepted even \n\nUnless you guys forgot about the backdoored Xcode version some years ago"]}, {"title": "I can't be the only one that never was so lucky to use a app clip right?", "comments": ["I live in the US and I haven’t used App Clips either. I did see a sticker to scan a QR code to pay with an App Clip once but that’s it.", "I’ve never used it", "Same", "I probably encounter 2-3 app clips a year. Usually pertaining to a restaurant. Los Angeles area.", "I finally found one in the US (vacation), but couldn’t use it because the app wasn’t available in the german store.\n\nI’ve never encountered one in Germany.", "Never used it, I don't think it's taking off at all.\n\nThe only one time I saw, it was yelp. Nope, go away yelp.", "I’ve used them before. Mostly for restaurants in Santa Cruz and LA.", "Perhaps I’m the only person in the world that doesn’t use TikTok, but whenever someone forwards me a video it opens in an AppClip.", "I see them on all the pumps at Exxon gas stations around me here in Houston but none of them have ever worked", "Enable music detection in the control Center. It uses a Shazam AppClip.", "Thanks that was the first time I used it!!!"]}, {"title": "AppClip Size too big", "comments": ["Try this:\n\nhttps://shopify.engineering/building-app-clip-react-native", "Sorry, I've been seeing this one, but what specifically to try from that article regarding the size issue?", "Well it seems the main reason for the App Clip sizes getting out of hand are the native modules (pods). First thing the Shopify team did was look for the bare minimum `pods` required which looked something like this:\n\n```\ntarget 'Shop' do\n\npod 'React', :path => '../node\\_modules/react-native/'\n\ntarget 'Shop App Clip' do pod 'React', :path => '../node\\_modules/react-native/' pod 'React-Core', :path => '../node\\_modules/react-native/' pod 'React-RCTImage', :path => '../node\\_modules/react-native/Libraries/Image' pod 'React-RCTNetwork', :path => '../node\\_modules/react-native/Libraries/Network' pod 'React-RCTSettings', :path => '../node\\_modules/react-native/Libraries/Settings' pod 'React-RCTText', :path => '../node\\_modules/react-native/Libraries/Text'\n```\n\nAfter that they had a App Clip around 4-5Mb. They then one by one added any more native dependencies in the pod file manually and got it to around 6.5Mb... I'd start there, if you're trying to add substantial amounts of screens etc I'd argue that RN might not be the best way forward.", "hmm.. i've thinning up these, but the problem was the appclip that created also kinda need some library since it kinda like my already released mini map, and also dunno wheter its related with the latest rect native or not but when i tried even the bare minimum react native core only, it still takes around 8mb in my case", "Sorry for the formatting the Reddit editor sucks ass when it comes to inline code...", "I'd follow the same approach in the Article linked above. They started by creating an App Clip with nothing but a Hello World text and the bare minimum pods needed to get RN to run. It shouldn't be 8Mb so there must be another dependancy or something in your code specifically that's bumping up the size.", "its ok"]}, {"title": "online eraning in pakistan original app clip claps", "comments": []}, {"title": "Alter Vincent Alpha Sketch WIP! 🤗 App: Clip Studio Paint EX on iPad Pro!", "comments": ["Very pretty", "That is fantastic!", "Thank you so much! 🤗🥰🙏🏻💕", "Thank you very much! 🤗🥰💕🙏🏻"]}, {"title": "Web app \"CLIP Guided Openai Diffusion Faces Model\" is available", "comments": []}, {"title": "Had my first experience with a App Clip...", "comments": ["I want it to take off but guessing developers aren’t getting a benefit from it. Straight guess. It was an iOS feature I looked forward to a lot. \n\nI’ve used it to order Panera once when I was in Georgia. Only problem was they didn’t let me see the full menu.", "I’ve used them quite a bit, especially at gas stations. I like em."]}, {"title": "Testing production App Clip", "comments": ["Try `https://app-site-association.cdn-apple.com/a/v1/YOURDOMAIN` in browser.\n\nThis will return what AASA file Apple's CDN has cached. \nIf this returns as blank screen, then check if your website isn't possibly geo-restricted.\n\nApple's bot must be able to access the `.well-known` folder.", "Check in XCode if you your \"Associated Domains\" are correct, depending on what your invocation URL is. \"www.yourdomain.com“ is not the same as \"yourdomain.com\". Maybe also chck redirects on your website just in case.\n\nDid it work with \"Local Experiences\" created from the developer settings?", "Yep, that looks correct!", "Yeah I have it in Xcode as \"[domain.com](https://domain.com)\" for both appclips and applinks in the main target and then applinks in the App Clip target", "Regarding your domain, just to be sure: If you enter \"domain.com\" in your browser, does it redirect you to \"www.domain.com\"? The www will be treated as a different subdomain and is not covered if you just have \"domain.com\" associated in XCode afaik.", "No it goes straight there, but I think I’ve worked it out just in talking in this thread. I think it should be appclips:domain.com in the clip target and I’ve put applinks:domain.com"]}, {"title": "How you can use Ploppy Pairs App Clip Code when you are on your Phone: 1. Take a screenshot and open it 2. Tap the scan button on the bottom right 3. Tap the code 4. Start playing", "comments": []}, {"title": "Try one level of Ploppy Pairs for free by scanning this App Clip Code", "comments": []}, {"title": "Testing scanning App Clip QR code with full app", "comments": ["Need some more details.\n\nWhen you say you \"have all the App Clip working\" what do you mean? Do you have it submitted to App Store Connect? Are you able to launch it from QR code without the app installed on your device?\n\nAs for transitioning to the full version of the app, there is a code snippet you can execute at whatever point makes the most sense for you to offer the full version of the app. User will see a prompt and if they tap it they will download the full version.\n\nIf you have the app installed and scan the QR code, yes it should behave like a deeplink. (Assuming you have deeplinking set up correctly.)", "Hey, sorry. When I say \"have all the App Clip working\" I don't mean that I've submitted it to the store, I just mean I'm pretty much code complete and I've got it launching from a local experience on my dev device. Can you point me in the direction of the code snippet for transitioning to the full app?\n\nLastly, for deeplinking. I hadn't previously got it setup, but am just following along [here](https://developer.apple.com/documentation/xcode/allowing-apps-and-websites-to-link-to-your-content?language=objc) which I reckon is the right place?"]}, {"title": "Win 1 Year access to cooking app ClipDish for iPhone / iPad", "comments": ["\nHey \\#cooking Twitter. 24H \\#Giveaway of 1 yr subscription to @GetClipDish iPhone/iPad app\n\nTo win:\n✅ Follow @GetClipDish\n✅ RT &amp; Like this post\n✅ Tag 3 friends who 😍 to 🍳\n✅ Download App from App Store\n\nResults on 17th March.\n\n___\n \n\nposted by [@GetClipDish](https://twitter.com/GetClipDish/)\n\n\n\n^(Media in original tweet is missing? Please PM me to let me know. If media is missing because a tweet is a reply to another tweet or a quote, I will add functionality to display media from these kind of tweets in the future.)"]}, {"title": "Use App Clip as demo version?", "comments": ["No practical experience but I do not think you're going to pass App Review if you're using an App Clip as a \"demo\" version.  If it's a fully functional version of your game that came be played in limited form, then cool, but if the user is going to hit a message that says \"Download the full app to continue\" playing, I think that's crummy.\n\nI think of App Clips in the form of the barest minimum functionality my user needs to use my app.  So if it's an app that lets me order food, like Door Dash, an App Clip might launch with some location-based data to show a list of restaurants, pick one, order food, and pay with Apple Pay.  But I reserve the bigger functionality for the main app; that being the ability to search for food in a different area, account management, promos, etc.  I think of App Clips as quick interactions compared to spending more time in the parent app.", "No\n\n>An App Clip is a lightweight version of your app that lets people perform everyday tasks quickly, without downloading and installing your app. \n\nDemo doesn't work like that, it's just your full app downloadable free from the store with some features hidden behind in app purchases, that's all"]}, {"title": "Web App: Clip 3D Model", "comments": []}]